{"extracted_information": "إرشادات مفصلة ومعايير ومتطلبات لصائدي الثغرات المشاركين في مهام Bugcrowd.", "specifications": {}, "pricing": {}, "features": [{"category": "مدونة السلوك - عام", "points": ["تنطبق على جميع التفاعلات مع أعضاء فريق Bugcrowd والعملاء والباحثين.", "تهدف إلى الحفاظ على بيئة آمنة ومرحبة لجميع أفراد المجتمع.", "مطلوبة للمشاركة في أنشطة الأمن المعتمدة على الحشود، وعروض المجتمع عبر الإنترنت (IRC، Slack، Discord، فعاليات القرصنة الافتراضية)، وبرامج Bugcrowd الأخرى."]}, {"category": "معايير السلوك المهني", "points": ["كن لطيفًا.", "كن محترمًا ومهنيًا في اتصالاتك وسلوكك.", "التزم بمعايير سلوك منصة Bugcrowd.", "ساعد Bugcrowd على التحسن من خلال مناقشات صادقة وعميقة مع الزملاء والشركاء.", "كن سريعًا في الإبلاغ عن الثغرات التي اكتشفتها.", "استخدم القنوات الصحيحة للكشف أو التواصل بشأن تقديمات الثغرات الأمنية.", "قدم تقارير كاملة ومفصلة وواضحة تتضمن وصفًا كاملاً وإثباتًا للمفهوم وخطوات استنساخ كاملة في التقرير الأصلي (التقديمات المؤقتة غير مقبولة).", "اقرأ والتزم بشروط الكشف القياسية الخاصة بـ Bugcrowd وكل موجز برنامج للمكافآت.", "اتبع جميع الإرشادات والقواعد التي حددها برنامج أمني معين يعتمد على الحشود أو شركة بخصوص نطاق الاختبار والكشف."]}, {"category": "المتطلبات الأخلاقية", "points": ["لا تضلل العملاء أو Bugcrowd عمدًا.", "أبلغ عن نقاط الضعف التي تم العثور عليها لإصلاحها، ولا تستغلها.", "لا تشارك معلومات الثغرات السرية أو معلومات العملاء.", "عملاء البرامج الخاصة سريون؛ ولا يجوز الكشف عن أي ثغرة تم تقديمها دون إذن صريح من العميل.", "إذا أدت ثغرة إلى وصول غير مقصود إلى البيانات، فحد من الوصول إلى الحد الأدنى المطلوب لإثبات تأثير الثغرة بفعالية.", "توقف عن الاختبار وقدم تقريرًا فورًا إذا صادفت أي بيانات مستخدم أثناء الاختبار (مثل معلومات التعريف الشخصية، معلومات الرعاية الصحية الشخصية، بيانات بطاقة الائتمان، أو معلومات خاصة بالملكية).", "في حال الوصول إلى معلومات التعريف الشخصية أو البيانات الحساسة الأخرى، يتعين عليك اتباع جميع القوانين واللوائح المعمول بها للوصول إلى ومعالجة هذه المعلومات و/أو البيانات، مثل اللائحة العامة لحماية البيانات للاتحاد الأوروبي (اللائحة (الاتحاد الأوروبي) 2016/679)، بما في ذلك البنود التعاقدية القياسية للمفوضية الأوروبية بشأن نقل البيانات الشخصية إلى المعالجين وقانون خصوصية المستهلك في كاليفورنيا لعام 2018، وقانون حقوق خصوصية كاليفورنيا لعام 2020 بمجرد دخوله حيز التنفيذ."]}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": [{"type": "رابط خارجي", "description": "معايير سلوك المنصة", "url": "https://www.bugcrowd.com/resources/hacker-resources/platform-behavior-standards/"}, {"type": "مصدر داخلي", "description": "مركز وثائق الباحثين"}, {"type": "مصدر داخلي", "description": "مصادر الباحثين"}, {"type": "مصدر داخلي", "description": "الأسئلة الشائعة"}]}