{"extracted_information": "تحدد مدونة قواعد السلوك الخاصة بـ Bugcrowd السلوكيات المطلوبة من جميع أفراد مجتمع Bugcrowd المشاركين في عمليات الأمن المعتمدة على الحشود، وعروض مجتمع Bugcrowd عبر الإنترنت (مثل قناة Bugcrowd IRC، قناة Bugcrowd Researcher Slack، Discord، وفعاليات القرصنة الحية الافتراضية)، بالإضافة إلى أي برامج وفعاليات أخرى قد تقدمها Bugcrowd. تنطبق هذه المدونة على جميع التفاعلات مع أعضاء فريق Bugcrowd والعملاء والباحثين، لضمان بيئة آمنة ومرحبة للجميع.", "specifications": {}, "pricing": {}, "features": [{"name": "القيم الأساسية", "description": "تتمثل القيم الأساسية في البساطة وعدم التعقيد:", "details": ["كن لطيفًا.", "كن محترمًا ومهنيًا في اتصالاتك وسلوكك، ومتوافقًا مع معايير سلوك المنصة (Platform Behavior Standards).", "كن أخلاقيًا: لا تضلل العملاء أو Bugcrowd عمدًا. وظيفتك هي محاولة كشف الثغرات التقنية والمنطقية التجارية، ولكن عند العثور على ضعف، وظيفتك هي الإبلاغ عنه لإصلاحه، وليس استغلاله.", "ساعدنا على التحسين: يتم ذلك من خلال المناقشات الصادقة والمتبصرة مع الزملاء والشركاء."]}, {"name": "معايير الإبلاغ عن الثغرات", "description": "معايير محددة للإبلاغ عن الثغرات الأمنية:", "details": ["الإبلاغ الفوري عن الثغرات المحددة.", "إرشادات الكشف: لا تشارك معلومات الثغرات السرية أو معلومات العملاء. برامج الثغرات الخاصة بالعملاء تعتبر خاصة، ولا يجوز الكشف عن أي ثغرة تم تقديمها (بما في ذلك المكررة أو خارج النطاق أو غير المنطبقة، وما إلى ذلك) دون إذن صريح من العميل. يجب قراءة ملخصات المكافآت لكل برنامج للحصول على سياسات الكشف الخاصة به، والتي تحل محل هذه السياسة. يجب استخدام القنوات المناسبة للكشف أو التواصل بشأن تقديمات الثغرات.", "إذا كانت الثغرة توفر وصولاً غير مقصود إلى البيانات: يجب الحد من كمية البيانات التي يتم الوصول إليها إلى الحد الأدنى المطلوب لإثبات تأثير الثغرة بفعالية؛ والتوقف عن الاختبار وتقديم تقرير فورًا في حال العثور على أي بيانات مستخدم أثناء الاختبار، مثل معلومات التعريف الشخصية (PII)، معلومات الرعاية الصحية الشخصية (PHI)، بيانات بطاقات الائتمان، أو معلومات خاصة. في حال الوصول إلى PII أو بيانات حساسة أخرى، يجب اتباع جميع القوانين واللوائح المعمول بها للوصول إلى ومعالجة هذه المعلومات و/أو البيانات الشخصية، مثل اللائحة العامة لحماية البيانات في الاتحاد الأوروبي (GDPR)، وقانون خصوصية المستهلك في كاليفورنيا لعام 2018 (CCPA)، وقانون حقوق الخصوصية في كاليفورنيا لعام 2020 (CPRA) عند سريانه.", "لا يُسمح بإنشاء تقديمات وهمية تستخدم لـ 'الاستحواذ' على النتائج (مثل التقارير التي تُرسل بسرعة بعنوان مبهم وبدون خطوات تفصيلية لإعادة إنتاج الثغرة في التقرير الأولي)؛ يجب تقديم جميع النتائج الصالحة بوصف كامل وإثبات مفهوم وخطوات إعادة إنتاج كاملة في التقرير الأصلي. في الحالات التي يفتقر فيها التقرير الأولي إلى وصف وإثبات مفهوم وخطوات إعادة إنتاج، سيتم إغلاق تلك التقارير، ويجب إعادة تقديمها بالمعلومات المطلوبة ليتم أخذها في الاعتبار في البرنامج.", "يجب قراءة والالتزام بشروط الكشف القياسية لـ Bugcrowd وملخص مكافأة كل برنامج. يجب اتباع جميع الإرشادات والقواعد التي حددها برنامج أمني معين يعتمد على الحشود أو شركة بخصوص نطاق الاختبار والكشف."]}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": ["https://www.bugcrowd.com/resources/hacker-resources/platform-behavior-standards/", "مركز وثائق الباحث (Researcher Documentation Centre)", "موارد الباحث (Researcher Resources)", "الأسئلة الشائعة (FAQ)"]}