{"extracted_information": "تحتوي هذه الصفحة على معلومات تفصيلية حول أنواع البرامج المختلفة (الخاصة، العامة، برامج الإفصاح عن الثغرات، واختبارات الاختراق من الجيل التالي) وهياكل المكافآت المرتبطة بها على منصة Bugcrowd.", "specifications": {}, "pricing": {"برامج مكافآت الأخطاء (Bug Bounty)": "مكافآت نقدية، نقاط تقدير (kudos)، أو مزيج من الاثنين لاكتشاف الثغرات والإبلاغ عنها.", "برامج الإفصاح عن الثغرات (VDP)": "لا تهدف بشكل أساسي إلى تقديم مكافآت نقدية أو نقاط تقدير فقط. الغرض الرئيسي هو الإفصاح المسؤول عن المشكلات الأمنية وتحديد الأهداف غير المعروفة/غير المختبرة. توفر فرصة للباحثين لبناء علاقات مع مالكي البرامج والتعرف على عملية الإفصاح عن الثغرات.", "اختبارات الاختراق من الجيل التالي (NGPT)": "مبلغ أساسي للدفع مقابل إكمال المنهجية (يختلف حسب الحجم والنطاق وتعقيد الهدف) بغض النظر عما إذا تم الكشف عن ثغرات فريدة. بالإضافة إلى مكافأة إضافية على شكل مكافأة عن الثغرات التي يتم تحديدها."}, "features": [{"نوع_البرنامج": "برنامج مكافآت الأخطاء الخاص (Private Bug Bounty Program)", "الوصف": "برنامج يتم بالدعوة فقط ولا يتم نشره علنًا. يتم دعوة الباحثين الذين أثبتوا قدراتهم من خلال البرامج العامة. يهدف Bugcrowd إلى مطابقة الباحثين مع البرامج الخاصة التي تتناسب مع مهاراتهم.", "الوصول": "بالدعوة فقط"}, {"نوع_البرنامج": "برنامج مكافآت الأخطاء العام (Public Bug Bounty Program)", "الوصف": "برنامج متاح للعامة على موقع Bugcrowd الإلكتروني ويمكن لأي شخص زيارته والاطلاع عليه. يسمح لأي باحث على منصة Bugcrowd بالانضمام والبدء في الاختبار على الفور.", "الوصول": "متاح للعامة"}, {"نوع_البرنامج": "برنامج الإفصاح عن الثغرات (Vulnerability Disclosure Program - VDP)", "الوصف": "يوفر وسيلة لمجتمع الأمن بأكمله للإبلاغ عن أي مشكلات أمنية قد يحددونها في الأصول العامة للشركات واستكشافها بمسؤولية. لا يهدف إلى أن يكون نسخة 'kudos-only' من مكافأة الأخطاء. برامج شاملة تغطي جميع أصول الشركة المواجهة للإنترنت، وغالبًا ما تستخدم لتحديد أهداف غير معروفة أو غير مختبرة. تشجع Bugcrowd جميع المنظمات على أن يكون لديها شكل من أشكال VDP.", "الوصول": "متاح للعامة للبحث والوصول"}, {"نوع_البرنامج": "اختبار الاختراق من الجيل التالي (Next Generation Pen Test - NGPT)", "الوصف": "يجمع بين فعالية مكافآت الأخطاء والنتائج الموجهة نحو الامتثال لاختبارات الاختراق. يتألف من اختبار حر الشكل وتقييم قائم على المنهجية (عادة أسبوعين). يتم تجميع جميع النتائج في تقرير نهائي.", "الوصول": "بالدعوة فقط"}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": []}