{"extracted_information": "تحتوي هذه الوثيقة على تفاصيل حول البدء واستخدام واجهة برمجة تطبيقات Bugcrowd (API)، بما في ذلك طرق المصادقة وإدارة بيانات الاعتماد.", "specifications": {"rate_limiting": "60 طلب في الدقيقة لكل عنوان IP", "supported_ip_versions": "IPv4 فقط في قائمة السماح", "authentication_header_example": "Authorization: Token gvnzkgmklo:gPYS2SMN3zJ_k-QAEvyMAcr_PqsGlA-vJ2voA7ysZ635GlT_VZdr2Sg3_YCctkM3SwnBtDCn", "accept_header_example": "Accept: application/vnd.bugcrowd+json"}, "pricing": {}, "features": [{"name": "المصادقة", "description": "تُمنح رموز الوصول (Access Tokens) لكل مستخدم وتوفر الصلاحية للموارد بناءً على دور المستخدم. يمكن توفير عدة رموز وصول لكل مستخدم، ويمكن إبطال الوصول عن طريق حذف الرمز."}, {"name": "توفير بيانات الاعتماد", "description": "لتوفير بيانات اعتماد الوصول، يتم تسجيل الدخول إلى Bugcrowd، ثم الانتقال إلى صفحة 'API Credentials' من قائمة ملف التعريف، وتحديد اسم وصفي لبيانات الاعتماد، ثم النقر على 'Create credentials'. يجب حفظ الرموز المميزة فور ظهورها لأنها لن تكون قابلة للعرض بعد تحديث الصفحة."}, {"name": "ربط رموز API بقائمة السماح (Allowlist)", "description": "لأمان إضافي، يمكن ربط رموز API بقائمة سماح تحتوي على عناوين IP أو نطاقات محددة. يمكن إضافة عدة عناوين IP إلى قائمة السماح."}, {"name": "تثبيت إصدار API (Pinning API Version)", "description": "يمكن تثبيت إصدار API المحدد لرمز مميز من خلال تحديد الإصدار المطلوب من القائمة المنسدلة. سيتم استخدام هذا الإصدار المثبت إذا لم يتم توفير عنوان `Bugcrowd-Version` في الطلبات."}, {"name": "حذف بيانات اعتماد API", "description": "يمكن حذف بيانات اعتماد API عن طريق النقر على أيقونة الحذف في عمود 'Actions' وتأكيد الحذف."}, {"name": "عرض مفاتيح API", "description": "يمكن لأصحاب الأدوار 'Organization Owner' عرض مفاتيح API المستخدمة (سواء كانت نشطة، غير نشطة، أو منتهية الصلاحية)، وعنوان IP وتاريخ آخر استخدام، وإبطال الرموز المميزة حسب الحاجة."}, {"name": "خصائص Markdown", "description": "تستخدم بعض موارد Bugcrowd حقول Markdown للسماح بوظائف النص المنسق. يمكن استرداد أو تعيين حقول Markdown بتنسيق Markdown فقط."}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": [{"name": "أحدث إصدار لواجهة برمجة تطبيقات Bugcrowd", "url": "/api/latest"}, {"name": "صفحة بيانات اعتماد API", "url": "https://tracker.bugcrowd.com/user/api_credentials"}]}