{"extracted_information": "يحتوي المحتوى على معلومات مفصلة حول نظام تقييم الثغرات المشترك (CVSS) بإصداره 4.0، واعتماد منصة Intigriti لهذا الإصدار، وتأثير ذلك على تقييم الثغرات والمكافآت.", "specifications": {"CVSS_Definition": "نظام تقييم الثغرات المشترك (Common Vulnerability Scoring System) هو إطار عمل مفتوح للأمن السيبراني، تملكه منظمة 'Forum of Incident Response and Security Teams' (FIRST) غير الربحية ومقرها الولايات المتحدة. مهمة FIRST هي مساعدة فرق الاستجابة للأمن السيبراني حول العالم في حساب خطورة الثغرات الأمنية بسرعة وسهولة بناءً على المقاييس.", "CVSS_4.0_How_It_Works": "مصمم لتقييم خطورة الثغرات الأمنية عبر بيئات وأبعاد متعددة، بما في ذلك قابلية الاستغلال والتأثيرات. يوفر نتيجة رقمية للثغرات.", "CVSS_4.0_Key_Groups": [{"name": "Base (أساسي)", "description": "يمثل العناصر الجوهرية التي تكون ثابتة بمرور الوقت وعبر البيئات."}, {"name": "Threat (تهديد)", "description": "يمثل خصائص الثغرات التي تتغير بمرور الوقت."}, {"name": "Environmental (بيئي)", "description": "يمثل خصائص الثغرات الفريدة لبيئة معينة."}], "CVSS_4.0_Supplemental_Group": {"name": "Supplemental (إضافي)", "description": "يمثل الخصائص التي تكمل المقاييس. لا يؤثر على النتيجة النهائية ولكنه يوفر سياقًا إضافيًا."}, "CVSS_4.0_Value_vs_3.0": "يوفر CVSS v4.0 دقة محسّنة في التقييم، وتوافقًا أفضل مع تقييمات المخاطر الواقعية، ومقاييس إضافية تساعد المؤسسات على اتخاذ قرارات أمنية أكثر استنارة. مع تقييمات خطورة أوضح، يستفيد كل من الباحثين والمؤسسات من عملية تقييم أكثر اتساقًا وشفافية. يوفر الإصدار 4.0 رؤية محسّنة وتمثيلًا للمخاطر في العالم الحقيقي من خلال تقديم عناصر جديدة مثل جهود التخفيف والاسترداد.", "CVSS_4.0_Differentiators_from_3.0": ["إزالة النطاق (Scope): تم استبدال مفهوم النطاق بمفاهيم النظام الضعيف (VC, VI, VA) والنظام اللاحق (SC, SI, SA)، لالتقاط التأثيرات من كليهما عند الاقتضاء.", "تقييم الثغرات في مكتبات البرامج: إرشادات جديدة تشرح كيفية تقييم تأثير الثغرة في المكتبة.", "درجات CVSS Base متعددة (CVSS-B): تسمح الإرشادات صراحة بإنشاء درجات CVSS Base متعددة لثغرة تؤثر على إصدارات منتجات أو منصات أو أنظمة تشغيل متعددة.", "إرشادات استخدام مقاييس متطلبات الأمان البيئية: تتضمن مجموعة المقاييس البيئية ثلاثة مقاييس لمتطلبات الأمان: متطلب السرية للنظام الضعيف (CR)، ومتطلب التكامل للنظام الضعيف (IR)، ومتطلب التوافر للنظام الضعيف (AR)."]}, "pricing": {}, "features": ["تقييم شامل للثغرات مع دقة وشمولية أعلى.", "مرونة أكبر للعملاء في تقييم الثغرات وتحديد أولوياتها.", "دعم شامل للانتقال إلى CVSS 4.0 عبر أدوات المنصة وتحسيناتها."], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": ["First.org: https://www.first.org/cvss/v4-0/user-guide", "Intigriti Knowledge Base: https://kb.intigriti.com/en/articles/11463887-using-the-cvss-calculator-incl-4-0-on-intigriti"], "Intigriti_Adoption": {"Reason_for_Adoption": "مع تقديم CVSS 4.0، تهدف Intigriti إلى تزويد العملاء بدقة محسنة في تقييم الثغرات، ومساعدتهم على تحديد أولويات جهود الإصلاح بفعالية أكبر. يتيح نظام التقييم المحسن لـ CVSS 4.0 تقييمات أكثر دقة للثغرات، مما يعزز مواءمة أفضل للمكافآت للباحثين ويمكّن المؤسسات من اتخاذ قرارات أكثر استنارة فيما يتعلق بالإصلاح وتخصيص الموارد.", "Statement_Yannick_Merckx": "صرح يانيك ميركس، مدير تسويق المنتجات في Intigriti، بأنهم سيستمرون في مراقبة اتجاهات الصناعة واحتياجات العملاء المتطورة لضمان أن تبقى منصتهم متوافقة مع أفضل الممارسات والمعايير الناشئة، وتتوقع الاحتياجات المستقبلية. مع اختبار CVSS 4.0 بالكامل واعتماده بالفعل من قبل جزء كبير من قاعدة عملائهم، تلتزم Intigriti بدعمهم خلال هذا الانتقال، وتوفير الأدوات وتحسينات المنصة اللازمة.", "Availability_Configuration": "الآلة الحاسبة متاحة لجميع عملاء Intigriti. يتم تعيين التكوين على مستوى الشركة، مما يعني أن جميع البرامج داخل المنظمة تعتمد طريقة تقييم الخطورة الجديدة. يمكن للشركات التبديل إلى CVSS 4.0 متى كانت جاهزة.", "Impact_on_Assessment_and_Rewards": "التقييمات المحسّنة للخطورة تؤدي إلى مواءمة أفضل للمكافآت للباحثين، وتمكين المؤسسات من اتخاذ قرارات أكثر استنارة بشأن الإصلاح وتخصيص الموارد، وتحسين الدقة في تقييم الثغرات، والمساعدة في تحديد أولويات جهود الإصلاح بشكل أكثر فعالية."}}