{"extracted_information": "مشروع disclose.io يوفر أدوات مفتوحة المصدر لتعزيز صحة \"نظام المناعة الإنترنتي\" من خلال تسهيل الإفصاح المسؤول عن الثغرات الأمنية. يهدف المشروع إلى جعل عملية الإفصاح عن الثغرات آمنة وبسيطة وموحدة. يوفر أدوات وموارد لمساعدة الباحثين الأمنيين والمؤسسات على حد سواء، مع التركيز بشكل خاص على مفهوم \"الملاذ الآمن\" لحماية الباحثين ذوي النوايا الحسنة.", "specifications": {"policymaker_output_capabilities": "يولد سياسات إفصاح عن الثغرات (VDP) مخصصة ومتوافقة مع disclose.io، بما في ذلك بند الملاذ الآمن (Safe Harbor clause)، ملف security.txt، ومولد DNS Security TXT."}, "pricing": {"status": "مجاني", "details": "يقدم المشروع أدوات وموارد مفتوحة المصدر ومجانية."}, "features": [{"name": "نشر سياسات الإفصاح عن الثغرات (VDP) باستخدام Policymaker", "description": "أداة لإنشاء VDPs مخصصة ومتوافقة مع disclose.io، تتضمن بند الملاذ الآمن، وsecurity.txt، ومولد DNS Security TXT."}, {"name": "البحث عن برامج VDP ومكافآت الأخطاء", "description": "قاعدة بيانات للبحث عن برامج الإفصاح عن الثغرات ومكافآت الأخطاء، مع توفير تفاصيل حول كيفية تقديم النتائج الأمنية وحالة الملاذ الآمن."}, {"name": "مساعدة الإفصاح", "description": "الحصول على مساعدة في العثور على جهات اتصال أمنية من مجتمع disclose.io والتعاون."}, {"name": "دعم أفضل الممارسات", "description": "المساهمة في أو استخدام أدوات لدمج أفضل الممارسات مثل الملاذ الآمن والجداول الزمنية الاستباقية للإفصاح في برامج VDP."}, {"name": "المساهمة في مشروع dioterms مفتوح المصدر", "description": "إمكانية المساهمة في سياسة الإفصاح عن الثغرات مفتوحة المصدر لـ dioterms عن طريق الإبلاغ عن المشكلات أو تقديم ترجمات لغوية أو قانونية إقليمية."}], "statistics": {}, "temporal_info": {"formation_history": "تأسس مشروع disclose.io من دمج مشاريع توحيد منفصلة بدأتها جهات متعددة، بما في ذلك RainForest Puppy، Bugcrowd، Cipherlaw، Dropbox، الدكتور أميت العلازاري، جامعة كاليفورنيا بيركلي، الهيئة الوطنية للنقل والمعلومات (NTIA)، ووزارة العدل الأمريكية.", "organizational_status": "في طور السعي للحصول على وضع منظمة غير ربحية (501.c3)."}, "geographical_data": {}, "references": ["RainForest Puppy", "Bugcrowd", "Cipherlaw", "Dropbox", "Dr. Amit Elazari", "UC Berkeley", "National Transport and Information Authority (NTIA)", "US Department of Justice (US DOJ)"], "target_audience": ["المخترقون والباحثون عن الثغرات (Hackers and Finders)", "الفرق القانونية (Legal teams)", "المنظمات (Organizations)", "الباحثون الأمنيون (Security Researchers)"], "responsible_disclosure_guidelines_principles": {"safe_harbor_concept": "الملاذ الآمن هو مصطلح يشير إلى البنود المضافة إلى السياسات العامة التي تسمح للأفراد الذين يتصرفون بحسن نية (كما يحدده المستلم بوضوح واستباقية) بتقديم ملاحظات أمنية دون خوف من تداعيات قانونية. يهدف disclose.io إلى المساعدة في تعريف هذا المفهوم ونشره ومكافأة اعتماده في برامج الإفصاح عن الثغرات.", "best_practices_promotion": "تشجيع تضمين أفضل الممارسات مثل الملاذ الآمن والجداول الزمنية الاستباقية للإفصاح في برامج VDP."}, "disclaimer": "المعلومات المقدمة لا تشكل نصيحة قانونية. يرجى استشارة مستشارك القانوني الخاص بك لتحديد مدى ملاءمة شروط disclose.io في مؤسستك."}