{"extracted_information": "قامت وزارة العدل الأمريكية (DOJ) بتحديث سياستها التوجيهية للاتهامات بموجب قانون الاحتيال وإساءة استخدام الكمبيوتر (CFAA)، وهو القانون الرئيسي الذي يستخدمه المدعون العامون لاتهام الجرائم الإلكترونية. يهدف التحديث إلى الإجابة على التساؤلات المستمرة حول لغة CFAA وإمكانيات تطبيقها الواسع، وتحديد أهداف DOJ لإنفاذ CFAA، وإنشاء سياسة رسمية للموقف غير الرسمي لـ DOJ بعدم توجيه اتهامات ضد 'أبحاث الأمن بحسن نية'. كما يوجه التحديث بعدم توجيه اتهامات بموجب CFAA في حالات أخرى تتعلق بقرار المحكمة العليا لعام 2021 في قضية *فان بيورن ضد الولايات المتحدة*، مثل انتهاكات قيود الوصول الواردة في اتفاق تعاقدي أو شروط الخدمة، أو انتهاكات سياسة صاحب العمل.", "specifications": {"CFAA_background": "تم إصداره عام 1986، وهو القانون الرئيسي لجرائم الكمبيوتر في الولايات المتحدة. يحظر عمومًا الوصول إلى جهاز كمبيوتر محمي 'بدون تصريح' أو بعض فئات السلوك التي تتضمن 'تجاوز الوصول المصرح به'. يعرف 'يتجاوز الوصول المصرح به' بأنه الوصول إلى كمبيوتر بتصريح واستخدام هذا الوصول للحصول على أو تغيير معلومات في الكمبيوتر لا يحق للمتجاوز الحصول عليها أو تغييرها. في يونيو 2021، أوضحت المحكمة العليا في قضية *فان بيورن* أن مجرد الوصول إلى المعلومات 'لأغراض غير صحيحة' لا ينتهك CFAA.", "good_faith_security_research_definition": "'أبحاث الأمن بحسن نية' تعني الوصول إلى جهاز كمبيوتر فقط لأغراض الاختبار بحسن نية، والتحقيق، و/أو تصحيح عيب أمني أو ضعف، حيث يتم هذا النشاط بطريقة مصممة لتجنب أي ضرر للأفراد أو الجمهور، وحيث يتم استخدام المعلومات المستخلصة من النشاط بشكل أساسي لتعزيز أمن أو سلامة الأجهزة والخدمات المماثلة ومستخدميها. من المرجح أن يشمل ذلك الأبحاث التي تجرى بموجب برنامج مكافآت الأخطاء (bug bounty program) أو غيرها من أبحاث 'القبعة البيضاء' (white hat research) التي تهدف إلى تعزيز الأمن. نفس 'البحث' لأغراض أخرى (مثل الابتزاز باستخدام نقاط الضعف المكتشفة) لن يعتبر 'حسن نية' ويمكن أن يظل موضع اتهام بموجب CFAA."}, "pricing": {}, "features": ["حماية أبحاث الأمن بحسن نية: ينص التحديث لأول مرة على أن DOJ لن توجه اتهامات 'أبحاث الأمن بحسن نية' كانتهاك لقانون CFAA.", "تطبيق أهداف DOJ لإنفاذ CFAA: تهدف الوزارة إلى تعزيز الخصوصية والأمن السيبراني من خلال دعم الحق القانوني للأفراد وأصحاب الشبكات والمشغلين وغيرهم في ضمان سرية وسلامة وتوفر المعلومات المخزنة في أنظمة معلوماتهم.", "عدم توجيه اتهامات في حالات معينة: يحدد التحديث حالات لن توجه فيها DOJ اتهامات 'تجاوز الوصول المصرح به'، وتشمل:", "انتهاك قيد وصول وارد في شرط من شروط الخدمة.", "تزيين ملف تعريف مواعدة عبر الإنترنت بما يتعارض مع شروط الخدمة لموقع المواعدة.", "إنشاء حسابات وهمية على مواقع التوظيف أو الإسكان أو الإيجار.", "استخدام اسم مستعار على موقع تواصل اجتماعي يحظرها.", "استخدام جهاز كمبيوتر بطريقة تحظرها سياسة صاحب العمل، مثل التحقق من نتائج الألعاب الرياضية أو دفع الفواتير في العمل.", "إثبات النية: يجب على المدعي العام إثبات أن المتهم 'علميًا وصل إلى جهاز كمبيوتر أو منطقة في جهاز كمبيوتر لم يكن مسموحًا له بالوصول إليها بهدف الحصول على أو تغيير معلومات مخزنة هناك، وليس مجرد أن المتهم أساء لاحقًا استخدام المعلومات أو الخدمات التي كان مصرحًا له بالحصول عليها من الكمبيوتر في وقت حصوله عليها'."], "statistics": {}, "temporal_info": {"policy_update_date": "19 مايو 2022", "article_publication_date": "25 مايو 2022", "cfaa_enactment_year": "1986", "van_buren_decision_date": "يونيو 2021", "deputy_attorney_general_statement_date": "تاريخ الإعلان في OPA"}, "geographical_data": {"jurisdiction": "الولايات المتحدة الأمريكية"}, "references": [{"title": "Justice Department Revises Cyber Crime Charging Policy to Shield Good-Faith Security Research", "source": "Morrison Foerster Client Alert", "date": "25 May 2022"}, {"title": "JM 9-48.000 - Computer Fraud", "source": "justice.gov", "url": "https://www.justice.gov/jm/jm-9-48000-computer-fraud"}, {"title": "*Van Buren v. United States*", "citation": "141 S. Ct. 1648 (2021)"}, {"title": "18 U.S.C. § 1030(e)(6)", "citation": "18 U.S.C. § 1030(e)(6)"}, {"title": "Supreme Court Limits Computer Fraud and Abuse Act Scope in Van Buren", "source": "Morrison Foerster Client Alert", "url": "/resources/insights/210609-supreme-court-limits.html"}, {"title": "Department of Justice Announces New Policy for Charging Cases Under the Computer Fraud and Abuse Act", "source": "Department of Justice (DOJ)", "url": "https://www.justice.gov/opa/pr/department-justice-announces-new-policy-charging-cases-under-computer-fraud-and-abuse-act"}, {"title": "Binding Operational Directive 20-01", "source": "Cybersecurity and Infrastructure Security Agency (CISA)", "date": "2 سبتمبر 2020", "url": "https://www.cisa.gov/news-events/directives/binding-operational-directive-20-01"}]}