{"extracted_information": "أعلنت وزارة العدل الأمريكية عن سياسة جديدة بشأن توجيه الاتهامات بموجب قانون الاحتيال وإساءة استخدام الحاسوب (CFAA). تحدد هذه السياسة لأول مرة أن الأبحاث الأمنية بحسن نية لا ينبغي أن تُوجّه إليها تهم. الهدف من السياسة هو تعزيز الأمن السيبراني وتوفير الوضوح للباحثين الأمنيين الذين يكتشفون الثغرات لمصلحة عامة.", "specifications": {"good_faith_security_research_definition": "الوصول إلى جهاز كمبيوتر فقط لأغراض الاختبار بحسن نية، والتحقيق، و/أو تصحيح عيب أو ثغرة أمنية، حيث يتم تنفيذ هذا النشاط بطريقة مصممة لتجنب أي ضرر للأفراد أو الجمهور، وحيث تُستخدم المعلومات المستمدة من النشاط بشكل أساسي لتعزيز أمن أو سلامة فئة الأجهزة، الآلات، أو الخدمات عبر الإنترنت التي ينتمي إليها الكمبيوتر الذي تم الوصول إليه، أو أولئك الذين يستخدمون مثل هذه الأجهزة، الآلات، أو الخدمات عبر الإنترنت.", "cfaa_enforcement_goals": "تعزيز الخصوصية والأمن السيبراني من خلال دعم الحق القانوني للأفراد، مالكي الشبكات، المشغلين، والأشخاص الآخرين في ضمان سرية، سلامة، وتوفر المعلومات المخزنة في أنظمتهم المعلوماتية.", "prosecution_guidelines": {"not_to_be_charged": ["تجميل ملف تعريف المواعدة عبر الإنترنت بما يتعارض مع شروط الخدمة لموقع المواعدة.", "إنشاء حسابات وهمية على مواقع التوظيف، الإسكان، أو الإيجار.", "استخدام اسم مستعار على موقع تواصل اجتماعي يحظرها.", "التحقق من نتائج المباريات الرياضية في العمل.", "دفع الفواتير في العمل.", "انتهاك قيود الوصول الواردة في شروط الخدمة."], "to_be_charged": "حيث لا يكون المدعى عليه مخولاً بالوصول إلى جهاز كمبيوتر على الإطلاق، أو كان مخولاً بالوصول إلى جزء واحد من جهاز كمبيوتر (مثل حساب بريد إلكتروني واحد) وعلى الرغم من علمه بهذا التقييد، قام بالوصول إلى جزء من الكمبيوتر لم يمتد إليه وصوله المصرح به (مثل رسائل البريد الإلكتروني للمستخدمين الآخرين)."}, "bad_faith_security_research_example": "اكتشاف ثغرات في الأجهزة بغرض ابتزاز أصحابها، حتى لو ادعى أنه 'بحث'، لا يعتبر بحسن نية."}, "pricing": {}, "features": ["توجيه المدعين الفيدراليين بمتابعة السياسة الجديدة."], "statistics": {}, "temporal_info": {"effective_date": "تأخذ السياسة الجديدة مفعولها فوراً.", "replaces_previous_policy": "السياسة السابقة التي صدرت عام 2014.", "last_updated": "6 فبراير 2025"}, "geographical_data": {}, "references": ["مكتب الشؤون العامة، وزارة العدل الأمريكية", "النائب العام المساعد ليزا أ. موناكو", "قسم الجرائم الحاسوبية وحقوق الملكية الفكرية (CCIPS) التابع للقسم الجنائي"]}