{"extracted_information": "يتناول النص متطلبات قانون المرونة السيبرانية (CRA) للاتحاد الأوروبي فيما يتعلق بإدارة الثغرات الأمنية، وبرامج مكافآت الأخطاء، والالتزامات القانونية لمصنعي البرمجيات. يسلط الضوء على ضرورة قيام المصنعين بالإبلاغ الفوري عن الثغرات المستغلة، وإدارة الثغرات بشكل استباقي، وتوثيقها من خلال قوائم مكونات البرمجيات (SBOM)، وتبني سياسات الكشف المنسق عن الثغرات. كما يشجع القانون برامج مكافآت الأخطاء لحماية الباحثين الأمنيين وتحفيز الإبلاغ عن الثغرات. تتطلب هذه المتطلبات من المصنعين إنشاء برامج قوية لإدارة المخاطر وتلبية المعايير الأمنية للمنتجات المعروضة في سوق الاتحاد الأوروبي.", "specifications": {"reporting_timeline_exploited_vulnerabilities": {"initial_report": "خلال 24 ساعة إلى فريق الاستجابة للحوادث الأمنية الحاسوبية (CSIRT) للدولة العضو في الاتحاد الأوروبي", "detailed_notification": "خلال 72 ساعة", "detailed_description_and_mitigation_report": "خلال 14 يومًا من توفر التخفيف"}, "security_updates_availability": "10 سنوات كحد أدنى، أو طوال مدة دعم المنتج، أيهما أطول", "minimum_product_support_period": "5 سنوات", "applicability_timeline": {"enforceability_general": "ثلاث سنوات بعد السن", "vulnerability_and_cyber_incident_reporting": "21 شهرًا بعد السن"}}, "pricing": {}, "features": [{"name": "إدارة الثغرات الأمنية الوقائية", "description": "يجب على المصنعين التأكد من أن منتجاتهم الرقمية (PDEs) خالية من 'الثغرات المعروفة والقابلة للاستغلال' قبل طرحها في السوق. يجب معالجة الثغرات وإصلاحها 'دون تأخير' من خلال تحديثات أمنية، ويتم الكشف عنها علنًا بمجرد توفر التحديث. يجب أن تكون التحديثات الأمنية متاحة للمستخدمين لمدة 10 سنوات على الأقل أو لمدة دعم المنتج، أيهما أطول. يجب أن تتطابق فترة دعم المنتجات الرقمية مع وقت الاستخدام المتوقع، بحد أدنى خمس سنوات.", "requirements": ["معالجة وإصلاح الثغرات 'دون تأخير'", "الكشف العلني عن الثغرات بمجرد توفر التحديث", "تحديثات أمنية متاحة لمدة 10 سنوات كحد أدنى أو فترة دعم المنتج", "فترة دعم للمنتج لا تقل عن 5 سنوات"], "preparation_actions": ["تطبيق أنظمة قوية للكشف عن الثغرات وإدارة التصحيحات", "توثيق الثغرات بشكل منهجي واستخدامها في تقييمات المخاطر", "تخطيط دورات حياة المنتج لضمان الدعم الأمني المستمر"]}, {"name": "قائمة مكونات البرمجيات (SBOM) وتوثيق الثغرات", "description": "يتطلب القانون من المصنعين توثيق الثغرات الأمنية في منتجاتهم بمجرد علمهم بها، بما في ذلك تلك التي يكشف عنها أطراف ثالثة. يجب على المصنعين إنشاء SBOM يشمل على الأقل المكونات الأساسية للمنتج. يمكن لسلطات مراقبة السوق طلب الـ SBOM، ولكن المصنعين غير ملزمين بجعلها متاحة للجمهور.", "requirements": ["توثيق الثغرات الأمنية في المنتج", "إنشاء SBOM يغطي المكونات الأساسية على الأقل"], "preparation_actions": ["بدء عمليات إنتاج وصيانة الـ SBOM باستخدام الموارد والإرشادات المتاحة"]}, {"name": "الكشف المنسق عن الثغرات (CVD)", "description": "يجب على المصنعين وضع سياسة للكشف المنسق عن الثغرات تتضمن توفير قناة واضحة لأطراف ثالثة للإبلاغ عن الثغرات للمصنع، بالإضافة إلى اتخاذ تدابير لمشاركة معلومات الثغرات مع المنظمات الأخرى ذات الصلة. يجب توفير نقطة اتصال واحدة للمستخدمين للإبلاغ عن الثغرات الأمنية. عند معرفة المصنع بثغرة محتملة في مكون منتج (بما في ذلك مكونات الطرف الثالث والمفتوحة المصدر)، يجب عليه إبلاغ الكيان الذي يحتفظ بالمكون. يجب على المستوردين والموزعين أيضًا إبلاغ المصنعين بأي ثغرات يتم تحديدها في منتجاتهم.", "requirements": ["إنشاء سياسة للكشف المنسق عن الثغرات", "توفير قناة واضحة لأطراف ثالثة للإبلاغ عن الثغرات", "مشاركة معلومات الثغرات مع المنظمات ذات الصلة", "توفير نقطة اتصال واحدة للإبلاغ عن الثغرات", "إبلاغ الكيان الذي يحتفظ بمكونات المنتج عن الثغرات المكتشفة فيها"], "preparation_actions": ["إنشاء قنوات اتصال شفافة ومستجيبة للإبلاغ عن الثغرات بناءً على المعايير الدولية (مثل ISO/IEC 29147 و ISO/IEC 30111)", "تطوير برامج كشف منسقة بالتزامن مع عمليات إدارة الثغرات"]}, {"name": "حماية الباحثين الأمنيين وبرامج مكافآت الأخطاء", "description": "يدعم القانون بقوة قيمة البحث الأمني بحسن نية ويشجع الدول الأعضاء في الاتحاد الأوروبي على تقليل تعرض الباحثين الأمنيين للمسؤولية الجنائية والمدنية. يحث القانون الدول الأعضاء على تبني إرشادات لعدم ملاحقة الباحثين الأمنيين وإعفائهم من المسؤولية المدنية. على الرغم من أن القانون لا يفرض برامج مكافآت الأخطاء، إلا أنه يشجع المصنعين صراحة على النظر فيها، مؤكدًا على أن برامج الكشف المنسق يجب أن تحفز الإبلاغ عن الثغرات من خلال ضمان 'التقدير والتعويض' للباحثين.", "requirements": ["تشجيع الدول الأعضاء على حماية الباحثين الأمنيين من المسؤولية", "تشجيع المصنعين على النظر في برامج مكافآت الأخطاء"], "preparation_actions": ["ضمان أن تكون برامج مكافآت الأخطاء منظمة جيدًا وشفافة وتتوافق مع المعايير القانونية والأخلاقية"]}], "statistics": {}, "temporal_info": {"expected_law_passage": "الأسابيع القادمة", "general_enforcement_date": "ثلاث سنوات بعد السن", "vulnerability_reporting_enforcement_date": "21 شهرًا بعد السن"}, "geographical_data": {"applicability": "تنطبق على 'المنتجات ذات العناصر الرقمية' (PDEs) المتاحة تجاريًا في سوق الاتحاد الأوروبي، بغض النظر عن مكان تصنيعها (داخل أو خارج الاتحاد الأوروبي).", "reporting_destination": "فريق الاستجابة للحوادث الأمنية الحاسوبية (CSIRT) للدولة العضو في الاتحاد الأوروبي المعنية."}, "references": ["https://data.consilium.europa.eu/doc/document/ST-17000-2023-INIT/EN/pdf", "https://www.venable.com/insights/publications/2024/01/preparing-for-the-eu-cyber-resilience-act", "https://www.cybersecuritycoalition.org/", "https://hackingpolicycouncil.org/", "https://assets-global.website-files.com/62713397a014368302d4ddf5/648c6cc44c0f10df3fdf47a5_CRA%20Vulnerability%20Disclosure%20Obligations%20-%20HPC%20-%20April%204%202023.pdf", "https://www.cisa.gov/sbom", "https://www.justice.gov/opa/pr/department-justice-announces-new-policy-charging-cases-under-computer-fraud-and-abuse-act"]}