{"extracted_information": "الدراسة هي حالة عملية حول مدى التزام منصات مكافآت الأخطاء (Bug Bounty Platforms) باللائحة العامة لحماية البيانات (GDPR). تم إرسال طلبات GDPR موحدة إلى خمس منصات رائدة (HackerOne, Bugcrowd, Synack, Intigriti, Zerocopter) لتقييم كيفية معالجتها لطلبات الوصول إلى البيانات الشخصية وحمايتها. تهدف الدراسة إلى تحديد البيانات التي تخزنها هذه المنصات عن المتسللين وكيفية حماية هذه البيانات، مع التركيز على الامتثال للمواد 12 و15 من اللائحة العامة لحماية البيانات.", "specifications": {"منهجية_الدراسة": {"الهدف": "تحديد البيانات التي تخزنها منصات مكافآت الأخطاء وكيفية حمايتها، وامتثالها لطلبات اللائحة العامة لحماية البيانات (GDPR).", "المنصة_المشمولة": ["HackerOne", "Bugcrowd", "Bugcrowd", "Synack", "Intigriti", "Zerocopter"], "نوع_الطلب": "طلب GDPR موحد (الحق في الوصول إلى البيانات وتقييدها) مرسل إلى جميع المنصات.", "الأسئلة_الموجهة": ["هل أوفت المنصة بالموعد النهائي؟ (Art. 12 par. 3 GDPR)", "هل قامت المنصة بالتحقق من هويتي صراحةً لجميع عناوين البريد الإلكتروني المقدمة؟ (Art. 12 par. 6 GDPR)", "هل سلمت المنصة النتائج مجانًا؟ (Art. 12 par. 5 GDPR)", "هل قدمت المنصة نسخة كاملة من بياناتي؟ (Art. 15 par. 3 GDPR)", "هل البيانات المقدمة دقيقة؟ (Art. 5 par. 1 (d) GDPR)", "ما هي البيانات الشخصية المخزنة و/أو المعالجة عني؟ (Art. 15 par. 1 (b) GDPR)", "ما هو الغرض من معالجة هذه البيانات؟ (Art. 15 par. 1 (a) GDPR)", "من استلم أو سيستلم بياناتي الشخصية (بما في ذلك المستلمين في بلدان ثالثة ومنظمات دولية)؟ (Art. 15 par. 1 (c) GDPR)", "إذا لم يتم تزويد البيانات الشخصية بواسطتي مباشرة، فمن أين نشأت؟ (Art. 15 par. 1 (g) GDPR)", "إذا تم نقل بياناتي الشخصية إلى بلد ثالث أو منظمة، ما هي الضمانات المقدمة بناءً على المادة 46 من اللائحة العامة لحماية البيانات؟ (Art. 15 par. 2 GDPR و Art. 46 GDPR)"], "الموعد_النهائي_للاستجابة": "شهر واحد، مع إمكانية التمديد."}, "تقييم_النتائج": {"نظام_التصنيف": {"أخضر": "كل شيء جيد، تم توفير كل شيء، تم تلبية التوقعات.", "برتقالي": "قابل للتحسين، على الأقل جزء واحد (واضح) من المعلومات مفقود، تم الإجابة عليه ضمنيًا فقط.", "أحمر": "متروك، مفقود كمية كبيرة من البيانات أو نقطة بيانات مهمة و/أو لم يتم تلبية التوقعات."}, "HackerOne": {"تاريخ_الإرسال": "01 أبريل 2020", "تاريخ_الاستلام": "30 أبريل 2020", "نمط_الاستجابة": "بريد إلكتروني مع مرفق JSON قابل للتحليل آليًا.", "تفاصيل_الأداء": [{"السؤال": "الوفاء بالموعد النهائي؟", "إجابة_رسمية": "نعم، بدون تمديد.", "ملاحظات": "–", "مؤشر": "أخضر"}, {"السؤال": "التحقق من الهوية؟", "إجابة_رسمية": "عبر البريد الإلكتروني.", "ملاحظات": "طلب إرسال رمز فريد من كل عنوان بريد إلكتروني مذكور.", "مؤشر": "أخضر"}, {"السؤال": "النتائج مجانًا؟", "إجابة_رسمية": "لم يتم فرض رسوم.", "ملاحظات": "–", "مؤشر": "أخضر"}, {"السؤال": "نسخة كاملة من البيانات؟", "إجابة_رسمية": "لا.", "ملاحظات": "لم يتم توفير نسخة من سجلات VPN/تفريغ الحزم، لكنها ليست ميزة عامة.", "مؤشر": "برتقالي"}, {"السؤال": "دقة البيانات؟", "إجابة_رسمية": "نعم.", "ملاحظات": "–", "مؤشر": "أخضر"}, {"السؤال": "البيانات الشخصية المخزنة؟", "إجابة_رسمية": "الاسم الأول والأخير، عنوان البريد الإلكتروني، عناوين IP، رقم الهاتف، الهويات الاجتماعية (Twitter, Facebook, LinkedIn)، العنوان، مقاس القميص، السيرة الذاتية، موقع الويب، معلومات الدفع، الوصول إلى VPN وسجل الحزم.", "ملاحظات": "قدمت قائمة واسعة من عناوين IP، لكنها لم توضح مدة الاحتفاظ أو بداية التسجيل. ذكرت تسجيل حزم VPN لبرامج معينة ولكن لا يمكن البحث عن البيانات الشخصية فيها حاليًا.", "مؤشر": "أخضر"}, {"السؤال": "الغرض من المعالجة؟", "إجابة_رسمية": "تشغيل الخدمات، الوفاء بالالتزامات التعاقدية، مراجعة وتطبيق الشروط، تحليل استخدام الخدمات لتحسين العروض، أغراض إدارية وتجارية، مطابقة الباحثين ببرامج العملاء.", "ملاحظات": "–", "مؤشر": "أخضر"}, {"السؤال": "المستلمون للبيانات؟", "إجابة_رسمية": "Zendesk, PayPal, Slack, Intercom, Coinbase, CurrencyCloud, Sterling.", "ملاحظات": "كانت قائمة 'TripActions' مفقودة، تم إضافتها لاحقًا نتيجة للدراسة.", "مؤشر": "برتقالي"}, {"السؤال": "مصدر البيانات؟", "إجابة_رسمية": "HackerOne لا تثري البيانات.", "ملاحظات": "–", "مؤشر": "أخضر"}, {"السؤال": "ضمانات نقل البيانات لبلد ثالث؟", "إجابة_رسمية": "لم يتم الرد عليها كجزء من الرد الرسمي. قدمت لاحقًا: 'يجب على البائعين الخضوع للعناية الواجبة حسب متطلبات اللائحة العامة لحماية البيانات، وحيثما ينطبق ذلك، توجد بنود نموذجية.'", "ملاحظات": "تم توفير المعلومة بعد الرد الرسمي.", "مؤشر": "برتقالي"}], "ملاحظات": "قدمت تقريرًا آليًا وسهل الاستخدام، وملف JSON كبير قابل للتحليل برمجياً، لكنه قد يكون صعبًا على غير المتخصصين."}, "Bugcrowd": {"تاريخ_الإرسال": "01 أبريل 2020", "تاريخ_الاستلام": "17 أبريل 2020", "نمط_الاستجابة": "بريد إلكتروني مع لقطة شاشة لجدول Excel.", "تفاصيل_الأداء": [{"السؤال": "الوفاء بالموعد النهائي؟", "إجابة_رسمية": "نعم، بدون تمديد.", "ملاحظات": "–", "مؤشر": "أخضر"}, {"السؤال": "التحقق من الهوية؟", "إجابة_رسمية": "لم يتم إجراء التحقق من الهوية.", "ملاحظات": "لم يتم التحقق من هويتي لأي من عناوين البريد الإلكتروني المقدمة.", "مؤشر": "أحمر"}, {"السؤال": "النتائج مجانًا؟", "إجابة_رسمية": "لم يتم فرض رسوم.", "ملاحظات": "–", "مؤشر": "أخضر"}, {"السؤال": "نسخة كاملة من البيانات؟", "إجابة_رسمية": "لا.", "ملاحظات": "قدمت لقطة شاشة لملف Excel فقط، مع بيانات غير مكتملة (مثل تاريخ الجلسات النشطة، رقم عضوية ISC2، تفاصيل التحقق من الهوية).", "مؤشر": "أحمر"}, {"السؤال": "دقة البيانات؟", "إجابة_رسمية": "لا.", "ملاحظات": "معلومات العنوان والبريد الإلكتروني والدفع قديمة جدًا، مما يشير إلى تخزين المزيد من البيانات التي لم يتم توفيرها.", "مؤشر": "أحمر"}, {"السؤال": "البيانات الشخصية المخزنة؟", "إجابة_رسمية": "الاسم الأول والأخير، العنوان، مقاس القميص، رمز البلد، ملف LinkedIn الشخصي، عنوان GooglePlus، عنوان بريد إلكتروني سابق، عنوان بريد PayPal الإلكتروني، موقع الويب، تسجيل الدخول الحالي لـ IP، معلومات البنك، ومعرف Payoneer.", "ملاحظات": "تم الإجابة عليها ضمنيًا من خلال لقطة الشاشة. كمية كبيرة من المعلومات مفقودة.", "مؤشر": "أحمر"}, {"السؤال": "الغرض من المعالجة؟", "إجابة_رسمية": "–", "ملاحظات": "لم يتم الإجابة على هذا السؤال.", "مؤشر": "أحمر"}, {"السؤال": "المستلمون للبيانات؟", "إجابة_رسمية": "–", "ملاحظات": "لم يتم الإجابة على هذا السؤال.", "مؤشر": "أحمر"}, {"السؤال": "مصدر البيانات؟", "إجابة_رسمية": "–", "ملاحظات": "لم يتم الإجابة على هذا السؤال.", "مؤشر": "أحمر"}, {"السؤال": "ضمانات نقل البيانات لبلد ثالث؟", "إجابة_رسمية": "–", "ملاحظات": "لم يتم الإجابة على هذا السؤال.", "مؤشر": "أحمر"}], "ملاحظات": "الرد كان مقتضبًا جدًا. أصرت Bugcrowd على أن ردها يتوافق مع GDPR على الرغم من نقص المعلومات، ورفضت تمديد الموعد النهائي. أنهت المناقشة ببيان أنها فعلت أكثر مما فعلته لأي طلب GDPR آخر في خضم الوباء."}, "Synack": {"تاريخ_الإرسال": "25 مارس 2020", "تاريخ_الاستلام": "03 يوليو 2020", "نمط_الاستجابة": "بريد إلكتروني مع مجموعة من ملفات PDF و DOCX و XLSX.", "تفاصيل_الأداء": [{"السؤال": "الوفاء بالموعد النهائي؟", "إجابة_رسمية": "نعم، مع تمديد شهرين.", "ملاحظات": "طلبت Synack التمديد صراحة.", "مؤشر": "أخضر"}, {"السؤال": "التحقق من الهوية؟", "إجابة_رسمية": "لا.", "ملاحظات": "لم يتم إجراء أي تحقق إضافي من الهوية بعد الطلب الأولي.", "مؤشر": "أحمر"}, {"السؤال": "النتائج مجانًا؟", "إجابة_رسمية": "لم يتم فرض رسوم.", "ملاحظات": "–", "مؤشر": "أخضر"}, {"السؤال": "نسخة كاملة من البيانات؟", "إجابة_رسمية": "على الأرجح لا.", "ملاحظات": "لم يتم توفير سجلات الاتصال أو تفريغ كامل للبيانات المتعلقة باستخدام VPN (LaunchPoint/LaunchPoint+) أو نظام TUPOC، والتي تعتبر نقاط بيانات مهمة.", "مؤشر": "أحمر"}, {"السؤال": "دقة البيانات؟", "إجابة_رسمية": "نعم.", "ملاحظات": "البيانات المقدمة كانت دقيقة.", "مؤشر": "أخضر"}, {"السؤال": "البيانات الشخصية المخزنة؟", "إجابة_رسمية": "معلومات الهوية (الاسم الكامل، الموقع، الجنسية، تاريخ الميلاد، العمر، الصورة، رقم الهوية، ملف LinkedIn، معرف Twitter، موقع الويب/المدونة، الشهادات، تفاصيل جواز السفر)، معلومات الضرائب، معلومات الحساب (اسم المستخدم، كلمة المرور، سجل الدخول، بيانات تقديم الثغرات)، تفاصيل الاتصال، معلومات مالية (تفاصيل الحساب البنكي، PayPal، سجل الدفع)، بيانات المشاركة في فريق Synack Red Team.", "ملاحظات": "مفقود معلومات مثل تاريخ آخر زيارة، النقرات على روابط التتبع في رسائل البريد الإلكتروني، نوع المتصفح، نظام التشغيل، الجنس. 'سجل المعلومات' و'البيانات المتعلقة بعملك' غامضة جدًا. لا يوجد ذكر لتفاصيل LaunchPoint أو TUPOC.", "مؤشر": "أحمر"}, {"السؤال": "الغرض من المعالجة؟", "إجابة_رسمية": "التوظيف (بما في ذلك التحقق من الخلفية)، الامتثال للالتزامات القانونية، إدارة المدفوعات والمكافآت والمصاريف، إدارة الباحثين، الحفاظ على التواصل، مراقبة الامتثال لسياسات Synack، الحفاظ على أمن شبكة Synack ومعلومات العملاء.", "ملاحظات": "نقطة إيجابية: تضمنت أوقات الاحتفاظ لكل نقطة بيانات.", "مؤشر": "أخضر"}, {"السؤال": "المستلمون للبيانات؟", "إجابة_رسمية": "مقدمو التخزين السحابي (Amazon Web Services و Google)، مقدمو التحقق من الهوية، معالجو الدفع (بما في ذلك PayPal)، مقدمو برامج خدمة العملاء، منصات الاتصالات، العملاء، شركات البحث عن الخلفية، شركات تتبع المتقدمين.", "ملاحظات": "سميت فئات الطرف الثالث فقط باستثناء AWS و Google، وهو أمر قانوني لكنه يفتقر للشفافية.", "مؤشر": "برتقالي"}, {"السؤال": "مصدر البيانات؟", "إجابة_رسمية": "Synack لا تثري البيانات.", "ملاحظات": "–", "مؤشر": "أخضر"}, {"السؤال": "ضمانات نقل البيانات لبلد ثالث؟", "إجابة_رسمية": "البيانات المخزنة من قبل مزودي الطرف الثالث يتم تخزينها في المنطقة الاقتصادية الأوروبية أو الولايات المتحدة.", "ملاحظات": "التخزين بحد ذاته ليس ضمانة كافية بموجب المادة 46 من اللائحة العامة لحماية البيانات.", "مؤشر": "أحمر"}], "ملاحظات": "عملية التواصل بطيئة. وثيقة مهمة تم توقيعها رقميًا ضمن الموعد النهائي، وتحسن بعض النقاط من أحمر إلى أخضر. لكن هناك تناقضات بين هذه الوثيقة ونسخة سياسة الخصوصية."}, "Intigriti": {"تاريخ_الإرسال": "07 أبريل 2020", "تاريخ_الاستلام": "04 مايو 2020", "نمط_الاستجابة": "بريد إلكتروني مع مرفقات PDF و JSON.", "تفاصيل_الأداء": [{"السؤال": "الوفاء بالموعد النهائي؟", "إجابة_رسمية": "نعم، بدون تمديد.", "ملاحظات": "–", "مؤشر": "أخضر"}, {"السؤال": "التحقق من الهوية؟", "إجابة_رسمية": "نعم.", "ملاحظات": "عبر البريد الإلكتروني، طلب إرسال رمز فريد من كل عنوان بريد إلكتروني مذكور.", "مؤشر": "أخضر"}, {"السؤال": "النتائج مجانًا؟", "إجابة_رسمية": "لم يتم فرض رسوم.", "ملاحظات": "–", "مؤشر": "أخضر"}, {"السؤال": "نسخة كاملة من البيانات؟", "إجابة_رسمية": "نعم.", "ملاحظات": "لم أتمكن من العثور على أي نقاط بيانات مفقودة.", "مؤشر": "أخضر"}, {"السؤال": "دقة البيانات؟", "إجابة_رسمية": "نعم.", "ملاحظات": "–", "مؤشر": "أخضر"}, {"السؤال": "البيانات الشخصية المخزنة؟", "إجابة_رسمية": "الاسم الأول والأخير، العنوان، رقم الهاتف، عنوان البريد الإلكتروني، عنوان موقع الويب، معرف Twitter، صفحة LinkedIn، مقاس القميص، بيانات جواز السفر، سجل محادثات البريد الإلكتروني، دعوات البرامج المقبولة، معلومات الدفع (البنكية و PayPal)، سجل الدفع، سجل عناوين IP لعمليات تسجيل الدخول الناجحة، سجل شروط وأحكام البرنامج المقبولة، البرامج المتابعة، تتبع السمعة، وقت عرض التقديم. فئات البيانات المعالجة: معلومات ملف تعريف المستخدم، سجل الهوية، تفضيلات شخصية، تفضيلات الاتصال، معلومات الدفع، معلومات الدفع، معلومات سمعة المنصة، معلومات طلب البرنامج، معلومات اعتماد البرنامج، معلومات دعوة البرنامج، معلومات سمعة البرنامج، معلومات قبول شروط البرنامج، معلومات التقديم، طلبات الدعم، طلبات تجارية، تفضيلات البرنامج، معلومات الاشتراك في قائمة البريد، معلومات تنزيل CVR، معلومات طلب العرض التوضيحي، معلومات الشهادة، معلومات طلب الاتصال.", "ملاحظات": "لم أتمكن من العثور على أي نقاط بيانات مفقودة. لا تعتبر حلول VPN القديمة نقطة بيانات مهمة.", "مؤشر": "أخضر"}, {"السؤال": "الغرض من المعالجة؟", "إجابة_رسمية": "عرض الملف الشخصي العام، إدارة علاقات العملاء، تحديد الهوية والترخيص، معالجة معاملات الدفع، مسك الدفاتر، فحص الهوية، إدارة التفضيلات، دعم الباحثين وإدارة المجتمع، إنشاء وإدارة التقديمات، فرز التقديمات، التعامل مع التقديمات من قبل الشركة، التعامل مع بيانات اعتماد البرنامج، دعوة البرنامج، التعامل مع طلب البرنامج، تقارير الحالة، إرسال رسائل بريد إلكتروني إشعارية تفاعلية، إرسال رسائل بريد إلكتروني إشعارية استباقية، تسجيل المنصة وتحليل الأداء.", "ملاحظات": "–", "مؤشر": "أخضر"}, {"السؤال": "المستلمون للبيانات؟", "إجابة_رسمية": "Intercom, Mailerlite, Google Cloud Services, Amazon Web Services, Atlas, Onfido, Several payment providers (TransferWise, PayPal, Pioneer), business accounting software (Yuki), Intigriti staff, Intigriti customers, encrypted backup storage (unnamed), Amazon SES.", "ملاحظات": "تناقض طفيف: ذكرت نقل البيانات لأطراف ثالثة (مثل Google و Amazon في بلدان ثالثة) ثم ذكرت 'نحن لا ننقل أي معلومات شخصية إلى بلد ثالث.' وضحت Intigriti أنها تستضيف البيانات فقط في منطقة أوروبا لـ AWS و Google.", "مؤشر": "برتقالي"}, {"السؤال": "مصدر البيانات؟", "إجابة_رسمية": "Intigriti لا تثري البيانات.", "ملاحظات": "–", "مؤشر": "أخضر"}, {"السؤال": "ضمانات نقل البيانات لبلد ثالث؟", "إجابة_رسمية": "–", "ملاحظات": "لم يتم توفيرها صراحة. في سياسة الخصوصية: 'سنضمن أن أي نقل للبيانات الشخصية إلى بلدان خارج المنطقة الاقتصادية الأوروبية سيتم وفقًا للضمانات المناسبة.' لكن 'الضمانات المناسبة' غير معرفة.", "مؤشر": "برتقالي"}], "ملاحظات": "قدمت Intigriti التقرير الأكثر تنظيمًا ووضوحًا، مما يسمح للقارئ غير التقني بالحصول على المعلومات بسهولة. بالإضافة إلى ذلك، تم توفير حزمة من ملفات JSON للتحليل البرمجي."}, "Zerocopter": {"تاريخ_الإرسال": "14 أبريل 2020", "تاريخ_الاستلام": "12 مايو 2020", "نمط_الاستجابة": "بريد إلكتروني مع ملف PDF.", "تفاصيل_الأداء": [{"السؤال": "الوفاء بالموعد النهائي؟", "إجابة_رسمية": "نعم، بدون تمديد.", "ملاحظات": "–", "مؤشر": "أخضر"}, {"السؤال": "التحقق من الهوية؟", "إجابة_رسمية": "نعم.", "ملاحظات": "تحققت Zerocopter من جميع عناوين البريد الإلكتروني بأسئلة شخصية وطلبت إرسال رسائل بريد إلكتروني برموز عشوائية.", "مؤشر": "أخضر"}, {"السؤال": "النتائج مجانًا؟", "إجابة_رسمية": "لم يتم فرض رسوم.", "ملاحظات": "–", "مؤشر": "أخضر"}, {"السؤال": "نسخة كاملة من البيانات؟", "إجابة_رسمية": "نعم.", "ملاحظات": "لم أتمكن من العثور على أي نقاط بيانات مفقودة.", "مؤشر": "أخضر"}, {"السؤال": "دقة البيانات؟", "إجابة_رسمية": "نعم.", "ملاحظات": "–", "مؤشر": "أخضر"}, {"السؤال": "البيانات الشخصية المخزنة؟", "إجابة_رسمية": "الاسم الأول والأخير، بلد الإقامة، السيرة الذاتية، عنوان البريد الإلكتروني، تفاصيل جواز السفر، عنوان الشركة، تفاصيل الدفع، محادثات البريد الإلكتروني، بيانات سجل VPN (يتم الاحتفاظ بها لمدة شهر واحد)، بيانات وصفية حول زيارات الموقع (مثل عناوين IP، نوع المتصفح، التاريخ والوقت)، معلومات شخصية كجزء من تقارير الأمان، الوقت المستغرق في الصفحات، معلومات الاتصال مع Zerocopter نفسها (مثل البريد الإلكتروني)، معلومات التسويق (عبر النشرات الإخبارية).", "ملاحظات": "لم أتمكن من العثور على أي نقاط بيانات مفقودة.", "مؤشر": "أخضر"}, {"السؤال": "الغرض من المعالجة؟", "إجابة_رسمية": "تحسين الموقع والتطبيق والخدمات، وتنفيذ الاتفاقية، وتوفير المعلومات.", "ملاحظات": "–", "مؤشر": "أخضر"}, {"السؤال": "المستلمون للبيانات؟", "إجابة_رسمية": "قد يتم نقل بعض البيانات خارج المنطقة الاقتصادية الأوروبية فقط بموافقة المستخدم، إلا إذا كان مطلوبًا لتنفيذ الاتفاقية أو لالتزام وكالات حكومية أو حدث تدريب أو إعادة تنظيم العمل.", "ملاحظات": "لم تسمي Zerocopter صراحة أيًا من الأطراف الثالثة هذه، باستثناء 'HubSpot'.", "مؤشر": "برتقالي"}, {"السؤال": "مصدر البيانات؟", "إجابة_رسمية": "Zerocopter لا تثري البيانات.", "ملاحظات": "–", "مؤشر": "أخضر"}, {"السؤال": "ضمانات نقل البيانات لبلد ثالث؟", "إجابة_رسمية": "–", "ملاحظات": "لم يتم توفيرها صراحة. في سياسة الخصوصية: 'هذه الأطراف الثالثة (المعالجون) تعالج بياناتك الشخصية حصريًا ضمن مهمتنا، ونبرم اتفاقيات معالجة مع هذه الأطراف الثالثة تتوافق مع متطلبات GDPR'.", "مؤشر": "برتقالي"}], "ملاحظات": "استشهدت Zerocopter بمعظم الأحيان بسياسة الخصوصية الخاصة بها، والتي قد تكون صعبة القراءة لغير المتخصصين."}}}, "features": ["الحق في الوصول إلى البيانات الشخصية (Art. 15 GDPR)", "الحق في تقييد البيانات الشخصية", "التحقق من الهوية (Art. 12 par. 6 GDPR)", "توفير البيانات مجانًا (Art. 12 par. 5 GDPR)", "الامتثال للمواعيد النهائية للاستجابة (Art. 12 par. 3 GDPR)", "تقديم نسخة كاملة ودقيقة من البيانات (Art. 15 par. 3 و Art. 5 par. 1 (d) GDPR)", "تحديد البيانات المخزنة والمعالجة (Art. 15 par. 1 (b) GDPR)", "تحديد الغرض من معالجة البيانات (Art. 15 par. 1 (a) GDPR)", "تحديد مستلمي البيانات (بما في ذلك في بلدان ثالثة) (Art. 15 par. 1 (c) GDPR)", "تحديد مصدر البيانات إذا لم يتم تزويدها من قبل صاحب البيانات (Art. 15 par. 1 (g) GDPR)", "توفير ضمانات لنقل البيانات إلى بلدان ثالثة (Art. 15 par. 2 GDPR و Art. 46 GDPR)"], "statistics": {"ملخص_الأداء_حسب_السؤال": {"هل أوفت المنصة بالموعد النهائي؟": {"HackerOne": "أخضر", "Bugcrowd": "أخضر", "Synack": "أخضر", "Intigriti": "أخضر", "Zerocopter": "أخضر"}, "هل قامت المنصة بالتحقق من هويتي لجميع عناوين البريد الإلكتروني؟": {"HackerOne": "أخضر", "Bugcrowd": "أحمر", "Synack": "أحمر", "Intigriti": "أخضر", "Zerocopter": "أخضر"}, "هل سلمت المنصة النتائج مجانًا؟": {"HackerOne": "أخضر", "Bugcrowd": "أخضر", "Synack": "أخضر", "Intigriti": "أخضر", "Zerocopter": "أخضر"}, "هل قدمت المنصة نسخة كاملة من بياناتي؟": {"HackerOne": "برتقالي", "Bugcrowd": "أحمر", "Synack": "أحمر", "Intigriti": "أخضر", "Zerocopter": "أخضر"}, "هل البيانات المقدمة دقيقة؟": {"HackerOne": "أخضر", "Bugcrowd": "أحمر", "Synack": "أخضر", "Intigriti": "أخضر", "Zerocopter": "أخضر"}, "البيانات الشخصية المخزنة؟": {"HackerOne": "أخضر", "Bugcrowd": "أحمر", "Synack": "أحمر", "Intigriti": "أخضر", "Zerocopter": "أخضر"}, "الغرض من المعالجة؟": {"HackerOne": "أخضر", "Bugcrowd": "أحمر", "Synack": "أخضر", "Intigriti": "أخضر", "Zerocopter": "أخضر"}, "المستلمون للبيانات؟": {"HackerOne": "برتقالي", "Bugcrowd": "أحمر", "Synack": "برتقالي", "Intigriti": "برتقالي", "Zerocopter": "برتقالي"}, "مصدر البيانات؟": {"HackerOne": "أخضر", "Bugcrowd": "أحمر", "Synack": "أخضر", "Intigriti": "أخضر", "Zerocopter": "أخضر"}, "ضمانات نقل البيانات لبلد ثالث؟": {"HackerOne": "برتقالي", "Bugcrowd": "أحمر", "Synack": "أحمر", "Intigriti": "برتقالي", "Zerocopter": "برتقالي"}}, "الاستنتاجات_الرئيسية": {"أداء_المنصات_الأوروبية": "المنصات الأوروبية (Intigriti و Zerocopter) قدمت أداءً أفضل أو كانت أكثر استعدادًا لطلبات GDPR مقارنةً بمنافسيها الأمريكيين.", "نقص_العمليات": "Bugcrowd و Synack تفتقران إلى العمليات المناسبة لمعالجة طلبات GDPR بشكل كافٍ، بما في ذلك التحقق السليم من الهوية.", "أداء_HackerOne": "على الرغم من كونها أمريكية، أظهرت HackerOne أداءً جيدًا مقارنةً بـ Bugcrowd و Synack، مما يشير إلى أن كون المنصة أمريكية ليس عذرًا لعدم الاستجابة الجيدة لـ GDPR.", "ضمانات_الشركاء": "لم تصف أي من المنصات الضمانات المطلوبة من شركائها لحماية البيانات الشخصية بشكل صريح وكافٍ. على الرغم من أن HackerOne قدمت هذه البيانات بعد الرد الرسمي، وIntigriti و Zerocopter لديهما بيانات غامضة في سياسات الخصوصية الخاصة بهما."}}, "temporal_info": {"تواريخ_طلبات_البيانات": {"Synack": "25 مارس 2020", "HackerOne": "01 أبريل 2020", "Bugcrowd": "01 أبريل 2020", "Intigriti": "07 أبريل 2020", "Zerocopter": "14 أبريل 2020"}, "تواريخ_استلام_الردود": {"Bugcrowd": "17 أبريل 2020", "HackerOne": "30 أبريل 2020", "Intigriti": "04 مايو 2020", "Zerocopter": "12 مايو 2020", "Synack": "03 يوليو 2020"}, "تحديثات_لاحقة": {"Synack_تحديث": "23 يوليو 2020", "HackerOne_تحديث_البيانات_المفقودة": "تم إضافة بيانات 'TripActions' لاحقًا بعد الدراسة."}}, "geographical_data": {"مقارنة_المنصات_حسب_المنشأ": "تظهر المنصات الأوروبية (Intigriti و Zerocopter) استعدادًا أفضل للتعامل مع طلبات GDPR مقارنةً بالمنصات الأمريكية (Bugcrowd, Synack, HackerOne).", "تخزين_البيانات_في_دول_ثالثة": "نقاش حول نقل البيانات إلى بلدان خارج المنطقة الاقتصادية الأوروبية، وتحديداً الولايات المتحدة، والحاجة إلى ضمانات بموجب المادة 46 من اللائحة العامة لحماية البيانات."}, "references": ["Art. 15 GDPR (الحق في الوصول)", "Art. 12 par. 3 GDPR (المهلة الزمنية للاستجابة)", "Art. 12 par. 6 GDPR (التحقق من الهوية)", "Art. 12 par. 5 GDPR (الرسوم)", "Art. 15 par. 3 GDPR (نسخة من البيانات)", "Art. 5 par. 1 (d) GDPR (دقة البيانات)", "Art. 15 par. 1 (b) GDPR (أنواع البيانات)", "Art. 15 par. 1 (a) GDPR (الغرض من المعالجة)", "Art. 15 par. 1 (c) GDPR (المستلمون)", "Art. 15 par. 1 (g) GDPR (مصدر البيانات)", "Art. 15 par. 2 GDPR (نقل البيانات لبلد ثالث)", "Art. 46 GDPR (الضمانات اللازمة للنقل خارج الاتحاد الأوروبي)"]}