{"extracted_information": "يحتوي المحتوى على معلومات مفصلة حول أحكام الملاذ الآمن القانونية، حدود الاختبار المصرح بها، والحماية القانونية ضمن برنامج مكافأة الأخطاء الخاص بـ GitHub. يوضح البرنامج التزامه بعدم متابعة الإجراءات القانونية ضد الباحثين عن الثغرات الأمنية الذين يلتزمون بسياسته بحسن نية، حتى في حالات الانتهاكات العرضية. يحدد المحتوى نطاق التصريح القانوني لأنشطة البحث الأمني بموجب قوانين مثل قانون الاحتيال وسوء استخدام الكمبيوتر (CFAA) وقانون الألفية الجديدة لحقوق طبع ونشر المواد الرقمية (DMCA). كما يتطرق إلى قيود حماية الطرف الثالث، وعمليات مشاركة المعلومات التعريفية وغير التعريفية مع الأطراف المتأثرة، وضرورة التزام الباحثين بالقوانين وعدم تجاوز حدود البرنامج.", "specifications": {}, "pricing": {}, "features": ["أحكام الملاذ الآمن القانونية:", "عدم ملاحقة GitHub للإجراءات المدنية أو الجنائية أو إرسال إشعارات لسلطات إنفاذ القانون لانتهاكات السياسة بحسن نية أو عن طريق الخطأ.", "اعتبار أنشطة البحث الأمني والكشف عن الثغرات المتوافقة مع السياسة 'سلوكًا مصرحًا به' بموجب قانون الاحتيال وسوء استخدام الكمبيوتر (CFAA)، وقانون الألفية الجديدة لحقوق طبع ونشر المواد الرقمية (DMCA)، وقوانين استخدام الكمبيوتر الأخرى (مثل Cal. Penal Code 502(c)).", "التنازل عن أي مطالبات محتملة بموجب قانون DMCA ضد الباحثين لتجاوز التدابير التكنولوجية المستخدمة لحماية التطبيقات ضمن نطاق البرنامج.", "منح إعفاء محدود من قيود معينة في سياسات موقع GitHub إذا كان البحث الأمني متوافقًا مع برنامج مكافأة الأخطاء.", "حدود الاختبار المصرح بها:", "يُتوقع من الباحثين الالتزام بجميع القوانين المعمول بها وعدم تعطيل أو اختراق أي بيانات تتجاوز ما يسمح به برنامج مكافأة الأخطاء.", "ضرورة التواصل المسبق مع GitHub قبل الانخراط في سلوك قد يكون غير متوافق أو غير معالج في هذه السياسة.", "لا يمكن لـ GitHub التصريح بالاختبار خارج النطاق باسم أطراف ثالثة، ويعتبر مثل هذا الاختبار خارج نطاق السياسة.", "يُنصح الباحثون بالاستفسار المسبق من GitHub في حال وجود شك حول أي إجراء قد يتجاوز حدود السياسة.", "الحماية القانونية (مشاركة المعلومات وقيود الأطراف الثالثة):", "مشاركة المعلومات:", "تحد GitHub من المعلومات التي يتم مشاركتها مع الأطراف الثالثة.", "يمكن مشاركة معلومات غير تعريفية من تقرير الباحث مع طرف ثالث متأثر بعد إخطار الباحث والحصول على التزام من الطرف الثالث بعدم اتخاذ إجراء قانوني ضد الباحث.", "لن تتم مشاركة المعلومات التعريفية (الاسم، البريد الإلكتروني، رقم الهاتف، إلخ) مع طرف ثالث إلا بإذن كتابي من الباحث.", "تُعتبر التقارير المقدمة سرية ووثائق ذات امتياز محتمل ومحمية من الكشف القسري في معظم الظروف، مع ملاحظة أن المحكمة قد تأمر بالكشف عنها.", "قيود حماية الطرف الثالث:", "لا يمكن لـ GitHub إلزام أي طرف ثالث، وبالتالي لا يمتد هذا الحماية إليهم.", "لا يمكن لـ GitHub التصريح ببحث أمني باسم كيانات أخرى، ولا يمكنهم الدفاع عن الباحث أو تعويضه أو حمايته من أي إجراء من طرف ثالث.", "إذا اتخذ طرف ثالث إجراء قانونيًا ضد الباحث (بسبب المشاركة المتوافقة مع السياسة)، ستتخذ GitHub خطوات لتوضيح أن تصرفات الباحث كانت متوافقة مع السياسة."], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": []}