{"extracted_information": "هذا الدليل لمساعدة الباحثين الأمنيين (الهاكرز) على النمو في مجال القرصنة والبدء في كسب المكافآت، ويوفر خارطة طريق تفصيلية للمبتدئين والراغبين في صقل مهاراتهم.", "specifications": {}, "pricing": {}, "features": [{"عنوان": "كيفية البدء (خطوات)", "التفاصيل": ["ابدأ بـ 'Newcomers Playlist' إذا كنت جديداً في القرصنة أو ترغب في مراجعة أساسيات قرصنة الويب.", "تعلم وإعداد Burp Suite من خلال 'Burp Suite playlist'.", "شاهد فيديوهات Hacker101 لاكتساب معرفة واسعة وفهم لمختلف مجالات القرصنة. (يمكنك مشاهدة الفيديوهات أولاً ثم التطبيق فوراً بالتوازي مع CTF، أو مشاهدة جميع الفيديوهات أولاً ثم التطبيق).", "ابدأ لعبة Hacker101 CTF (Capture the Flag) لممارسة القرصنة واكتشاف الثغرات في بيئة آمنة.", "احصل على 26 نقطة في CTF لتصبح مؤهلاً لتلقي دعوات لبرامج خاصة.", "انضم إلى مجموعة Hacker101 HackerOne Discord لطرح الأسئلة والتواصل والتعلم من المتسللين الآخرين.", "أكمل Hacker101 CTF بالكامل لضمان تعلم جميع المفاهيم، حتى لو تلقيت دعوة لبرنامج مكافآت ثغرات.", "ابحث عن برامج عامة في الدليل لتبدأ القرصنة عليها، مثل IBM وGM وDoD وVerizon Media.", "ابدأ القرصنة وطبق كل ما تعلمته من Hacker101.", "أرسل تقريرًا بمجرد العثور على ثغرة أمنية. تقاريرك الصالحة مهمة لبناء سمعتك وإشارتك وتأثيرك."]}, {"عنوان": "نصائح وإرشادات", "التفاصيل": ["لفهم ما يشكل تقريراً عالي الجودة، اطلع على دليل 'quality report' وراجع 'hacktivity' والتقارير السابقة.", "تذكر أن هناك اختلافات كبيرة بين القرصنة في CTF والقرصنة في برامج مكافآت الثغرات الحقيقية.", "استمر في الممارسة، حتى لو كان نطاق العمل في البرامج المباشرة أوسع ومن الصعب معرفة من أين تبدأ.", "بعد إرسال تقريرك الأول، امنح فريق الأمن أسبوعًا على الأقل قبل طلب التحديثات، واستمر في القرصنة والتحقق من برامج أخرى أثناء الانتظار."]}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": [{"النوع": "كتاب", "العنوان": "Web Hacking 101", "المؤلف": "Peter Yaworski"}, {"النوع": "كتاب", "العنوان": "The Web Application Hacker's Handbook", "المؤلف": "Dafydd Stuttard and Marcus Pinto"}, {"النوع": "كتاب", "العنوان": "The Hacker Playbook 2: Practical Guide To Penetration Testing", "المؤلف": "Peter Kim"}, {"النوع": "كتاب", "العنوان": "Hacking: The Art of Exploitation", "المؤلف": "Jon Erickson"}, {"النوع": "كتاب", "العنوان": "The Basics of Hacking and Penetration Testing", "المؤلف": "Patrick Engebretson"}, {"النوع": "كتاب", "العنوان": "RTFM: Red Team Field Manual", "المؤلف": "Ben Clark"}, {"النوع": "شخصية", "الاسم": "Frans Rosen", "الملاحظة": "يقدم رؤى حول كيفية كسب ثقة فرق الأمن واكتساب النفوذ كهاكر."}]}