{"extracted_information": "الشروط والأحكام، القواعد، المتطلبات، والالتزامات القانونية لأعضاء مجتمع HackerOne (الباحثين الأمنيين، المخترقين، المراجعين):\n\n**1. استخدام منصة HackerOne:**\n*   يُسمح بالاشتراك في البرامج وتقديم المساهمات بشرط الامتثال للشروط.\n\n**2. السلوك العام:**\n*   يجب على جميع المستخدمين التصرف بمهنية واحترام وأدب عند التفاعل مع HackerOne، العملاء، أو بعضهم البعض.\n*   يجب استخدام المنصة بشكل صحيح بهدف مساعدة الشركات في اكتشاف الأخطاء والثغرات.\n*   أي سلوك غير لائق قد يؤدي إلى إنهاء HackerOne استخدام العضو للمنصة.\n\n**3. القيود والمحظورات:**\n*   لا يجوز للعضو (أو السماح لأي طرف ثالث) عكس هندسة، فك تجميع، أو محاولة اكتشاف الشيفرة المصدرية أو البنية الأساسية للمنصة أو الخدمة (إلا إذا كانت القوانين المعمول بها تحظر هذا القيد).\n*   لا يجوز تعديل، ترجمة، أو إنشاء أعمال مشتقة من المنصة أو الخدمة.\n*   لا يجوز نسخ، تأجير، ترخيص، توزيع، رهن، التنازل عن، أو نقل الحقوق في المنصة أو الخدمة.\n*   لا يجوز استخدام الخدمة لصالح طرف ثالث.\n*   لا يجوز إزالة أو تغيير أي إشعارات أو علامات ملكية.\n*   لا يجوز استخدام الخدمة لبناء تطبيق أو منتج ينافس منتجات أو خدمات HackerOne.\n*   لا يجوز التدخل أو محاولة التدخل في عمل الخدمة أو أي أنشطة تُجرى عليها.\n*   لا يجوز تجاوز أي تدابير قد تستخدمها HackerOne لمنع أو تقييد الوصول إلى الخدمة.\n*   **استثناء:** القيود المتعلقة بعكس الهندسة، والتدخل، وتجاوز تدابير الوصول لا تنطبق على \"البحث الأمني بحسن نية\".\n\n**4. بيانات عضو المجتمع:**\n*   بتقديم أي مساهمة، يوافق العضو على سياسة البرنامج.\n*   يتعهد العضو بأن بياناته أو استخدامها من قبل HackerOne أو العميل لن ينتهك حقوق الملكية الفكرية، الخصوصية، أو أي قوانين سارية (بما في ذلك قوانين مراقبة الصادرات).\n\n**5. أهلية العضوية:**\n*   يجب أن يكون العضو مؤهلاً لاستخدام المنصة، وألا يكون استخدامه مخالفاً لقوانين ولوائح مراقبة الصادرات و/أو قوانين ولوائح العقوبات الاقتصادية المفروضة من قبل الولايات المتحدة، المملكة المتحدة، الاتحاد الأوروبي، أو أي ولاية قضائية ذات صلة.\n*   يحق لـ HackerOne إنهاء الوصول فوراً إذا اعتقدت أن العضو ينتهك هذه القوانين، وقد تُصادر المكافآت.\n\n**6. المكافآت والالتزامات الضريبية:**\n*   تُمنح المكافآت إذا استوفت المساهمات متطلبات العميل.\n*   تعالج HackerOne المدفوعات وتُرسلها للعضو عادةً في غضون 10 أيام عمل بعد استلامها من العميل.\n*   يُعين العضو HackerOne وكيلاً لقبول الدفع نيابة عنه.\n*   للحصول على مكافأة، يجب تقديم معلومات دقيقة وكاملة وحديثة (العنوان، الجنسية، الرقم الضريبي، وثيقة الهوية، صورة، وأي معلومات أخرى تطلبها HackerOne لأغراض قانونية أو ضريبية).\n*   إذا لم يتعاون العضو بتقديم المعلومات المطلوبة، فقد تُدفع المكافأة لجمعية خيرية من اختيار HackerOne.\n*   العضو مسؤول وحده عن دفع جميع الضرائب المتعلقة بالمكافآت.\n*   HackerOne ليست مسؤولة عن المكافآت غير المدفوعة الناتجة عن خرق العضو للشروط.\n\n**7. أطراف مستقلة:**\n*   العضو ليس موظفاً، مقاولاً، أو وكيلاً لـ HackerOne، بل طرف ثالث مستقل.\n*   العملاء أطراف ثالثة مستقلة، وأي وسيلة انتصاف قانونية ضد أفعالهم يجب أن تكون موجهة ضدهم وليس ضد HackerOne.\n*   HackerOne ليست طرفاً في العقود بين العميل والعضو.\n*   في حالة النزاع بين العضو والعميل، يتفق الطرفان على العمل بحسن نية مع فريق وساطة HackerOne لحل النزاع.\n\n**8. الملكية والتراخيص:**\n*   HackerOne لا تدعي ملكية بيانات العضو، لكنها تحتفظ بحقوق ملكية الخدمات ومحتوى المنصة.\n*   يمنح العضو HackerOne ترخيصاً أبدياً، غير قابل للإلغاء، غير حصري، قابل للتحويل، قابل للترخيص من الباطن، عالمي، خالٍ من الرسوم لاستخدام بيانات المساهمة لأغراض تقديم وتحسين الخدمات.\n*   يمنح العضو العميل ترخيصاً أبدياً، غير قابل للإلغاء، غير حصري، قابل للتحويل، قابل للترخيص من الباطن، عالمي، خالٍ من الرسوم لاستخدام مساهمة العضو.\n*   تمنح HackerOne العضو ترخيصاً قابلاً للإلغاء، غير حصري، غير قابل للتحويل، غير قابل للترخيص من الباطن، عالمي، خالٍ من الرسوم لاستخدام منصة HackerOne والوصول إلى محتواها.\n\n**9. السلطة:**\n*   إذا كان العضو يستخدم الخدمات نيابة عن شركة، يجب أن يمتلك السلطة لإلزامها بالشروط.\n*   المنصة والخدمات ليست مخصصة للأطفال دون 13 عاماً. إذا كان العضو قاصراً، يجب أن يُفصح عن ذلك كتابةً ويجب على والديه أو ولي أمره الموافقة على الشروط نيابة عنه.", "specifications": {}, "pricing": {}, "features": ["المشاركة في برامج اكتشاف الثغرات الأمنية.", "تقديم مساهمات حول الثغرات الأمنية للعملاء.", "الحصول على مكافآت مالية مقابل الثغرات المكتشفة.", "التفاعل مع العملاء عبر المنصة.", "استخدام بيئة أخلاقية مخصصة للباحثين الأمنيين."], "statistics": {}, "temporal_info": {"effective_date": "2025-03-27", "previous_terms_link": "https://www.hackerone.com/terms/community/2024"}, "geographical_data": {"eligibility_jurisdictions": ["الولايات المتحدة الأمريكية", "المملكة المتحدة", "الاتحاد الأوروبي", "أي ولاية قضائية ذات صلة بقوانين ولوائح مراقبة الصادرات والعقوبات الاقتصادية"]}, "references": ["https://www.hackerone.com/terms/general (الشروط والأحكام العامة)", "https://www.hackerone.com/policies/code-of-conduct (مدونة قواعد السلوك لأعضاء المجتمع)", "https://docs.hackerone.com/en/articles/8494525-gold-standard-safe-harbor-statement (البحث الأمني بحسن نية)", "https://www.hackerone.com/disclosure-guidelines (إرشادات الكشف عن الثغرات الأمنية)", "https://www.hackerone.com/privacy (سياسة الخصوصية)", "https://www.hackerone.com/terms/community/2024 (شروط أعضاء المجتمع السابقة)"]}