{"extracted_information": "المحتوى يقدم معلومات مفصلة حول أحكام الملاذ الآمن (Safe Harbor)، الحماية القانونية للباحثين الأمنيين، وتعريف أبحاث الأمن بحسن نية.", "specifications": {"safe_harbor_definition": "حكم يوفر الحماية من المسؤولية في حالات معينة عند استيفاء شروط معينة. في سياق أبحاث الأمن والإفصاح عن الثغرات، هو بيان من منظمة بأن المخترقين المشاركين في أبحاث الأمن بحسن نية والإفصاح الأخلاقي مصرح لهم بإجراء هذا النشاط ولن يخضعوا لإجراءات قانونية من تلك المنظمة.", "good_faith_security_research_definition": "وفقًا لـ HackerOne، هو الوصول إلى جهاز كمبيوتر فقط لأغراض الاختبار، التحقيق، و/أو تصحيح عيب أو ثغرة أمنية بحسن نية، حيث يتم تنفيذ هذا النشاط بطريقة مصممة لتجنب أي ضرر للأفراد أو الجمهور، وحيث يتم استخدام المعلومات المستمدة من النشاط بشكل أساسي لتعزيز أمن أو سلامة فئة الأجهزة أو الآلات أو الخدمات عبر الإنترنت التي ينتمي إليها الكمبيوتر الذي تم الوصول إليه، أو أولئك الذين يستخدمون هذه الأجهزة أو الآلات أو الخدمات عبر الإنترنت. يسمى المشاركون في أبحاث الأمن بحسن نية أحيانًا باحثين أمنيين 'bona fide' أو مخترقين 'أصحاب القبعات البيضاء' أو 'أخلاقيين'.", "what_is_not_good_faith_security_research": "البحث الأمني الذي لا يتم بحسن نية لا يشمله الملاذ الآمن. على سبيل المثال، البحث الذي يتم لغرض الابتزاز ليس بحسن نية. يجب على المخترقين السعي لتوضيح وضع السلوكيات التي قد تكون على الحد الفاصل أو غير متسقة مع أبحاث الأمن بحسن نية قبل الانخراط فيها.", "key_elements_of_leading_edge_safe_harbor_statement": ["يجب أن يُطبق الملاذ الآمن بشكل افتراضي على جميع أبحاث الأمن بحسن نية التي يتم الكشف عنها أخلاقياً للمنظمة.", "يجب أن يحمي الملاذ الآمن أبحاث الأمن بحسن نية بشكل لا لبس فيه، متى استوفيت الشروط، ولا ينبغي ربطه بقبول شروط معينة عند تقديم الثغرة.", "يجب ألا تُحدد المنظمة من جانب واحد ما إذا كان إجراء معين يتعارض مع أبحاث الأمن بحسن نية؛ ينبغي على المنظمات والمخترقين السعي للاتفاق المتبادل، أو الرجوع إلى أفضل الممارسات.", "لا يجوز إزالة الملاذ الآمن بأثر رجعي بمجرد تطبيقه على حالة معينة من أبحاث الأمن بحسن نية، ما لم يكن هناك دليل واضح على نشاط بسوء نية (حيث لم يكن الملاذ الآمن ليطبق أصلاً)."]}, "pricing": {}, "features": ["يوفر حماية للباحثين الأمنيين من الإجراءات القانونية أو العقوبات التنظيمية عند الكشف الأخلاقي عن الثغرات.", "يساعد في التمييز بين التحقق المستقل وانتهاكات البيانات بموجب بعض قوانين الخصوصية.", "يزيل حالة عدم اليقين القانوني الناتجة عن قوانين مكافحة القرصنة القديمة والواسعة النطاق.", "يعزز الثقة والالتزام الملزم للباحثين الأخلاقيين للمساهمة في أمن المنظمات.", "يقلل العبء على مجتمع المخترقين لتحليل السياسات المختلفة.", "يزيد الثقة عند الانخراط في القرصنة الأخلاقية والكشف عن الثغرات.", "يشير الالتزام بمعيار الملاذ الآمن إلى نهج تعاوني ومؤشر قوي لنضج الأمن السيبراني للمنظمة.", "يقلل الحواجز أمام دخول كل من المخترقين الأخلاقيين والمنظمات.", "يضمن الاتساق والوضوح في ممارسات الكشف عن الثغرات."], "statistics": {}, "temporal_info": {"good_faith_security_research_alignment_date": "25 أكتوبر 2022"}, "geographical_data": {}, "references": ["بيان الملاذ الآمن الذهبي لـ HackerOne (Gold Standard Safe Harbor statement)", "سياسة الكشف عن الثغرات لمركز الأمن السيبراني الوطني الهولندي (The Netherlands National Cyber Security Centre vulnerability disclosure policy)", "دليل وزارة العدل الأمريكية § 9-48.000(B)(3)(8) (مايو 2022) (U.S. Department of Justice Manual § 9-48.000(B)(3)(8))", "سياسة الكشف عن الثغرات لوزارة الدفاع البريطانية (UK Ministry of Defence vulnerability disclosure policy)", "توصيات وكالة الاتحاد الأوروبي للأمن السيبراني (ENISA) بشأن سياسات الكشف المنسق عن الثغرات في الاتحاد الأوروبي (أبريل 2022) (Coordinated Vulnerability Disclosure Policies in the EU)", "توصيات ورقة منظمة التعاون الاقتصادي والتنمية (OECD) تشجيع معالجة الثغرات: نظرة عامة لصانعي السياسات (فبراير 2021) (Encouraging Vulnerability Treatment: Overview for Policy Makers)", "إطار عمل برنامج الكشف عن الثغرات للأنظمة عبر الإنترنت لوزارة العدل الأمريكية (Framework for a Vulnerability Disclosure Program for Online Systems)", "نموذج سياسة الكشف عن الثغرات لوكالة الأمن السيبراني وأمن البنية التحتية (CISA) للوكالات الحكومية الأمريكية (Vulnerability Disclosure Policy Template)", "مشروع توحيد #legalbugbounty", "disclose.io"]}