{"extracted_information": "تحتوي صفحة الويب على مدونة سلوك HackerOne، والتي تحدد القواعد والمبادئ التوجيهية لسلوك الباحثين الأمنيين (أعضاء المجتمع) على المنصة، مع التركيز بشكل خاص على الملكية الفكرية (IP) وإجراءات الإنفاذ.", "specifications": {}, "pricing": {}, "features": [{"عنوان": "الملكية الفكرية (IP)", "الوصف": "يشمل حقوق الملكية القانونية التي تحمي الإبداعات الأصلية. في سياق HackerOne، يشمل ذلك البرمجيات والأدوات والوثائق وتقنيات الاستغلال وتقارير البحث والعلامات التجارية، سواء كانت تخص الباحث أو HackerOne أو العملاء.", "تفاصيل": {"أمثلة_على_IP_للباحثين": ["الكود المكتوب لـ PoC أو سكربت أتمتة.", "أداة تم تطويرها أو تخصيصها للمسح أو الاختبار.", "أوراق بحثية أو تقارير أو منشورات مدونة.", "الطرق الداخلية أو الأنظمة أو الشفرة المصدرية للعميل الذي يتم اختباره."], "الملكية": "أعضاء المجتمع يمتلكون الأدوات والسكربتات والأبحاث والمحتوى الأصلي الذي ينشئونه شخصيًا، ما لم ينص على خلاف ذلك في سياسة البرنامج أو شروط منفصلة. HackerOne و/أو العملاء يمتلكون جميع ملكيتهم الفكرية الخاصة بهم مثل الأنظمة الخاصة والشفرة المصدرية والمعلومات السرية و/أو البيانات غير العامة التي يتفاعلون معها أثناء المشاركة في برنامج.", "خرق_الملكية_الفكرية": {"الوصف": "استخدام الملكية الفكرية دون إذن أو ترخيص المالك.", "أمثلة": ["المطالبة بفضل اكتشاف ثغرة أمنية أو بحث لشخص آخر.", "نسخ ولصق كود PoC أو سكربتات أو محتوى تقرير من باحث آخر دون إذن أو إسناد.", "استخدام أدوات أو استغلالات شخص آخر في التقديمات دون إذن أو إقرار، خاصة في برامج المكافآت على الأخطاء الكبيرة (BBPs) أو المشاريع التعاونية.", "تفريخ أو تعديل مشروع مفتوح المصدر لشخص ما وإزالة الترخيص أو إسناد المؤلف في انتهاك للشروط.", "حتى لو شارك عضو المجتمع العمل علنًا، هذا لا يعني أنه مجاني للاستخدام أو إعادة العلامة التجارية. يجب دائمًا التحقق من التراخيص وتقديم الإسناد، وعند الشك - السؤال."]}, "أهمية_احترام_الملكية_الفكرية": ["قد يؤدي عدم استخدام الملكية الفكرية بشكل قانوني إلى نزاعات قانونية.", "يسبب ضررًا للمجتمع.", "يحمي مساهماتك وسمعتك وفرصك المستقبلية.", "يشجع التعاون الأخلاقي وتبادل المعرفة.", "يحافظ على العدالة في البرامج وتوزيع المكافآت."]}}, {"عنوان": "إجراءات الإنفاذ", "الوصف": "يتم إبلاغ إنفاذ مدونة سلوك أعضاء مجتمع HackerOne بواسطة الإرشادات أدناه. يمثل الجدول الموضح أدناه حدًا أدنى - وليس سقفًا - للإجراءات المحتملة للإنفاذ التي سيتم اتخاذها في حالة انتهاك مدونة السلوك. تحتفظ HackerOne بالحق في تصعيد أو تخفيف شدة الإنفاذ والعقوبات وفقًا لطبيعة الجريمة وبغض النظر عن الانتهاكات السابقة. بناءً على شدة وطبيعة و/أو تكرار الجريمة (الجرائم)، قد تشمل العقوبات، على سبيل المثال لا الحصر، حظرًا مؤقتًا أطول، أو الإزالة الفورية من برامج HackerOne Clear، أو الاستبعاد من الأحداث الشخصية، و/أو حظرًا دائمًا من منصة HackerOne.", "تفاصيل": {"الإبلاغ_عن_الانتهاكات": "إذا رأيت باحثًا ينتهك هذه القواعد، اطلب مساعدة الوساطة عبر بوابة دعم HackerOne. إذا كنت بحاجة إلى مساعدة بشأن تقرير خاص بك، يمكنك طلب الوساطة مباشرة من التقرير المعني.", "ملاحظة_حول_التحديثات": "قد تقوم HackerOne بتحديث مدونة السلوك هذه من وقت لآخر، بناءً على معايير الصناعة وأفضل الممارسات. ستسعى جاهدة لتقديم إشعار بأي تحديث من هذا القبيل. يتم اتخاذ إجراءات الإنفاذ وفقًا لتقدير HackerOne وحدها. من خلال المشاركة في منصة HackerOne، فإنك تقر وتوافق على مدونة السلوك هذه سارية المفعول من وقت لآخر."}}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": [], "tabular_data": {"إجراءات_الإنفاذ_لانتهاكات_السلوك": [{"الانتهاك": "سلوك غير احترافي", "المخالفة_الأولى": "تثقيفي", "المخالفة_الثانية": "تحذير أول", "المخالفة_الثالثة": "تحذير ثاني", "المخالفة_الرابعة": "تحذير نهائي", "المخالفة_الخامسة": "حظر مؤقت (12 شهرًا)", "المخالفة_السادسة": "حظر دائم من المنصة"}, {"الانتهاك": "لغة مسيئة / مضايقة", "المخالفة_الأولى": "تحذير نهائي", "المخالفة_الثانية": "حظر مؤقت (12 شهرًا)", "المخالفة_الثالثة": "حظر دائم من المنصة"}, {"الانتهاك": "تدهور الخدمة / اختبار غير آمن", "المخالفة_الأولى": "تثقيفي", "المخالفة_الثانية": "تحذير أول", "المخالفة_الثالثة": "تحذير ثاني", "المخالفة_الرابعة": "تحذير نهائي", "المخالفة_الخامسة": "حظر مؤقت (12 شهرًا)", "المخالفة_السادسة": "حظر دائم من المنصة"}, {"الانتهاك": "الكشف غير المصرح به: برامج خاصة", "المخالفة_الأولى": "تحذير نهائي", "المخالفة_الثانية": "حظر دائم من المنصة"}, {"الانتهاك": "الكشف غير المنسق عن الثغرات الأمنية", "المخالفة_الأولى": "تحذير نهائي", "المخالفة_الثانية": "حظر دائم من المنصة"}, {"الانتهاك": "الاتصال بفرق البرنامج خارج النطاق", "المخالفة_الأولى": "تحذير أول", "المخالفة_الثانية": "تحذير ثاني", "المخالفة_الثالثة": "تحذير نهائي", "المخالفة_الرابعة": "حظر مؤقت (12 شهرًا)", "المخالفة_الخامسة": "حظر دائم من المنصة"}, {"الانتهاك": "تجميع السمعة / إساءة استخدام الحساب المزدوج", "المخالفة_الأولى": "تحذير أول", "المخالفة_الثانية": "تحذير ثاني", "المخالفة_الثالثة": "تحذير نهائي", "المخالفة_الرابعة": "حظر مؤقت (12 شهرًا)", "المخالفة_الخامسة": "حظر دائم من المنصة"}, {"الانتهاك": "الابتزاز / الابتزاز", "المخالفة_الأولى": "حظر دائم من المنصة"}, {"الانتهاك": "سوء استخدام الملكية الفكرية", "المخالفة_الأولى": "تحذير نهائي", "المخالفة_الثانية": "حظر دائم من المنصة"}, {"الانتهاك": "الهندسة الاجتماعية", "المخالفة_الأولى": "تحذير نهائي", "المخالفة_الثانية": "حظر دائم من المنصة"}, {"الانتهاك": "التحايل على الحظر", "المخالفة_الأولى": "حظر دائم من المنصة"}]}}