{"extracted_information": "توضح هذه المقالة الفروقات بين برامج الكشف عن الثغرات (VDP) وبرامج مكافآت الأخطاء (BBP). يهدف برنامج VDP إلى توفير إرشادات واضحة حول كيفية إبلاغ المؤسسة بالثغرات الأمنية المحتملة التي يكتشفها أطراف خارجية، وهو بمثابة ممارسة أفضل لتشجيع الإبلاغ عن المخاطر الأمنية. بينما يحفز برنامج BBP الأطراف الخارجية على إيجاد الثغرات الأمنية في برامج الشركة والإبلاغ عنها مباشرة، مقابل مكافآت مالية. تُعد برامج BBP أكثر تعقيدًا من برامج VDP نظرًا لوجود المزيد من المكونات والإعدادات التي يجب تهيئتها، مثل هيكل المكافآت وأهداف الاستجابة.", "specifications": {"VDP_components": [{"component": "بيان الغرض/الوعد", "details": "البيان الافتتاحي لـ VDP يجب أن يتضمن الأسباب وراء وجود البرنامج ولماذا هو مهم، لإظهار التزام المؤسسة تجاه العملاء وأصحاب المصلحة المتأثرين بالثغرات الأمنية."}, {"component": "النطاق", "details": "يشير إلى الممتلكات والمنتجات وأنواع الثغرات المتاحة للبحث عنها، مما يساعد مكتشفي الثغرات على تركيز انتباههم."}, {"component": "الملاذ الآمن (Safe Harbor)", "details": "بيان يؤكد للمكتشفين أنهم لن يتعرضوا للعقاب أو الإجراءات القانونية بسبب الثغرات التي يجدونها."}, {"component": "وصف العملية", "details": "وصف لكيفية قيام مكتشفي الثغرات بتقديم التقارير والمعلومات المطلوبة في التقديم."}, {"component": "كيفية تقييم التقارير", "details": "وصف توضيحي يحدد التوقعات حول كيفية تقييم التقارير. يمكن أن يشمل: الوقت المتوقع بين التقديم والاستجابة الأولى، وكيف ستتغير أوقات الاستجابة بناءً على شدة الثغرة والأصل المتأثر، ومتى يمكن للمكتشفين الكشف علنًا عن الثغرات المكتشفة، وما إذا كان يمكن للمكتشفين توقع رسالة تأكيد بالبريد الإلكتروني."}]}, "pricing": {}, "features": [{"program_type": "VDP (برنامج الكشف عن الثغرات)", "description": "يوفر إرشادات واضحة حول كيفية إبلاغ المؤسسة بالثغرات الأمنية المحتملة التي يكتشفها أطراف خارجية. يهدف إلى توجيه المكتشفين حول كيفية ومكان الإبلاغ عن الثغرة ليتعامل معها الفريق المختص. يُعتبر ممارسة أفضل و'شاهد شيئًا، قل شيئًا' للإنترنت.", "key_aspects": ["لا يتضمن مكافآت مالية مباشرة", "يركز على توفير قناة آمنة وواضحة للإبلاغ", "أقل تعقيدًا في الإعداد مقارنة بـ BBP"]}, {"program_type": "BBP (برنامج مكافآت الأخطاء)", "description": "يحفز الأطراف الخارجية على إيجاد الثغرات الأمنية في برامج الشركة والإبلاغ عنها مباشرة للشركة لحلها بأمان. في المقابل، يتم مكافأة مكتشفي الثغرات بجوائز مالية.", "key_aspects": ["يقدم حوافز مالية (مكافآت)", "يمكن أن يكون خاصًا (private) أو عامًا (public)", "أكثر تعقيدًا من VDPs", "يتطلب تكوينات إضافية مثل هيكل المكافآت وأهداف الاستجابة"]}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": []}