{"extracted_information": "تُقدم Intigriti قائمة ببرامج مكافآت الأخطاء (Bug Bounty) العامة وبرامج الكشف عن الثغرات (Vulnerability Disclosure Programs - VDPs)، مع تفاصيل عن الشركات، وصف البرامج، وهياكل المكافآت حيثما تنطبق. يبرز المحتوى العديد من البرامج التي تتخذ من أوروبا مقرًا لها أو تركز على المنطقة الأوروبية.", "specifications": {"programs": [{"name": "TrueLayer", "type": "Bug Bounty Program", "description": "خدمات مالية وتأمين. تهدف TrueLayer إلى فتح آفاق التمويل وتغيير طريقة الدفع العالمية. تُمكن الشركات من تقديم تجارب مالية من الدرجة الأولى لعملائها، وتعتمد على معايير Open Banking و PSD2 لتقديم واجهات برمجة التطبيقات لخدمات البيانات المالية وبدء الدفع.", "geographical_focus": "أوروبي (يعتمد على معايير PSD2)"}, {"name": "Aikido Security: Zen by Aikido", "type": "Bug Bounty Program", "description": "محرك أمني مُدمج لحماية التطبيقات ذاتيًا من هجمات الويب الشائعة مثل حقن الأوامر وحقن SQL. يعمل عن طريق الارتباط بالنقاط الضعيفة والتحقق منها مع مدخلات المستخدم الواردة، ويمنع الطلبات الضارة. يشبه جدار الحماية (WAF) التقليدي ولكن مع سياق كامل للكود المُستدعى ومدخلات المستخدم.", "geographical_focus": null}, {"name": "Aikido Security: Bug Bounty Program", "type": "Bug Bounty Program", "description": "منصة أمان تطبيقات آلية مُصممة خصيصًا لفرق هندسة البرمجيات. تؤمن المكدس بأكمله - الكود، التبعيات مفتوحة المصدر، البنية التحتية، والمزيد - وتتكامل مع سير العمل الحالي لتوفير رؤية وتحكم عبر البنية التحتية للتطبيق بأكملها.", "geographical_focus": null}, {"name": "Soundtrack Your Brand", "type": "Bug Bounty Program", "description": "تقدم خدمات بث الموسيقى للشركات، من العملاء الصغار مثل المقاهي إلى العلامات التجارية الكبيرة مثل ماكدونالدز. يوفر للعملاء تحكمًا كاملاً في الموسيقى وإدارة المواقع حول العالم، مع مجموعة واسعة من خيارات التشغيل وتطبيق ويب لإدارة الحسابات والموسيقى والمواقع.", "geographical_focus": null}, {"name": "DataCamp", "type": "Bug Bounty Program", "description": "مهمتها ديمقراطية مهارات البيانات للجميع. تستخدم الشركات والفرق DataCamp لسد فجوات مهارات البيانات واتخاذ قرارات أفضل تستند إلى البيانات. تعلم DataCamp أكثر من 1600 شركة و 7 ملايين فرد من أكثر من 180 دولة المهارات اللازمة للعمل بالبيانات في العالم الحقيقي.", "geographical_focus": "عالمي"}, {"name": "Torfs", "type": "Bug Bounty Program", "description": "بائع أحذية معروف في بلجيكا، ولا يزال شركة عائلية بنسبة 100%. لديها أكثر من 80 متجرًا في فلاندرز، ومتجران في الجزء الفرنسي من بلجيكا، ومتجر إلكتروني متنامي في بلجيكا وهولندا والعديد من الأسواق. تهدف إلى أن تكون سلسلة متاجر الأحذية الأكثر ودية للعملاء عبر القنوات المتعددة.", "geographical_focus": "أوروبي (بلجيكا، هولندا)"}, {"name": "Robinhood Bug Bounty Program", "type": "Bug Bounty Program", "description": "خدمات مالية وتأمين. تهدف إلى ديمقراطية النظام المالي الأمريكي. استثمر في الأسهم وصناديق الاستثمار المتداولة والخيارات والعملات المشفرة بدون عمولة.", "geographical_focus": "أمريكي"}, {"name": "Ninja Kiwi Games Bug Bounty program", "type": "Bug Bounty Program", "description": "مبتكرو سلاسل ألعاب الكمبيوتر الشهيرة Bloons و Bloons TD و SAS: Zombie Assault للهاتف المحمول والويب. لديها مكاتب في أوكلاند، نيوزيلندا ودندي، اسكتلندا. تسعى للتفاعل مع مجتمع الأمن للمساعدة في الحفاظ على أمان المستخدمين والخدمات.", "geographical_focus": "أوروبي (اسكتلندا)، أوقيانوسيا (نيوزيلندا)"}, {"name": "Delen Private Bank", "type": "Bug Bounty Program", "description": "خدمات مالية وتأمين. Delen Private Bank هو متخصص عائلي في إدارة الأصول، يركز على الحفاظ على الثروة وتنميتها والتخطيط الدقيق. قيّمها الأساسية هي ريادة الأعمال، الخدمة الشخصية، والرؤية طويلة الأجل.", "geographical_focus": "أوروبي (منطقة اليورو، بنك خاص بلجيكي)"}, {"name": "Monzo Public Bug Bounty Program", "type": "Bug Bounty Program", "description": "خدمات مالية وتأمين. تهدف Monzo إلى إنشاء خدمة مصرفية تجعل حياة عملائها المالية أفضل وأسهل. لديها العديد من التطبيقات لتوفير تجارب بديهية ومفيدة وممتعة عبر مجموعة منتجاتها. تُشجع الباحثين على الإبلاغ عن الثغرات الأمنية في تطبيقاتها أو خدماتها.", "geographical_focus": "أوروبي (المملكة المتحدة)"}, {"name": "Orbia Responsible Disclosure", "type": "Vulnerability Disclosure Program", "description": "خدمات الطاقة والمرافق والنفايات. Orbia هي مجموعة شركات تصنيع تقودها الأهداف، متحمسة للتحديات التي تحدد كيف سيعيش الناس ويزدهرون في المستقبل لتقديم حلول استراتيجية وتعاونية ومحورها الإنسان. جزء من التزامها بالأمن، تدعو الباحثين للمشاركة في برنامج الكشف.", "geographical_focus": null}, {"name": "UZ Leuven", "type": "Bug Bounty Program", "description": "مستشفى جامعي حيث يمكن للمرضى الاعتماد على رعاية متخصصة وعلاجات مبتكرة، بالإضافة إلى اهتمام إنساني واحترام لكل شخص. يوفر ما يقرب من 10,000 موظف رعاية مخصصة. يساهم المستشفى أيضًا في رعاية المرضى المستقبلية كرائد في البحث السريري.", "geographical_focus": "أوروبي (بلجيكا)"}, {"name": "PDQ bug bounty program", "type": "Bug Bounty Program", "description": "مهمتهم جعل إدارة الأجهزة بسيطة وآمنة وسريعة جدًا. يؤكدون على أهمية أمان منتجاتهم، وجميع قراراتهم تدور حول ضمان أن منتجاتهم آمنة للاستخدام في إدارة الأجهزة، وهذا هو سبب وجود برنامج مكافآت الأخطاء لديهم.", "geographical_focus": null}, {"name": "Visma", "type": "Bug Bounty Program", "description": "تقدم Visma برامج تبسط وتُرقمن العمليات التجارية الأساسية في القطاعين الخاص والعام. لديها حضور في جميع أنحاء منطقة الشمال جنبًا إلى جنب مع البنلوكس ووسط وشرق أوروبا، وهي واحدة من شركات البرمجيات الرائدة في أوروبا. تسعى للتفاعل مع باحثي الأمن المسؤولين حول العالم لزيادة تأمين خدماتها.", "geographical_focus": "أوروبي (شمال أوروبا، البنلوكس، وسط وشرق أوروبا)"}, {"name": "RGF BE - VDP", "type": "Vulnerability Disclosure Program", "description": "خدمات الأعمال والمهنية. RGF Staffing Belgium جزء من اللاعب العالمي RGF Staffing، وهو أحد أكبر مزودي خدمات الموارد البشرية في العالم، مع أنشطة في أستراليا وآسيا وأوروبا وأمريكا الشمالية. تركز على المنصات الرقمية وتوفر حلول الخدمة الذاتية. تدير الكثير من بيانات تحديد الهوية الشخصية (PII) داخليًا وتلتزم بمعايير أمان المعلومات والخصوصية العالية.", "geographical_focus": "أوروبي (بلجيكا)"}, {"name": "Intergamma", "type": "Bug Bounty Program", "description": "أكبر بائع تجزئة للمنتجات المنزلية في هولندا وبلجيكا بثلاث علامات تجارية: GAMMA Nederland، GAMMA België، و KARWEI. لديها ما يقرب من 400 متجر للمنتجات المنزلية وتدير ثلاثة مواقع للتجارة الإلكترونية. استراتيجيتها هي أن تكون أفضل بائع تجزئة متعدد القنوات في هولندا وبلجيكا، مما يجعل المنصة الآمنة أمرًا بالغ الأهمية.", "geographical_focus": "أوروبي (هولندا، بلجيكا)"}, {"name": "Dropbox Bug Bounty", "type": "Bug Bounty Program", "description": "يركز على أمان ملايين المستخدمين. يؤخذ الأمن على محمل الجد، وتُبنى أفضل الدفاعات بالاستعانة بمجتمع الأمن الأوسع. يطلب البرنامج من الباحثين الغوص في التطبيقات وواجهات برمجة التطبيقات والأنظمة الخلفية، ويُكافأ الإبداع والدقة والتقارير الواضحة.", "geographical_focus": null}, {"name": "Capital.com", "type": "Bug Bounty Program", "description": "خدمات مالية وتأمين. منصة تداول استثماري عالمية حائزة على جوائز متعددة، مرخصة ومنظمة من قبل هيئة السلوك المالي في المملكة المتحدة وهيئة الأوراق المالية والبورصات القبرصية. معروفة بجودتها في دعم العملاء على مدار الساعة طوال أيام الأسبوع، وتجربة التداول السلسة، والرسوم التنافسية. تُعتبر رائدة ناشئة بسرعة في صناعة التداول بالرافعة المالية الأوروبية.", "geographical_focus": "أوروبي (المملكة المتحدة، قبرص، صناعة أوروبية)"}, {"name": "Say Technologies Bug Bounty Program", "type": "Bug Bounty Program", "description": "تفتح قوة اتصالات المستثمرين من خلال العمل مع وسطاء-تجار لربط المساهمين بالشركات العامة التي يستثمرون فيها.", "geographical_focus": null}, {"name": "Bühler Group VDP", "type": "Vulnerability Disclosure Program", "description": "تتعامل مليارات الأشخاص يوميًا مع تقنيات Bühler لتلبية احتياجاتهم الأساسية من الغذاء والتنقل والمزيد. توجد تقنياتهم في الهواتف الذكية والألواح الشمسية والحفاضات وأحمر الشفاه والأوراق النقدية والأطعمة والمركبات. تسعى للابتكار من أجل عالم أفضل، مع التركيز بشكل خاص على الحلول الصحية والآمنة والمستدامة.", "geographical_focus": null}, {"name": "Suivo bug bounty", "type": "Bug Bounty Program", "description": "توفر منصة الويب Suivo الوصول إلى بيانات التتبع من المركبات المجهزة بأجهزة Suivo. تعتمد المنصة على 4 مكونات: بيانات التتبع في الوقت الفعلي، التحليلات القائمة على بيانات التتبع التاريخية، الاتصالات (المهام والرسائل)، وإدارة الأسطول (تخطيط الصيانة، إلخ).", "geographical_focus": null}, {"name": "CM.com", "type": "Bug Bounty Program", "description": "شركة مدرجة تقدم خدمات التجارة الحوارية من منصتها السحابية الهجينة مع برامج مطورة داخليًا. تتوزع قاعدة عملاء CM.com على 118 دولة، وتولد رسائل لأكثر من 220 وجهة. يشمل العملاء شركات من الدرجة الأولى، ووكالات حكومية، وشركات صغيرة ومتوسطة الحجم. تقدم واجهات برمجة التطبيقات لمعظم منتجاتها.", "geographical_focus": "عالمي"}, {"name": "Venly", "type": "Bug Bounty Program", "description": "شركة تكنولوجيا بلوكتشين توفر حلولًا سهلة الاستخدام للمطورين لمساعدة الشركات على دمج قدرات Web3 بسلاسة في تطبيقاتهم. مهمتها جعل البلوكتشين متاحًا للجميع من خلال تقديم أدوات آمنة وقابلة للتطوير وسهلة الاستخدام للمطورين والشركات والمستخدمين النهائيين. يركز هذا البرنامج بشكل أساسي على واجهة مستخدم محفظة Venly وواجهة برمجة تطبيقات المحفظة.", "geographical_focus": null}, {"name": "Cross Border Fines", "type": "Bug Bounty Program", "description": "خدمات مالية وتأمين. التطبيق الذي ينسق إرسال وثيقة مخالفات المرور للمواطنين وتسوية المدفوعات.", "geographical_focus": null}]}, "pricing": {"reward_structures_by_program": [{"program_name": "TrueLayer", "min_reward": 75, "max_reward": 6000, "currency": "EUR"}, {"program_name": "Aikido Security: Zen by Aikido", "min_reward": 100, "max_reward": 3500, "currency": "EUR"}, {"program_name": "Aikido Security: Bug Bounty Program", "min_reward": 50, "max_reward": 2500, "currency": "EUR"}, {"program_name": "Soundtrack Your Brand", "min_reward": 50, "max_reward": 3500, "currency": "EUR"}, {"program_name": "DataCamp", "min_reward": 25, "max_reward": 1500, "currency": "EUR"}, {"program_name": "Torfs", "min_reward": 25, "max_reward": 6500, "currency": "EUR"}, {"program_name": "Robinhood Bug Bounty Program", "min_reward": 100, "max_reward": 50000, "currency": "USD"}, {"program_name": "Ninja Kiwi Games Bug Bounty program", "min_reward": 75, "max_reward": 4125, "currency": "EUR"}, {"program_name": "Delen Private Bank", "min_reward": 100, "max_reward": 15000, "currency": "EUR"}, {"program_name": "Monzo Public Bug Bounty Program", "min_reward": 50, "max_reward": 12500, "currency": "GBP"}, {"program_name": "UZ Leuven", "min_reward": 50, "max_reward": 5000, "currency": "EUR"}, {"program_name": "PDQ bug bounty program", "min_reward": 50, "max_reward": 3500, "currency": "EUR"}, {"program_name": "Visma", "min_reward": 100, "max_reward": 7500, "currency": "EUR"}, {"program_name": "Intergamma", "min_reward": 50, "max_reward": 5500, "currency": "EUR"}, {"program_name": "Dropbox Bug Bounty", "min_reward": 100, "max_reward": 15000, "currency": "USD"}, {"program_name": "Capital.com", "min_reward": null, "max_reward": 15000, "currency": "EUR"}, {"program_name": "Say Technologies Bug Bounty Program", "min_reward": null, "max_reward": 10000, "currency": "USD"}, {"program_name": "Suivo bug bounty", "min_reward": null, "max_reward": 2000, "currency": "EUR"}, {"program_name": "CM.com", "min_reward": 25, "max_reward": 3500, "currency": "EUR"}, {"program_name": "Venly", "min_reward": 50, "max_reward": 5000, "currency": "EUR"}, {"program_name": "Cross Border Fines", "min_reward": 100, "max_reward": 3000, "currency": "EUR"}]}, "features": [], "statistics": {"total_programs_listed": 24, "bug_bounty_programs_with_rewards": 21, "vulnerability_disclosure_programs_no_rewards": 3, "explicitly_european_programs_count": 10}, "temporal_info": {}, "geographical_data": {"european_programs": ["TrueLayer", "Torfs", "Ninja Kiwi Games Bug Bounty program", "Delen Private Bank", "Monzo Public Bug Bounty Program", "UZ Leuven", "Visma", "RGF BE - VDP", "Intergamma", "Capital.com"], "other_programs": ["Aikido Security: Zen by Aikido", "Aikido Security: Bug Bounty Program", "Soundtrack Your Brand", "DataCamp", "Robinhood Bug Bounty Program", "Orbia Responsible Disclosure", "PDQ bug bounty program", "Dropbox Bug Bounty", "Say Technologies Bug Bounty Program", "Bühler Group VDP", "Suivo bug bounty", "CM.com", "Venly", "Cross Border Fines"]}, "references": []}