{"extracted_information": "تحتوي منصة Intigriti على عدة أنواع من البرامج التي تختلف في مستويات السرية وإمكانية الوصول ومتطلباتها. تشمل هذه البرامج: البرامج الخاصة (بدعوة فقط)، برامج التقديم، البرامج المسجلة، والبرامج العامة. يتم تحديد الوصول إلى هذه البرامج بناءً على عوامل مثل نشاط الباحث، جودة التقارير، السمعة، وفي بعض الحالات، الموقع الجغرافي أو التحقق من الهوية. تظهر مستويات المكافآت (bounty level) لبرامج التقديم.", "specifications": {"البرامج_الخاصة_دعوة_فقط": {"الرؤية": "غير مرئية لأي شخص على المنصة.", "معايير_الاستهداف_من_العميل": ["مدى نشاط الباحث بشكل عام.", "الحفاظ على درجة جودة عالية في التقارير.", "الحفاظ على سمعة جيدة في لوحة المتصدرين."], "عوامل_خارج_التحكم_الباحث": ["المناطق الجغرافية (قد تتطلب باحثين محليين أو مواطنين في بلد البرنامج)."], "شروط_الاهلية_الجغرافية": "يجب على الباحثين إدخال بلدهم في ملفهم الشخصي للمشاركة في البرامج المقيدة جغرافياً."}}, "pricing": {"هيكل_المكافآت": "تظهر مستويات المكافآت (bounty level) لبرامج التقديم (Application Programs) كجزء من المعلومات المحدودة المعروضة قبل القبول في البرنامج. لم يتم تحديد تفاصيل هيكل المكافآت الأخرى للبرامج الأخرى في هذا المحتوى."}, "features": [{"اسم_البرنامج": "البرامج الخاصة (دعوة فقط)", "الوصف": "برامج غير مرئية للعامة، تحدد الشركات الباحثين الذين ترغب في دعوتهم بناءً على معايير محددة.", "شروط_الوصول": "بالدعوة فقط من قبل الشركة، بناءً على نشاط الباحث وجودته وسمعته، وقد تشمل عوامل جغرافية."}, {"اسم_البرنامج": "برامج التقديم", "الوصف": "مرئية مثل البرامج العامة ولكن بمعلومات محدودة (وصف ومستوى مكافأة). يتطلب التقديم من الباحثين، وتُكشف التفاصيل المتبقية عند القبول.", "شروط_الوصول": "التقديم من قبل الباحث، والقبول من قبل العميل."}, {"اسم_البرنامج": "البرامج المسجلة", "الوصف": "لا يتم الإعلان عنها علناً على الموقع. تصبح متاحة بمجرد تسجيل الباحث لحساب.", "شروط_الوصول": "تسجيل حساب على المنصة. التحقق من الهوية يتيح الوصول إلى المزيد من هذه البرامج."}, {"اسم_البرنامج": "البرامج العامة", "الوصف": "يتم الإعلان عنها على الموقع مع توفر جميع التفاصيل. هي البرامج الأكثر سهولة في الوصول إليها.", "شروط_الوصول": "يتطلب من الباحثين تسجيل حساب على المنصة لتقديم التقارير."}], "statistics": {}, "temporal_info": {"تاريخ_التحديث": "أكثر من عام مضى"}, "geographical_data": {"القيود_الجغرافية": "بعض البرامج قد تتطلب أن يكون الباحث مواطناً في بلد البرنامج أو باحثاً محلياً. يتطلب ذلك من الباحثين إدخال بلدهم في ملفهم الشخصي."}, "references": [{"نوع": "التحقق من الهوية", "الرابط": "https://app.intercom.com/a/apps/fm3g6dzc/articles/articles/5195576/show"}, {"نوع": "أمثلة على البرامج العامة", "الرابط": "https://www.intigriti.com/programs"}]}