{"extracted_information": "Intigriti هي منصة عالمية لأمن المصادر المفتوحة والقرصنة الأخلاقية، موثوق بها من قبل كبرى المنظمات العالمية. توفر المنصة حلول مكافآت الأخطاء (Bug Bounty) واختبار الاختراق المرن (Agile Pentesting) للشركات والباحثين الأمنيين.", "specifications": {}, "pricing": {"details": "فعالة من حيث التكلفة وبسيطة، تضمن دفع المكافآت فقط مقابل الثغرات الأمنية الفريدة وغير المعروفة سابقًا."}, "features": [{"name": "برامج مكافآت الأخطاء للشركات", "description": "إطلاق برامج مكافآت الأخطاء بمساعدة مجتمع Intigriti من الباحثين ذوي الخبرة. تضمن المنصة أن يتم الدفع فقط مقابل الثغرات الأمنية الفريدة وغير المعروفة سابقًا. يتم التحقق من كل طلب وارد من قبل فريق فرز الخبراء قبل وصوله إلى الشركة."}, {"name": "منصة للباحثين الأمنيين", "description": "منصة مصممة خصيصًا لمتخصصي البحث عن الثغرات، تهدف إلى بناء مجتمع للباحثين الأمنيين."}, {"name": "مجتمع القراصنة الأخلاقيين", "description": "تربط الشركات مع مجتمع من أفضل باحثي الأمن السيبراني في العالم، الذين يفكرون كالمهاجمين ويكتشفون الثغرات التي قد لا تجدها الأدوات الآلية أو منهجيات اختبار الاختراق التقليدية."}, {"name": "اختبار أمان مستمر ورشيق", "description": "توفر حماية على مدار 24 ساعة طوال أيام الأسبوع للأصول الرقمية، بخلاف اختبارات الاختراق التقليدية المحددة زمنيًا."}, {"name": "سهولة وفعالية التكلفة", "description": "إطلاق البرنامج ببضع نقرات بمساعدة فريق نجاح العملاء. يتم التحقق من جميع الثغرات قبل تقديمها."}, {"name": "منصة SaaS متعددة الحلول", "description": "منصة SaaS ديناميكية يمكن دمجها في سير العمل الأمني والتطوير الحالي."}, {"name": "تجارب CTF الشهرية", "description": "تنظم تحديات Capture The Flag (CTF) شهرية قائمة على الويب لإشراك مجتمع أبحاث الأمن."}], "statistics": {"active_programs": "غير متوفر", "researchers": "غير متوفر", "bounties_paid": "غير متوفر"}, "temporal_info": {"ctf_challenge_august_2025": "تحدي CTF لشهر أغسطس: استغلال SSRF عبر NextJS Middleware، نُشر في 27 أغسطس 2025.", "bug_bounty_program_going_public_august_2025": "ما هو النمط المتوقع بعد الإطلاق العلني لبرنامج مكافآت الأخطاء؟ نُشر في 27 أغسطس 2025.", "scaling_bug_bounty_program_august_2025": "توسيع نطاق برنامج مكافآت الأخطاء: إرشادات استراتيجية لكبار مسؤولي أمن المعلومات وقادة الأمن السيبراني، نُشر في 18 أغسطس 2025."}, "geographical_data": {}, "references": [{"entity": "NVIDIA", "type": "عميل"}, {"entity": "Coca-Cola", "type": "عميل"}, {"entity": "Microsoft", "type": "عميل", "quote": "ننظر إلى مجتمع الباحثين كشركاء وليس كخصوم. نرى جميع فرص الشراكة مع الباحثين كفرصة لتأمين عملائنا.", "person": "مادلين إيكرت"}, {"entity": "Ubisoft", "type": "عميل"}, {"entity": "Nestle", "type": "عميل"}, {"entity": "Red Bull", "type": "عميل"}, {"entity": "Intel", "type": "عميل"}, {"entity": "Visma", "type": "عميل"}, {"entity": "Dropbox", "type": "عميل"}, {"entity": "Monzo", "type": "عميل"}, {"entity": "Altera", "type": "عميل"}, {"entity": "Grafana", "type": "عميل", "quote": "غالبًا ما يكون اختبار الاختراق واسع النطاق وعمقه قليل، بينما تكون مبادرة مكافأة الأخطاء عميقة النطاق وعرضها محدود - العمق على الاتساع في الكشف عن الثغرات التي يصعب العثور عليها.", "person": "ديفيد أندرسون"}, {"entity": "Yahoo", "type": "عميل"}, {"entity": "Robinhood", "type": "عميل"}, {"entity": "DPG Media", "type": "عميل", "quote": "يمكنني استخدام إبداع آلاف القراصنة الأخلاقيين من خلال Intigriti.", "person": "توماس كولين"}]}