{"extracted_information": "تحتوي هذه الصفحة على معلومات مفصلة حول الجوانب القانونية والأخلاقية لتأمين المعلومات، مع التركيز على القانون الفيدرالي الأمريكي رقم 18 من قانون الولايات المتحدة (USC) القسم 1030 وتأثيره على الأنشطة المتعلقة بأمن المعلومات والأبحاث الأمنية. كما تتطرق إلى أمثلة واقعية لقضايا ذات تداعيات قانونية وأخلاقية، مثل قضية ويكيليكس وقضايا المبلغين عن المخالفات، وتناقش أهمية تأمين المعلومات في العالم الحديث.", "specifications": {"federal_laws": {"Title 18 USC Section 1030": {"description": "يحدد هذا القسم من قانون الولايات المتحدة مجموعة متنوعة من أنشطة الاحتيال والأنشطة ذات الصلة التي تُعد غير قانونية بموجب القانون الفيدرالي، مما يقوض الحاجة الأساسية لضمان أمن المعلومات.", "prohibited_activities_examples": ["استخدام أي نظام كمبيوتر لارتكاب التجسس.", "الدخول غير المصرح به (الاختراق) للحصول على أنواع معينة من البيانات الحكومية، أو المعلومات الائتمانية، أو المالية، أو التجارية.", "محاولة الوصول إلى نظام معلومات فيدرالي دون إذن و/أو تفويض.", "الحصول بشكل غير قانوني على كلمات المرور أو أوراق الاعتماد الأخرى للوصول إلى نظام معلومات فيدرالي أو تهديده، بغض النظر عن النية الفعلية."], "real_life_cases": [{"case_name": "قضية ويكيليكس (جوليان أسانج وبرادلي مانينغ)", "details": "تتعلق بالانتهاك المزعوم لعدة أقسام فرعية من المادة 1030، حيث اتُهم أسانج بالتآمر لارتكاب اختراق كمبيوتر وجرائم إلكترونية متعددة أخرى. يطرح السؤال حول ما إذا كانت المعلومات المسربة قد أضرت بالفعل بالأمن القومي الأمريكي."}, {"case_name": "راسل دي تايس (محلل سابق في وكالة الأمن القومي)", "details": "ادعى أن وكالة الأمن القومي ووكالة استخبارات الدفاع كانتا تتنصتان على المواطنين الأمريكيين بشكل غير قانوني وغير دستوري. يعتبر مصدرًا للتقارير عن أنشطة التنصت التي غطتها صحيفة نيويورك تايمز عام 2005."}, {"case_name": "إريك سياراميلا (محلل سابق في وكالة المخابرات المركزية وموظف في مجلس الأمن القومي)", "details": "يُعتقد أنه المبلغ عن المخالفات في الأنشطة غير القانونية المزعومة التي حدثت في البيت الأبيض خلال مكالمة هاتفية بين الرئيس ومسؤول أوكراني. يطرح السؤال حول ما إذا كانت أفعالهم قانونية، أخلاقية، أم لا شيء من ذلك."}], "challenges_with_current_laws": "يعتقد بعض الخبراء القانونيين أن القوانين الفيدرالية الحالية التي تحدد ما يمكن وما لا يمكن فعله باستخدام نظام المعلومات كُتبت في زمن مختلف بنية مختلفة عما تُستخدم له اليوم. قد يكون من الضروري دمج التكنولوجيا والمصطلحات الحديثة لتوضيح أنواع البيانات المشمولة بالقانون ومراجعة كيفية تصنيف البيانات الرقمية وإلغاء تصنيفها للإفراج العام."}}, "information_assurance_necessity": "ضرورة مطلقة في عالم التكنولوجيا اليوم. تتضمن خدمات إدارة مخاطر المعلومات وتساهم في اتخاذ القرارات الفعالة، ووجود اتفاقيات مستوى خدمة (SLAs) وشروط تعاقدية محددة جيدًا، وتحديد المخاطر بشكل سليم لتطبيق تدابير تخفيف المخاطر."}, "pricing": {"free_offers": [{"service": "مسح تقييم الوضع (Posture Assessment Survey)", "details": "تقييم مستقل من الخبراء للحالة الحالية لبيئة أمن المعلومات مقابل المعايير العالمية وأفضل ممارسات الصناعة. يتضمن مسحًا مجانيًا لمدة 15 دقيقة، يليه خطة معالجة للثغرات المحددة وتطوير خريطة طريق للتحول."}, {"service": "محاكاة التصيد الاحتيالي (Phishing Simulation)", "details": "اشتراك مجاني في OhPhish لإجراء هجمات تصيد احتيالي محاكية والحصول على تقرير مفصل وقابل للتنفيذ. منصة متكاملة للتدريب على الوعي الأمني."}, {"service": "تقييم الثغرات واختبار الاختراق (VAPT)", "details": "VAPT مجاني لما يصل إلى 10 عناوين IP خارجية، بقيمة 5000 دولار أمريكي، والحصول على تقرير مخصص. لتقييم أمان البنية التحتية للشبكة وتطبيقات الويب وتطبيقات الهاتف المحمول."}]}, "features": [{"name": "التمييز بين الجوانب القانونية والأخلاقية", "description": "مناقشة التباين بين ما هو أخلاقي في رأي شخص وما هو مقبول قانونيًا حاليًا، مع أمثلة من قضايا واقعية."}, {"name": "خدمات إدارة مخاطر الموردين (Vendor Risk Management)", "description": "يساعد في التزام المنظمة بمتطلبات التدقيق والامتثال."}, {"name": "بناء بيئة معلومات مؤكدة", "description": "تمكين المنظمات من تحقيق بيئة معلومات آمنة من خلال الحلول والخدمات."}, {"name": "خدمات EGS الأمنية", "description": "تشمل مسح تقييم الوضع، ومحاكاة التصيد الاحتيالي، وتقييم الثغرات واختبار الاختراق (VAPT) لتعزيز الأمن السيبراني."}], "statistics": {}, "temporal_info": {"article_date": "17 مارس 2020", "assange_indictment": "مايو 2019", "tice_claims_reporting": "2005 (من خلال نيويورك تايمز)"}, "geographical_data": {"country": "الولايات المتحدة الأمريكية", "entities_mentioned": ["الولايات المتحدة (US)", "الحكومة الأمريكية (US government)", "وكالة الأمن القومي (NSA)", "وكالة استخبارات الدفاع (DIA)", "البيت الأبيض (White House)"]}, "references": ["Title 18 of the United States Code (USC) section 1030", "قضية WikiLeaks", "جوليان أسانج", "برادلي مانينغ (جندي استخبارات عسكرية سابق)", "راسل دي تايس (محلل استخبارات سابق لوكالة الأمن القومي)", "إريك سياراميلا (محلل سابق لوكالة المخابرات المركزية وموظف في مجلس الأمن القومي)", "صحيفة نيويورك تايمز 2005"]}