{"raw_content": "{\n  \"data\": {\n    \"extracted_information\": \"قائمة مفصلة بالتهديدات القانونية وغيرها من ردود الفعل السلبية التي واجهها باحثو الأمن، مصنفة حسب تاريخ الحادثة، الجهة المهددة، الباحث، الموضوع، والحالة أو النتيجة. يتضمن التقرير تهديدات قانونية مؤكدة، وحالات لم يتم تأكيد طبيعتها القانونية، وحالات اعتبرت أنشطة إجرامية وليست بحثاً أمنياً بحسن نية، بالإضافة إلى تفاصيل حول محادثات تم إلغاؤها.\",\n    \"features\": [\n      {\n        \"التاريخ\": \"2024-07-29\",\n        \"الجهة_المُهددة\": \"City of Columbus, Ohio\",\n        \"الباحث_الأمني\": \"Connor Goodwolf\",\n        \"الموضوع\": \"قرصنة بيانات المدينة ومقاضاة الباحث لاستكشاف بيانات الويب المظلم\",\n        \"الحالة_أو_النتيجة\": \"طُلبت تعويضات بقيمة 25 ألف دولار أمريكي وأمر تقييدي ضد الباحث، مع تحديد جلسة محاكمة في سبتمبر 2025.\",\n        \"التفاصيل\": \"بعد إبلاغ الباحث عن مدى الاختراق والبيانات المسروقة، رفعت المدينة دعوى قضائية ضده وطالبت بتعويضات وأمر تقييدي، متهمة إياه بأعمال إجرامية واعتداء على الخصوصية والإهمال والتحويل المدني. تم تحديد موعد المؤتمر التمهيدي في سبتمبر 2025. تُظهر الحالة رد فعل المدينة تجاه الإبلاغ عن اختراق بياناتها بدلًا من التصرف ضد المهاجمين الحقيقيين.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2024-01-18\",\n        \"الجهة_المُهددة\": \"Modern Solution GmbH & Co. KG\",\n        \"الباحث_الأمني\": \"باحث أمني مجهول\",\n        \"الموضوع\": \"الإبلاغ عن ثغرة أمنية في برنامج إدارة المخزون عبر الإنترنت\",\n        \"الحالة_أو_النتيجة\": \"حُكم على الباحث بغرامة 3000 يورو بتهمة الوصول غير المصرح به، ولكن القضية رُفضت لاحقًا. صودرت معدات الباحث خلال مداهمة للشرطة.\",\n        \"التفاصيل\": \"بعد إبلاغ الباحث عن ثغرة أمنية أدت إلى كشف بيانات العملاء، نفت الشركة وجود الثغرة. لاحقًا، داهمت الشرطة منزل الباحث وصادرت معداته. رُفضت القضية بعد أن ثبت أن الشركة فشلت في حماية كلمة المرور، مما استغرق أكثر من عام لاستعادة الباحث لمعداته.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2023-12-27\",\n        \"الجهة_المُهددة\": \"NEWAG\",\n        \"الباحث_الأمني\": \"Serwis Pojazdów Szynowych (SPS)، Dragon Sector CTF\",\n        \"الموضوع\": \"اكتشاف آليات حماية رقمية (DRM) تعيق إصلاح القطارات\",\n        \"الحالة_أو_النتيجة\": \"زعمت الشركة تهديد الباحثين، لكن لم يتم تأكيد رفع دعوى قضائية بسبب الأدلة التي جمعها الباحثون.\",\n        \"التفاصيل\": \"وجد الباحثون أنظمة DRM تعطل القطارات إذا حاول إصلاحها مركز غير مصرح به. NEWAG نفت هذه المزاعم واتهمت الباحثين بحملة علاقات عامة سلبية. هددت الشركة الباحثين لكن فريق Dragon Sector شكك في متابعة الدعوى القضائية نظراً لأدلتهم.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2023-07-23\",\n        \"الجهة_المُهددة\": \"Ford, Rapid7\",\n        \"الباحث_الأمني\": \"Ben Sadeghipour (nahamsec)\",\n        \"الموضوع\": \"طلب إزالة فيديو حول فورد\",\n        \"الحالة_أو_النتيجة\": \"تلقى الباحث بريدًا إلكترونيًا من Rapid7 يزعم فيه أنه 'يعمل بشكل غير قانوني' و'يساعد المجرمين'.\",\n        \"التفاصيل\": \"زعمت Rapid7 أنها تتصرف نيابة عن Ford وأن الباحث يساعد المجرمين، مطالبة بإزالة الفيديو. أكد الباحث أنه لم يفعل شيئًا خاطئًا وأنه سيرفع الفيديو متى شاء.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2023-07-16\",\n        \"الجهة_المُهددة\": \"Arm Ltd\",\n        \"التهديد_ضد\": \"Maria Markstedter \\\"Azeria\\\"\",\n        \"الموضوع\": \"بلاغ إساءة استخدام بخصوص الملكية الفكرية لأسماء النطاقات\",\n        \"الحالة_أو_النتيجة\": \"قدمت Arm بلاغ إساءة استخدام بخصوص الملكية الفكرية، مما أدى إلى إزالة نطاقات الباحثة وتغييرها.\",\n        \"التفاصيل\": \"طالبت Arm الباحثة بالتوقف عن استخدام نطاقات تحتوي على كلمة 'arm' بسبب انتهاك حقوق الملكية الفكرية، على الرغم من معرفة Arm بنطاقاتها لسنوات وعلاقة الباحثة السابقة بالشركة. تم إزالة النطاقات من قبل المسجل، مما دفع الباحثة لنقل النطاقات إلى Arm وتغيير نطاقاتها الخاصة.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2023-04-12\",\n        \"الجهة_المُهددة\": \"FreeHour\",\n        \"الباحث_الأمني\": \"Giorgio Grigolo, Michael Debono, Luke Bjorn Scerri and Luke Collins\",\n        \"الموضوع\": \"الإبلاغ عن ثغرات أمنية في تطبيق 'FreeHour' لجدولة أوقات الطلاب\",\n        \"الحالة_أو_النتيجة\": \"تم اعتقال الطلاب وتفتيشهم بشكل مهين ومداهمة منازلهم من قبل الشرطة.\",\n        \"التفاصيل\": \"بعد أن أبلغ الطلاب عن ثغرات أمنية في تطبيق FreeHour واستفسروا عن مكافأة محتملة، قامت الشركة بالإبلاغ عنهم للشرطة. نتيجة لذلك، تم اعتقال الطلاب وتفتيشهم وتفتيش منازلهم ومصادرة أجهزتهم، مما أثار جدلاً واسعاً.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2022-02-12\",\n        \"الجهة_المُهددة\": \"Cole County Prosecuting Attorney @ The State of Missouri\",\n        \"الباحث_الأمني\": \"Josh Renaud\",\n        \"الموضوع\": \"إسقاط الاتهامات بعد أربعة أشهر 'مضطربة'\",\n        \"الحالة_أو_النتيجة\": \"تم إسقاط التهم بعد أربعة أشهر من التحقيق، حيث اتُهم الباحث بكونه 'مخترقًا' وتعرض للاضطهاد السياسي.\",\n        \"التفاصيل\": \"تم اتهام رينو على شاشة التلفزيون بأنه 'مخترق خبيث' وتعرض للاضطهاد السياسي بسبب إبلاغه عن ثغرة أمنية. تم إسقاط التهم لاحقًا، لكن الحادثة أثرت بشكل كبير على حياته المهنية والشخصية، مما يؤكد أن القضية كانت مدفوعة بالمكاسب السياسية.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2021-10-21\",\n        \"الجهة_المُهددة\": \"Apple\",\n        \"الباحث_الأمني\": \"Denis Tokarev\",\n        \"الموضوع\": \"طلبات إزالة بموجب قانون الألفية للملكية الرقمية (DMCA) للمرآة\",\n        \"الحالة_أو_النتيجة\": \"قامت Apple بإزالة محتوى على GitHub وتويتر بموجب قانون DMCA، وقام الباحث بتعطيل حساب تويتر الخاص به مؤقتاً.\",\n        \"التفاصيل\": \"بعد نشر الباحث تفاصيل عن ثغرات iOS وPoCs بسبب عدم اعتراف Apple به أو دفع مكافأة له، قامت Apple بتقديم طلبات DMCA لإزالة المحتوى من GitHub وتويتر، حتى أنها أدت إلى تعطيل حساب الباحث على تويتر. وقد اعترفت Apple لاحقًا بالثغرة ولكنها لم تكرم الباحث في البداية.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2021-10-15\",\n        \"الجهة_المُهددة\": \"The State of Missouri\",\n        \"الباحث_الأمني\": \"St. Louis Post-Dispatch\",\n        \"الموضوع\": \"القانون الحكومي مقابل البحث بحسن نية، أو النشاط 'الهاكتيفي' المزعوم\",\n        \"الحالة_أو_النتيجة\": \"قُدمت اتهامات جنائية ضد الباحث الذي اكتشف ثغرة أمنية في بوابة حكومية.\",\n        \"التفاصيل\": \"بعد إبلاغ صحيفة سانت لويس بوست-ديسباتش عن ثغرة أمنية في بوابة حكومية تكشف معلومات شخصية، أشار حاكم ميسوري إلى أن هذا قد يكلف الولاية 50 مليون دولار وقد يؤدي إلى اتهامات جنائية، مما أثار جدلاً حول اعتبار البحث بحسن نية 'هاكتيفيسم' لتحقيق مكاسب سياسية.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2021-08-04\",\n        \"الجهة_المُهددة\": \"CDU (German political party)\",\n        \"الباحث_الأمني\": \"Lilith Wittmann\",\n        \"الموضوع\": \"مشاكل أمن البيانات في تطبيق الحملة الانتخابية للحزب\",\n        \"الحالة_أو_النتيجة\": \"رفعت CDU دعوى قضائية ضد الباحثة ثم سحبتها واعتذرت بعد رد فعل شعبي.\",\n        \"التفاصيل\": \"اكتشفت الباحثة ليليث ويتمان ونشرت مشاكل في أمن البيانات في تطبيق الحملة الانتخابية للحزب الديمقراطي المسيحي. رفع الحزب دعوى قضائية ضدها ولكنه سحبها واعتذر بعد احتجاج عام.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2021-07-13\",\n        \"الجهة_المُهددة\": \"Apple\",\n        \"الباحث_الأمني\": \"Corellium\",\n        \"الموضوع\": \"دعاوى قضائية مستمرة بخصوص انتهاك حقوق الطبع والنشر ضد منصة بحث بحسن نية\",\n        \"الحالة_أو_النتيجة\": \"رفعت Apple دعاوى قضائية متعددة بخصوص انتهاك حقوق الطبع والنشر ضد Corellium، لكنها خسرت جميع الدعاوى.\",\n        \"التفاصيل\": \"قامت Apple بمقاضاة Corellium مرارًا وتكرارًا بسبب منصتها التي تسمح بالبحث الأمني على أنظمة iOS، على الرغم من أن Apple نفسها شجعت على هذا البحث. خسرت Apple جميع الدعاوى القضائية، مما يبرز الانفصال بين الشركة ومجتمع البحث الأمني.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2021-04-29\",\n        \"الجهة_المُهددة\": \"what3words\",\n        \"الباحث_الأمني\": \"Aaron Toponce\",\n        \"الموضوع\": \"القوائم الكلمية 'الخاصة'\",\n        \"الحالة_أو_النتيجة\": \"تلقى الباحث رسالة قانونية تطلب منه التوقف عن استخدام برنامج مشتق مفتوح المصدر.\",\n        \"التفاصيل\": \"هددت شركة what3words الباحث توبونس لوكشفه عن طريقة توليد قوائم الكلمات وطلبت منه التوقف عن استخدام برنامج 'What Free Words' مفتوح المصدر الذي هو مشتق من نظامهم، على أساس أن مواردهم 'غير تافهة وخاصة'.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2021-03-25\",\n        \"الجهة_المُهددة\": \"Apperta Foundation Supported by NHS England, NHS Digital\",\n        \"الباحث_الأمني\": \"Rob Dyke\",\n        \"الموضوع\": \"الكشف عن معلومات عامة حساسة\",\n        \"الحالة_أو_النتيجة\": \"قامت Apperta بالإبلاغ عن الباحث إلى الشرطة بعد أن أبلغهم عن معلومات حساسة على مستودع GitHub الخاص بهم.\",\n        \"التفاصيل\": \"بعد اكتشاف الباحث روب دايك لمعلومات حساسة على مستودع GitHub التابع لـ Apperta وإبلاغهم بذلك، قامت المؤسسة بالإبلاغ عنه إلى الشرطة، على الرغم من أن الخطأ كان منهم.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2021-03-02\",\n        \"الجهة_المُهددة\": \"Xerox\",\n        \"الباحث_الأمني\": \"Raphaël Rigo / Airbus Security Lab\",\n        \"الموضوع\": \"مهاجمة طابعات زيروكس متعددة الوظائف\",\n        \"الحالة_أو_النتيجة\": \"تم إلغاء عرض تقديمي للباحث قبل ساعة من موعده بسبب 'إجراءات قانونية معلقة'.\",\n        \"التفاصيل\": \"كان من المقرر أن يقدم الباحث رافائيل ريغو عرضاً حول طابعات زيروكس، لكن العرض ألغي بسبب تهديدات قانونية من زيروكس. تمكن ريغو لاحقاً من تقديم العرض.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2020-09-10\",\n        \"الجهة_المُهددة\": \"Giggle\",\n        \"الباحث_الأمني\": \"Digital Interuption\",\n        \"الموضوع\": \"تطبيق Giggle\",\n        \"الحالة_أو_النتيجة\": \"هددت Giggle الباحثين بتهديد قانوني غير محدد بعد الكشف عن الثغرة.\",\n        \"التفاصيل\": \"بعد محاولات متكررة للباحثين للإبلاغ عن ثغرة أمنية في تطبيق Giggle، تم حظرهم وتهديدهم من قبل الشركة بعد أن أهانهم الرئيس التنفيذي علنًا. ثم هددت الشركة الباحثين بتهديد قانوني غير محدد.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2020-03-06\",\n        \"الجهة_المُهددة\": \"Talkspace\",\n        \"الباحث_الأمني\": \"John J Hacking\",\n        \"الموضوع\": \"Talkspace\",\n        \"الحالة_أو_النتيجة\": \"تلقى الباحث رسالة 'كف وامتناع' بعد كشفه عن ثغرة في استخدام رموز القسائم.\",\n        \"التفاصيل\": \"اكتشف الباحث جون جيه هاكينغ ثغرة تسمح باستخدام رموز قسائم الشركة للتسجيل مجانًا في Talkspace. بعد نشر القصة، أرسلت Talkspace رسالة 'كف وامتناع' إلى الباحث، على الرغم من توثيقه الواضح للثغرة.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2020-01-30\",\n        \"الجهة_المُهددة\": \"Iowa Supreme Court, Dallas County Sheriff Department\",\n        \"الباحث_الأمني\": \"Coalfire Red Teamers Arrested at work\",\n        \"الموضوع\": \"اعتقال فريق الاختراق الأخلاقي في العمل\",\n        \"الحالة_أو_النتيجة\": \"تم اعتقال اثنين من موظفي Coalfire بتهمة السرقة أثناء اختبار اختراق لم يتم إسقاط التهم إلا بعد أربعة أشهر.\",\n        \"التفاصيل\": \"أثناء قيامهم باختبار اختراق مادي لمباني ولاية أيوا، تم اعتقال اثنين من موظفي Coalfire بتهمة السرقة، على الرغم من وجود عقد رسمي. استغرق الأمر أربعة أشهر لإسقاط التهم.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2019-11-05\",\n        \"الجهة_المُهددة\": \"Boeing\",\n        \"الباحث_الأمني\": \"Chris Kubecka\",\n        \"الموضوع\": \"الشركات التي لا تمتلك سياسات إفصاح\",\n        \"الحالة_أو_النتيجة\": \"زعمت شركة بوينغ أنها هددت بإجراء قانوني لمنع الباحثة من التحدث علناً عن أبحاثها.\",\n        \"التفاصيل\": \"اكتشفت كريس كوبيكا عيوبًا أساسية في أمان شبكة بوينغ. يُزعم أن بوينغ هددتها بإجراء قانوني لمنعها من التحدث علنًا عن أبحاثها، وأنها فكرت في تشويه سمعة كريس علنًا.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2017-12-20\",\n        \"الجهة_المُهددة\": \"Keeper\",\n        \"الباحث_الأمني\": \"Dan Goodin\",\n        \"الموضوع\": \"Keeper تقاضي مراسلًا بسبب قصة ثغرة أمنية\",\n        \"الحالة_أو_النتيجة\": \"قاضت Keeper مراسلًا متهمة إياه 'ببيانات كاذبة' في مقال حول ثغرة أمنية.\",\n        \"التفاصيل\": \"بعد نشر دان غودن مقالًا عن ثغرة أمنية في مدير كلمات المرور Keeper، قامت الشركة بمقاضاته متهمة إياه 'ببيانات كاذبة' ومطالبة بمحاكمة أمام هيئة محلفين.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2017-08-03\",\n        \"الجهة_المُهددة\": \"MIT\",\n        \"الباحث_الأمني\": \"Bill Demirkapi\",\n        \"الموضوع\": \"أمن موقع الويب\",\n        \"الحالة_أو_النتيجة\": \"هدد فرد مجهول من MIT الباحث بالسجن لمدة 5 سنوات بسبب اكتشاف ثغرة أمنية.\",\n        \"التفاصيل\": \"هدد فرد مجهول من MIT الباحث بيل ديميركابي بالسجن لمدة 5 سنوات، زاعمًا أنه تسبب في 'اضطراب وإزعاج كبيرين' لموظفي ومستخدمي مكتبات MIT، بعد أن اكتشف الباحث سجلاً لتصحيح الأخطاء مكشوفًا عامًا على خدمة MIT.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2019-07-17\",\n        \"الجهة_المُهددة\": \"Budapesti Közlekedési Központ (BKK)\",\n        \"الباحث_الأمني\": \"شاب يبلغ من العمر 18 عامًا (مجهول)\",\n        \"الموضوع\": \"أمن نظام النقل\",\n        \"الحالة_أو_النتيجة\": \"تم اعتقال الشاب البالغ من العمر 18 عامًا في المجر بسبب الإبلاغ عن 'خطأ غبي بشكل مخز' في نظام التذاكر الإلكترونية.\",\n        \"التفاصيل\": \"تم اعتقال شاب يبلغ من العمر 18 عامًا في المجر بعد أن أبلغ عن ثغرات أمنية خطيرة في نظام التذاكر الإلكترونية الجديد في بودابست. أدى الاعتقال إلى غضب عام واحتجاجات واسعة النطاق.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2016-11-17\",\n        \"الجهة_المُهددة\": \"Chase Bank\",\n        \"الباحث_الأمني\": \"Chad Scira\",\n        \"الموضوع\": \"أمن موقع الويب\",\n        \"الحالة_أو_النتيجة\": \"قامت Chase بإلغاء بطاقة ائتمان الباحث بعد كشفه عن ثغرة سمحت بإنشاء نقاط مكافأة غير محدودة.\",\n        \"التفاصيل\": \"اكتشف الباحث ثغرة أمنية تسمح بإنشاء نقاط مكافأة غير محدودة في Chase. بعد الإبلاغ عنها، قامت Chase بإلغاء بطاقة ائتمانه وبطاقة أحد أفراد عائلته، مما أدى إلى كشفه عن الحادث.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2016-12-07\",\n        \"الجهة_المُهددة\": \"PwC\",\n        \"الباحث_الأمني\": \"ESNC GmbH\",\n        \"الموضوع\": \"برنامج PwC ACE\",\n        \"الحالة_أو_النتيجة\": \"أرسلت PwC رسالتي 'كف وامتناع' لمحاولة إسكات البحث.\",\n        \"التفاصيل\": \"حاولت ESNC تنسيق الكشف عن ثغرات في برنامج PwC، لكن PwC أرسلت رسالتي 'كف وامتناع' لمحاولة إسكات البحث. تجاهلت ESNC الرسائل وكشفت عن الثغرات.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2016-06-18\",\n        \"الجهة_المُهددة\": \"Nerium International\",\n        \"الباحث_الأمني\": \"Steven Jensen\",\n        \"الموضوع\": \"ثغرة أمنية في بوابة العملاء\",\n        \"الحالة_أو_النتيجة\": \"أرسلت Nerium رسالة 'كف وامتناع' بعد كشف الباحث عن ثغرة تعداد.\",\n        \"التفاصيل\": \"وجد الباحث ستيفن جنسن ثغرة تعداد بسيطة في بوابة عملاء Nerium. تجاهلت الشركة محاولاته للإبلاغ عنها، ولم تتصل به إلا بعد نشره تفاصيل كافية لإظهار أنها مشكلة حقيقية، وكان الاتصال في شكل رسالة 'كف وامتناع'.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2015-12-23\",\n        \"الجهة_المُهددة\": \"Infoba\",\n        \"الباحث_الأمني\": \"Henrik Høyer\",\n        \"الموضوع\": \"ثغرة أمنية في حلول Infoba\",\n        \"الحالة_أو_النتيجة\": \"اتهم بالوصول إلى معلومات حساسة، وأدين في المحكمة المحلية ثم بُرئ في الاستئناف.\",\n        \"التفاصيل\": \"وجد هوير ثغرات أمنية في أنظمة حضانة ابنه التي طورتها Infoba. اتهم بالوصول إلى معلومات حساسة لطلاب آخرين، وهو ما نفاه. وبدلاً من إصلاح الثغرات، رُفعت ضده تهم. أُدين في المحكمة المحلية ولكنه بُرئ في مارس 2017 عند الاستئناف إلى محكمة أعلى بسبب نقص الأدلة.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2015-10-06\",\n        \"الجهة_المُهددة\": \"جهة غير محددة\",\n        \"الباحث_الأمني\": \"Gianni Gnesa\",\n        \"الموضوع\": \"ثغرات كاميرات المراقبة\",\n        \"الحالة_أو_النتيجة\": \"سحب الباحث عرضه بسبب تهديدات قانونية من أحد البائعين.\",\n        \"التفاصيل\": \"كان من المقرر أن يتحدث الباحث جياني غنيسا عن ثغرات في كاميرات المراقبة، لكنه سحب عرضه بسبب تهديدات قانونية من أحد البائعين، على الرغم من إبلاغه بالثغرات سراً مقدماً.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2015-09-25\",\n        \"الجهة_المُهددة\": \"Good Technology\",\n        \"الباحث_الأمني\": \"Max Moser, Tobias Ospelt, David Gullasch (modzero)\",\n        \"الموضوع\": \"ثغرة XSS في واجهة إدارة 'Good for Enterprise'\",\n        \"الحالة_أو_النتيجة\": \"قدم البائع تهديدًا قانونيًا ضد نشر الاستشارة.\",\n        \"التفاصيل\": \"أصدر البائع تهديدًا قانونيًا لمنع نشر استشارة حول ثغرة XSS في واجهة إدارة Good for Enterprise. يوضح هذا أن الشركات كانت تزعم تاريخيًا أن اتفاقيات ترخيص المستخدم النهائي (EULA) هي القانون، وأن العثور على الأخطاء ونشرها غير قانوني.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2015-08-13\",\n        \"الجهة_المُهددة\": \"FireEye\",\n        \"الباحث_الأمني\": \"Felix Wilhelm, ERNW\",\n        \"الموضوع\": \"اكتشاف/الإبلاغ عن ثغرات أمنية في منتجات FireEye\",\n        \"الحالة_أو_النتيجة\": \"أرسلت FireEye رسالة 'كف وامتناع' وطلبت أمرًا قضائيًا لمنع الكشف عن التفاصيل.\",\n        \"التفاصيل\": \"بعد اكتشاف ثغرات أمنية في منتجات FireEye، أرسلت الشركة رسالة 'كف وامتناع' وسعت للحصول على أمر قضائي لمنع الباحثين من الكشف عن بعض تفاصيل أبحاثهم، مما أدى إلى عرض تقديمي وشرائح تحتوي على معلومات محذوفة.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2015-07-13\",\n        \"الجهة_المُهددة\": \"Impero Software\",\n        \"الباحث_الأمني\": \"slipstream\",\n        \"الموضوع\": \"الكشف عن ثغرات أمنية في منتجاتهم\",\n        \"الحالة_أو_النتيجة\": \"أرسلت الشركة رسالة قانونية تزعم انتهاك اتفاقية المستخدم وإلحاق الضرر بالسمعة.\",\n        \"التفاصيل\": \"بعد أن نشر الباحث معلومات واستغلالاً وظيفياً لثغرة أمنية في برنامج Impero Education Pro، أرسلت Impero رسالة عبر محاميها تزعم أن ذلك ينتهك اتفاقية المستخدم ويكشف معلومات سرية ويسبب أضرارًا لـ Impero ويضر بسمعتها.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ\": \"2015-07-07\",\n        \"الجهة_المُهددة\": \"Magic Software Argentina\",\n        \"الباحث_الأمني\": \"Joaquín Sorianello\",\n        \"الموضوع\": \"ثغرات أمنية في نظام التصويت الإلكتروني MSA Vot.ar\",\n        \"الحالة_أو_النتيجة\": \"داهمت الشرطة منزل المبرمج الذي أبلغ عن العيب، رغم أنه لم يكتشف أو ينشر الثغرة.\",\n        \"التفاصيل\": \"تلقى الباحث معلومات حول ثغرة في نظام التصويت الإلكتروني وأبلغ عنها. لاحقاً، داهمت الشرطة منزله بأمر من القاضي، على الرغم من أنه لم يكن له علاقة باكتشاف أو نشر الثغرة.\",\n        \"نوع_التهديد\": \"قانوني_مؤكد\"\n      },\n      {\n        \"التاريخ"}