{"extracted_information": "Nmap (\"Network Mapper\") هي أداة مجانية ومفتوحة المصدر لاكتشاف الشبكات وتدقيق الأمن. يجدها العديد من مديري الأنظمة والشبكات مفيدة لمهام مثل جرد الشبكة، وإدارة جداول ترقية الخدمة، ومراقبة وقت تشغيل المضيف أو الخدمة. تستخدم Nmap حزم IP الأولية بطرق مبتكرة لتحديد المضيفين المتاحين على الشبكة، والخدمات (اسم التطبيق وإصداره) التي يقدمونها، وأنظمة التشغيل (وإصدارات أنظمة التشغيل) التي تعمل عليها، وأنواع مرشحات الحزم/جدران الحماية المستخدمة، وعشرات الخصائص الأخرى. تم تصميمها لمسح الشبكات الكبيرة بسرعة، ولكنها تعمل بشكل جيد ضد المضيفات الفردية. تعمل Nmap على جميع أنظمة تشغيل الكمبيوتر الرئيسية، وتتوفر حزم ثنائية رسمية لنظام Linux وWindows وMac OS X.", "specifications": {"latest_version_mentioned": "Nmap 7.98", "os_support": ["Linux", "Microsoft Windows", "FreeBSD", "OpenBSD", "Solaris", "IRIX", "Mac OS X", "HP-UX", "NetBSD", "Sun OS", "Amiga"], "historical_script_counts": {"Nmap 5.50": "177 NSE scripts", "Nmap 6.25": "85 new NSE scripts", "Nmap 6.40": "14 new NSE scripts"}, "historical_fingerprint_counts": {"Nmap 5.50": {"os_fingerprints": "2,982", "version_detection_signatures": "7,319"}}}, "pricing": {"cost": "مجاني", "license": "مفتوح المصدر (يمكن تعديل وإعادة توزيع الكود المصدري الكامل)"}, "features": [{"name": "مرونة", "description": "يدعم العشرات من التقنيات المتقدمة لرسم خرائط الشبكات المليئة بمرشحات IP وجدران الحماية والموجهات والعوائق الأخرى، بما في ذلك العديد من آليات فحص المنافذ (TCP و UDP)، وكشف نظام التشغيل، وكشف الإصدار، ومسح Ping."}, {"name": "قوة", "description": "استخدمت Nmap لمسح شبكات ضخمة تضم مئات الآلاف من الأجهزة حرفياً."}, {"name": "قابلية النقل", "description": "مدعومة على معظم أنظمة التشغيل الرئيسية."}, {"name": "سهولة الاستخدام", "description": "توفر مجموعة غنية من الميزات المتقدمة للمستخدمين المتقدمين، ويمكن البدء ببساطة 'nmap -v -A *targethost*'. تتوفر كل من واجهة سطر الأوامر التقليدية والإصدارات الرسومية (GUI)."}, {"name": "مجانية", "description": "متاحة للتنزيل مجاناً، وتأتي مع الكود المصدري الكامل."}, {"name": "موثقة جيداً", "description": "جهود كبيرة في صفحات man الشاملة والمحدثة، والوثائق التقنية، والبرامج التعليمية، وكتاب كامل."}, {"name": "مدعومة", "description": "مدعومة من قبل مجتمع نابض بالحياة من المطورين والمستخدمين من خلال القوائم البريدية وفيسبوك وتويتر وقنوات IRC."}, {"name": "شهيرة", "description": "حائزة على العديد من الجوائز، وتنزيلات يومية بالآلاف، ومدمجة مع العديد من أنظمة التشغيل."}, {"name": "مجموعة أدوات Nmap", "description": "بالإضافة إلى Nmap الكلاسيكية (سطر الأوامر)، تشمل المجموعة: Zenmap (واجهة رسومية متقدمة وعارض النتائج)، Ncat (أداة مرنة لنقل البيانات وإعادة التوجيه وتصحيح الأخطاء)، Ndiff (أداة لمقارنة نتائج المسح)، Nping (أداة لتوليد الحزم وتحليل الاستجابة)."}, {"name": "محرك Nmap للبرمجة النصية (NSE)", "description": "ميزة قوية لتوسيع وظائف Nmap، تمكن من كتابة برامج نصية مخصصة للمسح والكشف."}], "statistics": {}, "temporal_info": {"anniversaries": [{"event": "Nmap turned 20 years old", "date": "September 1, 2017"}], "release_dates_mentioned": ["Nmap 7.90", "Npcap 1.00", "Nmap 7.80 (for DEFCON 27)", "Nmap 7.50", "Nmap 7", "Nmap 6.40 (2013)", "Nmap 6.25 (2012)", "Nmap 6.01", "Nmap 6", "Nmap 5.50 (2011)", "Nmap 5.00"]}, "geographical_data": {}, "references": ["مذكورة في اثني عشر فيلماً، منها: The Matrix Reloaded، Die Hard 4، Girl With the Dragon Tattoo، The Bourne Ultimatum، Elysium، G.I. Joe: Retaliation.", "مذكورة في مئات مقالات المجلات، والعديد من الكتب، وسلسلة كتب هزلية واحدة."]}