{"extracted_information": "المحتوى يقدم معلومات شاملة حول استخبارات المصادر المفتوحة (OSINT)، مع التركيز على تعريفها، استخداماتها من قبل المدافعين والمهاجمين، تقنيات جمع البيانات، وأدواتها. كما يتناول بالتفصيل الجوانب الأخلاقية والقانونية لاستخدام OSINT في الأمن السيبراني.", "specifications": {}, "pricing": {}, "features": [{"name": "تقنيات جمع بيانات OSINT", "description": "ثلاثة طرق شائعة لجمع بيانات الاستخبارات المفتوحة:", "details": [{"technique": "الجمع السلبي (Passive Collection)", "description": "الطريقة الأكثر شيوعًا. تتضمن استخلاص البيانات من مواقع الويب المتاحة للعامة، واسترداد البيانات من واجهات برمجة التطبيقات المفتوحة (مثل Twitter API)، وسحب البيانات من مصادر معلومات الويب العميقة. يتم تحليل البيانات وتنظيمها بعد ذلك."}, {"technique": "الجمع شبه السلبي (Semi-Passive Collection)", "description": "يتطلب خبرة أكبر. يوجه حركة المرور إلى خادم مستهدف للحصول على معلومات حوله. يجب أن تكون حركة المرور الخاصة بالماسح مشابهة لحركة مرور الإنترنت العادية لتجنب الكشف."}, {"technique": "الجمع النشط (Active Collection)", "description": "يتفاعل مباشرة مع نظام لجمع معلومات عنه. تستخدم أنظمة الجمع النشط تقنيات متقدمة للوصول إلى المنافذ المفتوحة، وفحص الخوادم أو تطبيقات الويب بحثًا عن الثغرات الأمنية. يمكن الكشف عن هذا النوع من جمع البيانات من قبل الهدف ويكشف عملية الاستطلاع. يترك أثرًا في جدار الحماية الخاص بالهدف، أو نظام كشف التسلل (IDS)، أو نظام منع التسلل (IPS). تُعد هجمات الهندسة الاجتماعية على الأهداف أيضًا شكلاً من أشكال جمع المعلومات الاستخباراتية النشطة."}]}, {"name": "أفضل الممارسات في تحقيقات المصادر المفتوحة (OSINT)", "description": "تشمل هذه الممارسات الجوانب الأخلاقية والقانونية لاستخدام OSINT:", "details": [{"practice": "التمييز بين البيانات والمعلومات الاستخباراتية", "description": "البيانات المفتوحة المصدر (OSD) هي معلومات خام غير مفلترة متاحة من مصادر عامة. إنها مدخل لـ OSINT، ولكنها ليست مفيدة بحد ذاتها. الاستخبارات مفتوحة المصدر (OSINT) هي شكل منظم ومغلف من OSD يمكن استخدامه للنشاط الأمني. يجب التركيز على تحديد البيانات اللازمة لتحقيق محدد، وتحسين البحث لاسترداد المعلومات ذات الصلة فقط لتقليل التكلفة والجهد."}, {"practice": "مراعاة متطلبات الامتثال القانوني", "description": "غالبًا ما تجمع OSINT بيانات شخصية، والتي يمكن تعريفها على أنها معلومات تعريف شخصية (PII). جمع وتخزين ومعالجة هذه البيانات يمكن أن يخلق مخاطر امتثال للمؤسسة. يجب الالتزام باللائحة العامة لحماية البيانات (GDPR) أو لوائح الخصوصية الأخرى. بالإضافة إلى ذلك، إذا تم اكتشاف نية إجرامية في تحقيق OSINT، فقد تكون هناك متطلبات قانونية محددة للكشف عن هذه البيانات (مثال: في المملكة المتحدة، قد يؤدي الكشف عن معلومات يمكن أن تنبه فردًا قيد التحقيق في قضية غسيل أموال إلى غرامات غير محدودة والسجن)."}, {"practice": "التحلي بالأخلاق", "description": "تعتمد OSINT على البيانات المتاحة للعامة، ولكن استخدام هذه البيانات يمكن أن يؤثر على الأشخاص داخل وخارج المؤسسة. يجب عدم النظر فقط في احتياجات التحقيق عند جمع البيانات، بل أيضًا في التأثير الأخلاقي والتنظيمي للبيانات. يجب الحد من جمع البيانات إلى الحد الأدنى الذي يمكن أن يساعد في تحقيق الأهداف دون انتهاك حقوق الموظفين أو الآخرين. تجنب جمع البيانات أو فحص الأنظمة 'تلقائيًا' بواسطة التكنولوجيا، حيث غالبًا ما يؤدي ذلك إلى جمع بيانات غير أخلاقية أو غير قانونية. جزء أساسي من OSINT الأخلاقي هو ضمان أن يكون جمع البيانات تحت سيطرة البشر، مع تعاون فعال بين جميع أصحاب المصلحة. يجب أن يفهم كل من يشارك في مشروع OSINT القيود الأخلاقية والقانونية، وأن يعملوا معًا لتجنب قضايا الخصوصية والمخاوف الأخلاقية الأخرى."}]}], "statistics": {}, "temporal_info": {}, "geographical_data": {"UK_money_laundering_law": "قوانين غسيل الأموال في المملكة المتحدة كمثال على المتطلبات القانونية للكشف عن المعلومات الجنائية."}, "references": []}