{"extracted_information": "تتناول هذه الوثيقة إرشادات حول عملية الكشف عن الثغرات الأمنية لكل من باحثي الأمن والمنظمات، مع التركيز على التعاون لمنع النزاعات.", "specifications": {}, "pricing": {}, "features": {"principles_of_vulnerability_disclosure": {"private_disclosure": {"description": "يتم الإبلاغ عن الثغرة بشكل خاص للمنظمة. قد تختار المنظمة نشر التفاصيل، ولكن هذا يتم بناءً على تقدير المنظمة، وليس الباحث. معظم برامج مكافآت الأخطاء تتطلب هذا النموذج.", "pros": "الخصوصية، متطلبات برامج المكافآت.", "cons": "إذا كان البائع لا يستجيب أو لا يثبت الثغرة، قد لا تُعلن التفاصيل أبدًا، مما يؤدي إلى إحباط الباحثين."}, "full_disclosure": {"description": "يتم الإعلان عن التفاصيل الكاملة للثغرة بمجرد تحديدها، بما في ذلك أحيانًا رمز الاستغلال، حتى قبل توفر التصحيح. يستخدم غالبًا عندما تتجاهل المنظمات الثغرات المبلغ عنها للضغط عليها لإصدار إصلاح.", "pros": "يضع ضغطًا على المنظمة للإصلاح.", "cons": "مثيرة للجدل وغير مسؤولة من قبل الكثيرين لأنها تتيح للمهاجمين استغلال الثغرات قبل وجود تصحيح. يجب أن تكون الملاذ الأخير."}, "responsible_or_coordinated_disclosure": {"description": "محاولة إيجاد حل وسط معقول. يتم الإبلاغ الأولي بشكل خاص، ولكن يتم نشر التفاصيل الكاملة بمجرد توفر التصحيح (أحيانًا مع تأخير). قد يحدد الباحث مهلة زمنية للمنظمة للاستجابة أو توفير تصحيح، وإذا لم يتم ذلك، قد يلجأ الباحث إلى الكشف الكامل.", "example": "نهج Google Project Zero ينشر التفاصيل بعد 90 يومًا بغض النظر عن وجود تصحيح.", "pros": "يوازن بين الكشف العام والوقت اللازم للإصلاح."}}, "researcher_responsibilities": ["التأكد من أن أي اختبار قانوني ومصرح به.", "احترام خصوصية الآخرين.", "بذل جهود معقولة للاتصال بفريق الأمن في المنظمة.", "تقديم تفاصيل كافية للسماح بالتحقق من الثغرات وإعادة إنتاجها.", "عدم طلب الدفع أو المكافآت للإبلاغ عن الثغرات خارج برنامج مكافآت الأخطاء المعمول به.", "معرفة وفهم القوانين في ولايتك القضائية قبل إجراء أي بحث أمني.", "قراءة نطاق وشروط برامج مكافآت الأخطاء بعناية والبقاء ضمنها.", "عدم طلب الدفع كشرط لتقديم المعلومات أو في مقابل عدم النشر، حيث قد يشكل ذلك ابتزازًا.", "الإبلاغ عن دخل مكافآت الأخطاء ودفع الضرائب المستحقة عليه.", "فهم عقود العمل قبل الإبلاغ عن الثغرات التي تم العثور عليها في العمل أو على معدات صاحب العمل.", "البحث عن تفاصيل الاتصال الأمنية المناسبة: (برامج مكافآت الأخطاء، security.txt، أنظمة تتبع المشكلات، security@ / abuse@، صفحة 'اتصل بنا' العامة، وسائل التواصل الاجتماعي، الاتصال بالهاتف، الوصول إلى المجتمع).", "تقديم تقرير أولي عبر قناة مشفرة (إذا أمكن) يتضمن: تفاصيل كافية للثغرة، طلبات HTTP والاستجابات، مقتطفات HTML، لقطات شاشة، إثبات المفهوم (إن وجد)، تأثير الثغرة، والمراجع.", "إخفاء أي بيانات شخصية قبل الإبلاغ.", "كتابة التقارير بعبارات واضحة وبسيطة، خاصة للمنظمات الأصغر.", "تقديم توصيات للتخفيف أو الحل (إن أمكن ومع الثقة).", "التواصل بوضوح بشأن نية النشر بعد فترة (إذا كان ذلك جزءًا من سياسة الكشف).", "تجنب السؤال عن المدفوعات أو المكافآت في الاتصال الأولي إذا لم يكن هناك برنامج مكافآت معمول به.", "الحفاظ على اتصال مستمر ومهني، وتقديم المساعدة في إعادة الاختبار إذا طلب ذلك.", "التحلي بالصبر وفهم أن عملية الإصلاح قد تستغرق وقتًا طويلاً.", "النظر في خيارات عند تجاهل المنظمة أو كونها معادية: الكشف العلني، الكشف المجهول، الإبلاغ إلى طرف ثالث (مثل الجهات التنظيمية)، أو المضي قدمًا.", "النشر بعد التصحيح: مناقشة مع البائع، إخطار البائع، وتضمين: ملخص عالي المستوى، الإصدارات المتأثرة والمُصلحة، التفاصيل التقنية، التخفيفات/الحلول البديلة، روابط استشارات البائع، الجدول الزمني للكشف."], "organizational_guidelines": ["توفير طريقة واضحة للباحثين للإبلاغ عن الثغرات بشكل آمن.", "تحديد نطاق وشروط أي برامج مكافآت أخطاء بوضوح.", "الاستجابة للتقارير في جدول زمني معقول.", "التواصل بصراحة مع الباحثين.", "عدم التهديد بإجراءات قانونية ضد الباحثين.", "طلب معرفات CVEs عند الاقتضاء.", "نشر استشارات أمنية وسجلات تغيير واضحة.", "تقديم المكافآت والتقدير.", "برامج مكافآت الأخطاء: تحفيز الباحثين، تحديد نطاق الأنظمة والتطبيقات، أنواع الثغرات المؤهلة، الأحكام القانونية (مثل سياسات الملاذ الآمن)، مبلغ المكافآت، والجدول الزمني للاستجابة/التعويض/الحل.", "نشر تفاصيل الاتصال: جهة اتصال أمنية مخصصة، تعليمات إبلاغ عن المشكلات الأمنية، security@، security.txt، برامج مكافآت أخطاء طرف ثالث.", "تدريب الموظفين في الخطوط الأمامية على كيفية التعامل مع تقارير المشكلات الأمنية وتصعيدها.", "توفير إرشادات للباحثين عند الإبلاغ: طلب معلومات محددة، فئات محددة، مفاتيح PGP، جدول زمني للاستجابة الأولية، أحكام الملاذ الآمن.", "التواصل مع الباحثين: الاستجابة لطلب الاتصال الأولي، الإقرار بتفاصيل الثغرة، طلب توضيح إضافي، تأكيد الثغرة وتوفير جدول زمني للإصلاح، طلب إعادة اختبار، تأكيد حل الثغرة.", "تقديم تحديثات منتظمة عن الحالة والجدول الزمني المتوقع.", "التعامل مع الباحثين الذين يطلبون الدفع: طلب الإفصاح عبر منصة مكافآت أخطاء وسيطة.", "الكشف عن الثغرات (للبرامج التجارية والمفتوحة المصدر): نشر استشارة أمنية تحتوي على ملخص، الإصدارات المتأثرة/المُصلحة، قيود، حلول بديلة، CVE، الجدول الزمني، تقدير للباحث، تفاصيل تقنية، توقيعات IDS/IPS. نشرها عبر صفحات مخصصة، قوائم بريدية، سجلات التغيير.", "الكشف عن الثغرات (للأنظمة الخاصة): اتخاذ قرار بشأن نشر التفاصيل، مع مراعاة الشفافية والمخاطر المحتملة (مثل كشف الإغفالات المحرجة أو المساعدة في تحديد المشكلات المماثلة).", "مكافأة الباحثين خارج برامج المكافآت: تقديم مكافآت مثل الخصومات، عناصر افتراضية، هدايا (swag)، أو تقدير في 'قاعة المشاهير'."], "ethical_considerations": ["يجب على الباحثين احترام خصوصية الآخرين.", "عدم المطالبة بالدفع أو المكافآت خارج برامج مكافآت الأخطاء المعمول بها لتجنب الابتزاز.", "يجب على المنظمات عدم التهديد بإجراءات قانونية ضد الباحثين الذين يعملون بشكل مسؤول.", "قانونية الاختبار: التأكد من أن الأنشطة قانونية داخل الولاية القضائية، وفهم سياسات الملاذ الآمن وبرامج مكافآت الأخطاء.", "الضرائب: مسؤولية الباحث عن الإبلاغ عن دخل مكافآت الأخطاء ودفع الضرائب.", "عقود العمل: فهم ما إذا كان يمكن الإبلاغ عن الثغرات التي تم العثور عليها في العمل.", "الاحترافية في التواصل: الحفاظ على سلوك مهني وإيجابي بين الباحثين والمنظمات، وتجنب العدائية.", "نشر رمز الاستغلال: موضوع مثير للجدل. يمكن أن يساعد المجرمين أو يساعد مديري الأنظمة والمختبرين. المهاجمون يمكنهم هندسة عكسية في كل الأحوال.", "قوانين عدم الإفصاح: فهم ما إذا كانت هناك اتفاقيات عدم إفصاح قد تؤثر على النشر.", "الشفافية مقابل الإحراج: موازنة المنظمات بين الشفافية في الكشف عن الثغرات والرغبة في تجنب كشف الإغفالات أو التكوينات الخاطئة المحتملة."]}, "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": [{"title": "The CERT Guide to Coordinated Vulnerability Disclosure", "url": "https://vuls.cert.org/confluence/display/CVD/The+CERT+Guide+to+Coordinated+Vulnerability+Disclosure"}, {"title": "HackerOne's Vulnerability Disclosure Guidelines", "url": "https://www.hackerone.com/disclosure-guidelines"}, {"title": "Disclose.io's Vulnerability Disclosure Terms", "url": "https://github.com/disclose/disclose/tree/master/terms"}, {"title": "Project Zero (Google's security research team)", "url": "https://googleprojectzero.blogspot.com/2020/01/policy-and-disclosure-2020-edition.html"}, {"title": "Disclose.io", "url": "https://disclose.io"}, {"title": "BugCrowd", "url": "https://bugcrowd.com/programs"}, {"title": "HackerOne", "url": "https://hackerone.com/directory/programs"}, {"title": "huntr.dev", "url": "https://huntr.dev/bounties"}, {"title": "Open Bug Bounty", "url": "https://www.openbugbounty.org"}, {"title": "Standoff", "url": "https://bugbounty.standoff365.com"}, {"title": "security.txt", "url": "https://securitytxt.org"}, {"title": "RFC 9116", "url": "https://www.rfc-editor.org/rfc/rfc9116.html#name-location-of-the-securitytxt"}, {"title": "Computer Emergency Response Team (CERT)", "url": "https://en.wikipedia.org/wiki/Computer_emergency_response_team"}, {"title": "CVE (Common Vulnerabilities and Exposures)", "url": "https://cve.mitre.org/cve/request_id.html"}]}