{"extracted_information": "المحتوى المقدم يناقش ما يعتبره الكاتب أهم عشرة ثغرات لتطبيقات الويب في عام 2024، مع الإشارة إلى أن القائمة الرسمية المحدثة من OWASP Top Ten 2024 (المتوقع صدورها في أوائل عام 2025) لم يتم إصدارها بعد. القائمة المقدمة في المقال هي توصيات الكاتب لأهم الثغرات التي يجب التركيز عليها حالياً.", "specifications": {}, "pricing": {}, "features": [{"name": "1. التحكم في الوصول المعطل (Broken Access Control)", "description": "يحدث عندما يتمكن المهاجمون من تجاوز القيود المفروضة على المستخدمين، مثل الوصول إلى حسابات مستخدمين آخرين أو ملفات مقيدة أو تنفيذ إجراءات إدارية غير مصرح بها. تتضمن أمثلة ذلك: فحوصات التفويض المفقودة/غير الكافية ومراجع الكائنات المباشرة غير الآمنة (IDOR).", "mitigation": ["استخدام ضوابط الوصول المستندة إلى الأدوار (RBAC) لتحديد الأدوار والصلاحيات بوضوح.", "تطبيق مبدأ الحد الأدنى من الامتيازات (Principle of Least Privilege).", "مراجعة واختبار الضوابط الدورية.", "استخدام مراجع كائنات غير مباشرة (مثل التعيينات أو الرموز المميزة) بدلاً من مراجع الكائنات المباشرة."]}, {"name": "2. إخفاقات التشفير (Cryptographic Failures)", "description": "تحدث عندما لا يتم تأمين المعلومات الحساسة بشكل كافٍ بسبب عيوب في التشفير، مثل إرسال البيانات عبر شبكة غير مشفرة (HTTP بدلاً من HTTPS)، أو تخزين المعلومات الحساسة بنص عادي، أو الاعتماد على خوارزميات تجزئة قديمة وغير آمنة (مثل MD5 أو SHA-1).", "mitigation": ["توليد وتخزين وتدوير والتخلص من مفاتيح التشفير بشكل صحيح.", "عدم تضمين المفاتيح مباشرة في الكود المصدري.", "التحقق الفوري من شهادات SSL/TLS.", "استخدام TLS (Transport Layer Security) دائمًا لتشفير البيانات المنقولة.", "استخدام خوارزميات تشفير قوية ومعيارية صناعيًا مثل AES-256 للبيانات الساكنة والمنقولة.", "استخدام خوارزميات تجزئة قوية لتأمين كلمات المرور مثل bcrypt أو scrypt أو Argon2، مع إضافة 'الملح' (salting)."]}, {"name": "3. الحقن (Injection)", "description": "تحدث عندما يتم إرسال إدخال المستخدم غير المصرح به إلى مترجم كجزء من أمر أو استعلام، مما يسمح للمهاجمين بتنفيذ أوامر ضارة أو الوصول إلى بيانات غير مصرح بها. تشمل أمثلة ذلك SQL Injection.", "mitigation": ["تنقية مدخلات المستخدم.", "استخدام الاستعلامات المعلمية (parameterized queries) أو العبارات المعدة (prepared statements).", "إجراء التحقق من المدخلات لضمان مطابقتها للتوقعات."]}, {"name": "4. التصميم غير الآمن (Insecure Design)", "description": "تشمل الثغرات الأمنية التي يتم إدخالها في مرحلة تصميم التطبيق بدلاً من مرحلة التنفيذ. تشمل أمثلة ذلك: الفشل في تضمين آليات للتحقق من صحة مدخلات المستخدم أو تنقيتها، عدم كفاية مصادقة المستخدم وتفويضه، إدارة الجلسات السيئة، معالجة الأخطاء والتسجيل السيئين، حماية البيانات غير الكافية، وإضافة ميزات معقدة أو غير ضرورية.", "mitigation": ["نمذجة التهديدات (threat modeling) كجزء من دورة حياة التطبيق.", "بناء الاختبارات في دورة حياة التطبيق.", "ضمان آليات قوية للتحقق من المدخلات والمصادقة والتفويض.", "تحسين إدارة الجلسات ومعالجة الأخطاء."]}, {"name": "5. سوء التكوين الأمني (Security Misconfiguration)", "description": "تحدث عندما يتم تعريف إعدادات الأمان أو تنفيذها أو صيانتها بشكل سيء على أي مستوى من مكدس التطبيق (مثل خادم الويب، قاعدة البيانات، الإطار). تشمل أمثلة ذلك: استخدام التكوينات الافتراضية غير الآمنة (مثل أسماء المستخدمين وكلمات المرور الافتراضية)، التكوينات غير المكتملة، معلومات التصحيح الحساسة المتبقية من الإنتاج، عدم تطبيق التحديثات الأمنية، والسماح بإدراج الدليل.", "mitigation": ["تغيير بيانات الاعتماد الافتراضية.", "تطبيق التصحيحات الأمنية بانتظام للبرامج والأطر والتبعيات.", "تثبيت الحد الأدنى من الميزات المطلوبة لتقليل سطح الهجوم.", "تكوين التطبيقات لمعالجة الأخطاء بشكل آمن دون الكشف عن معلومات حساسة.", "استخدام أدوات إدارة التكوين لفرض وصيانة الإعدادات الآمنة.", "إجراء تدقيقات منتظمة.", "تطبيق مبدأ الحد الأدنى من الامتيازات وتقسيم الشبكة."]}, {"name": "6. المكونات الضعيفة والقديمة (Vulnerable and Outdated Components)", "description": "تعتمد معظم مواقع الويب على تبعيات خارجية (أطر عمل، مكتبات، إضافات، مكونات إضافية). يصبح الحفاظ عليها آمنة ومحدثة مهمة صعبة. المكونات القديمة أو غير المدعومة لا تتلقى تحديثات أمنية، مما يجعلها أهدافًا سهلة للمهاجمين.", "mitigation": ["استخدام حلول لمسح الثغرات الأمنية (مثل Reflectiz) لتحديد المكونات الضعيفة.", "تحديث جميع المكونات الخارجية والمكتبات والإضافات والمكونات الإضافية بانتظام."]}, {"name": "7. إخفاقات التعريف والمصادقة (Identification and Authentication Failures)", "description": "تشمل أي نوع من الفشل يتعلق بالتحكم السيئ في الدخول، مثل استخدام كلمات مرور ضعيفة أو إعادة استخدامها، هجمات القوة الغاشمة، أو حشو بيانات الاعتماد (credential stuffing).", "mitigation": ["فرض سياسات كلمات مرور قوية (معقدة وتغيير متكرر).", "فرض آليات قفل الحساب بعد عدد معين من محاولات تسجيل الدخول الفاشلة.", "استخدام CAPTCHA للتمييز بين المستخدمين البشريين والبرامج الآلية.", "تطبيق المصادقة متعددة العوامل (MFA) لإضافة طبقة أمان إضافية."]}, {"name": "8. إخفاقات سلامة البرامج والبيانات (Software and Data Integrity Failures)", "description": "تتعلق هذه الفئة بالمخاطر المرتبطة بالتحقق غير الصحيح من البرامج والبيانات، مما يعني عدم حمايتها بشكل كافٍ من التغييرات غير المصرح بها أو التلف. تشمل الأمثلة: تحديثات البرامج غير الآمنة، عدم توقيع الكود، ومدخلات البيانات غير المنقاة.", "mitigation": ["تنفيذ فحوصات تحقق قوية لتحديثات البرامج.", "استخدام توقيع الكود لضمان الأصالة.", "التدقيق والمراقبة المنتظمة لسلامة البرامج والبيانات."]}, {"name": "9. إخفاقات تسجيل ومراقبة الأمن (Security Logging and Monitoring Failures)", "description": "تركز هذه الفئة على المخاطر المرتبطة بالتسجيل غير الكافي والمراقبة للأحداث الأمنية. يصعب الحفاظ على وضع أمني قوي بدون تسجيل مفصل لكل حادث، وإدارة مركزية للسجلات، ومراقبة السجلات للأنشطة المشبوهة.", "mitigation": ["تطبيق تسجيل مفصل لجميع الحوادث الأمنية.", "استخدام إدارة مركزية للسجلات.", "مراقبة السجلات للأنشطة المشبوهة بشكل مستمر."]}, {"name": "10. تزوير طلبات جانب الخادم (Server-Side Request Forgery - SSRF)", "description": "تحدث هذه الثغرة عندما يقبل تطبيق الويب إدخالًا يتحكم فيه المستخدم ويستخدمه لتقديم طلبات دون التحقق أو القيود المناسبة، مما يسمح للمهاجم بإجراء طلبات من الخادم إلى موارد داخلية أو خارجية. تشمل الثغرات المرتبطة بـ SSRF الوصول غير المقيد إلى عناوين URL، والتحقق غير الصحيح من المدخلات، والقدرة على الوصول إلى الخدمات الداخلية المحمية.", "mitigation": ["تطبيق تحقق صارم من المدخلات لضمان معالجة عناوين URL المسموح بها فقط.", "تحديد قدرة الخادم على الوصول إلى الموارد الداخلية.", "استخدام تقسيم الشبكة لحماية الخدمات الحساسة."]}], "statistics": {}, "temporal_info": {"official_list_release": "من المتوقع إصدار قائمة OWASP Top Ten المحدثة في أوائل عام 2025.", "data_collection_period": "بدأ فريق OWASP Top Ten الأساسي في جمع التقديمات منذ يناير 2024 ويغلق الاستبيان في سبتمبر."}, "geographical_data": {}, "references": []}