{"raw_content": "{\n  \"data\": {\n    \"extracted_information\": \"توفر وثيقة OWASP Cheat Sheet Series إرشادات مفصلة لعملية الكشف عن الثغرات الأمنية لكل من باحثي الأمن والمنظمات، مع التركيز على أهمية التعاون وتقليل النزاعات. تتناول الوثيقة النماذج المختلفة للإفصاح (الخاص، الكامل، والمسؤول/المنسق)، وتقدم إرشادات لكل من الباحثين عند الإبلاغ عن الثغرات وللمنظمات عند تلقي هذه التقارير.\",\n    \"specifications\": {\n      \"إرشادات_للباحثين\": {\n        \"المسؤوليات_الرئيسية\": [\n          \"ضمان قانونية واذن الاختبار.\",\n          \"احترام خصوصية الآخرين.\",\n          \"بذل جهود معقولة للاتصال بفريق الأمن بالمنظمة.\",\n          \"تقديم تفاصيل كافية للتحقق من الثغرات وإعادة إنتاجها.\",\n          \"عدم المطالبة بالدفع أو المكافآت للإبلاغ عن الثغرات خارج برنامج مكافآت الأخطاء المعمول به.\"\n        ],\n        \"تحذيرات_وقضايا_قانونية\": [\n          \"معرفة وفهم القوانين في ولايتك القضائية (هذه الوثيقة ليست مشورة قانونية).\",\n          \"فهم سياسات 'الملاذ الآمن' في برامج مكافآت الأخطاء والبقاء ضمن النطاق.\",\n          \"مراعاة قوانين بعض الدول التي تقيد الهندسة العكسية.\",\n          \"عدم المطالبة بالدفع كشرط لتقديم معلومات (قد يشكل ابتزازًا).\",\n          \"الإبلاغ عن دخل مكافآت الأخطاء لأغراض الضرائب (مسؤوليتك).\",\n          \"مراجعة العقود مع أصحاب العمل بخصوص الثغرات المكتشفة في العمل.\"\n        ],\n        \"العثور_على_تفاصيل_الاتصال\": [\n          \"برامج مكافآت الأخطاء (مثل BugCrowd، HackerOne، huntr.dev، Open Bug Bounty، Standoff).\",\n          \"ملف security.txt على الموقع (`/.well-known/security.txt`).\",\n          \"أنظمة تتبع المشكلات الموجودة.\",\n          \"عناوين البريد الإلكتروني العامة (security@، abuse@).\",\n          \"صفحة 'اتصل بنا' العامة على الموقع.\",\n          \"منصات التواصل الاجتماعي.\",\n          \"الاتصال الهاتفي بالمنظمة.\",\n          \"التواصل مع المجتمع.\",\n          \"طلب تفاصيل الاتصال بمسؤول الأمن بدلاً من كشف الثغرة لأي شخص في الاتصال الأولي.\",\n          \"الاستعانة بـ CERT الوطني أو القطاعي إذا تعذر الاتصال المباشر.\"\n        ],\n        \"التقرير_الأولي\": [\n          \"يجب أن يتم عبر قناة مشفرة (مثل مفاتيح PGP) إن أمكن.\",\n          \"تضمين تفاصيل كافية لفهم الثغرة وإعادة إنتاجها.\",\n          \"تضمين طلبات واستجابات HTTP، مقتطفات HTML، لقطات شاشة، أو أي دليل داعم.\",\n          \"حذف أي بيانات شخصية قبل الإبلاغ.\",\n          \"توفير رمز إثبات المفهوم (PoC) إذا كان متاحًا.\",\n          \"وصف تأثير الثغرة.\",\n          \"تقديم مراجع أو قراءات إضافية.\",\n          \"كتابة التقارير بعبارات واضحة وبسيطة، خاصة للمنظمات الصغيرة.\",\n          \"قد يكون من المفيد تقديم توصية حول كيفية التخفيف أو الحل (أو الإشارة إلى إرشادات عامة مثل وثائق OWASP).\",\n          \"توضيح نية النشر بعد فترة زمنية (إذا كانت ضمن سياسة الإفصاح المسؤول) بشكل غير مهدد.\",\n          \"تجنب السؤال عن المدفوعات أو المكافآت في الاتصال الأولي إذا لم يكن هناك برنامج مكافآت أخطاء معمول به.\"\n        ],\n        \"التواصل_المستمر\": [\n          \"التواصل الاحترافي والإيجابي حتى لو أصبحت العملية صعبة.\",\n          \"التحلي بالصبر، حيث أن معالجة الثغرات في بيئات المؤسسات تستغرق وقتًا طويلاً.\"\n        ],\n        \"متى_تتوقف\": [\n          \"يمكن الإفصاح علناً عن الثغرة (مع تحمل المخاطر القانونية).\",\n          \"الإفصاح عن الثغرة بشكل مجهول (مع اتخاذ تدابير أمنية مناسبة).\",\n          \"الإبلاغ عن الثغرة لجهة خارجية (مثل جهة تنظيمية صناعية أو سلطة حماية البيانات).\",\n          \"الاستسلام والانتقال إلى مشكلة أخرى، خاصة إذا كانت المنظمة غير مهتمة.\"\n        ],\n        \"النشر\": [\n          \"يفضل أن يتم النشر بالتشاور مع البائع.\",\n          \"إبلاغ البائع بنيتك في النشر وتزويده برابط للمعلومات المنشورة.\",\n          \"يجب أن يتضمن الإفصاح: ملخص عالي المستوى، الإصدارات المتأثرة والمُصلحة، تفاصيل تقنية أو PoC، إجراءات التخفيف، روابط لمشورة البائع، والجدول الزمني للاكتشاف والتواصل والإصدار.\",\n          \"قد تطلب بعض المنظمات تأخير النشر للسماح للمستخدمين بتثبيت التحديثات.\",\n          \"مناقشة ما إذا كان سيتم نشر رمز PoC عامل (الجدل حول الأخلاق مقابل فائدة الاختبار).\",\n          \"فهم الوضع القانوني قبل النشر في ظروف عدائية (مثل منظمة غير مستجيبة).\",\n          \"قراءة قواعد برنامج مكافآت الأخطاء قبل النشر حيث قد تمنع بعض البرامج النشر بدون موافقة.\"\n        ]\n      },\n      \"إرشادات_للمنظمات\": {\n        \"برامج_مكافآت_الأخطاء_(Bug_Bounty_Programs)\": {\n          \"التعريف\": \"تحفيز الباحثين على تحديد الثغرات والإبلاغ عنها من خلال تقديم مكافآت (نقدية أو مادية)، غالبًا ما تدار عبر طرف ثالث (BugCrowd, HackerOne).\",\n          \"النقاط_الرئيسية_للتحديد\": [\n            \"الأنظمة والتطبيقات التي تدخل ضمن النطاق (أنظمة حية أم بيئات اختبار؟ استبعاد أنظمة الطرف الثالث).\",\n            \"أنواع الثغرات المؤهلة للمكافآت.\",\n            \"الأحكام القانونية مثل سياسات 'الملاذ الآمن' (disclose.io).\",\n            \"مبلغ المكافآت وكيفية اتخاذ القرار (قد تكون باهظة أو قليلة جدًا).\",\n            \"الجدول الزمني للاستجابة الأولية، التأكيد، الدفع، وحل المشكلة.\"\n          ],\n          \"متى_يتم_تنفيذ_برنامج_مكافآت_الأخطاء\": \"للأمنيات الناضجة ذات العمليات القوية لحل الثغرات، تتطلب استثمارًا كبيرًا في الوقت والموارد.\",\n          \"التحديات\": [\n            \"وقت وموارد كافية للاستجابة للتقارير.\",\n            \"موظفين ذوي مهارات كافية لفرز التقارير (التعامل مع الإيجابيات الكاذبة أو التقارير غير المفيدة).\",\n            \"تأثير اختبار الأفراد على الأنظمة الحية (بما في ذلك المهاجمين غير المهرة).\",\n            \"عدم القدرة على التمييز بين حركة الاختبار الشرعية والهجمات الخبيثة.\",\n            \"الباحثون يخرجون عن النطاق المحدد.\",\n            \"التكلفة المالية لتشغيل البرنامج.\",\n            \"التعامل مع الباحثين غير الراضين.\"\n          ]\n        },\n        \"نشر_تفاصيل_الاتصال\": [\n          \"سهولة الوصول: كلما كان أسهل، زادت احتمالية تلقي تقارير أمنية.\",\n          \"الآليات_الشائعة\": [\n            \"جهة اتصال أمنية مخصصة في صفحة 'اتصل بنا'.\",\n            \"تعليمات مخصصة للإبلاغ عن مشكلات الأمان على نظام تتبع الأخطاء.\",\n            \"عنوان بريد إلكتروني شائع security@.\",\n            \"ملف security.txt على الموقع (`/.well-known/security.txt`).\",\n            \"استخدام برنامج مكافآت أخطاء طرف ثالث.\"\n          ],\n          \"توعية_الموظفين_الخط_الأمامي\": \"التأكد من أن موظفي الخط الأمامي (مثل مراقبي عنوان الاتصال الرئيسي، الدردشة الويب، وخطوط الهاتف) على دراية بكيفية التعامل مع تقارير المشكلات الأمنية ومن يجب تصعيدها إليه داخل المنظمة.\"\n        ],\n        \"توفير_إرشادات_للإبلاغ\": [\n          \"طلب معلومات محددة للمساعدة في تأكيد وحل المشكلة.\",\n          \"استخدام فئات محددة أو وضع علامة على المشكلة كسرية في نظام تتبع الأخطاء.\",\n          \"توفير مفاتيح PGP للاتصال المشفر.\",\n          \"تحديد جدول زمني للاستجابة الأولية والفرز.\",\n          \"تحديد أحكام الملاذ الآمن.\"\n        ],\n        \"التواصل_مع_الباحثين\": [\n          \"أحد أصعب النقاط في عملية الإفصاح عن الثغرات.\",\n          \"عملية التواصل المثالية:\",\n          \"الرد على طلب الاتصال الأولي بآلية واضحة للباحث لتقديم معلومات إضافية.\",\n          \"الإقرار بتفاصيل الثغرة وتوفير جدول زمني للفرز.\",\n          \"طلب توضيح أو تفاصيل إضافية إذا لزم الأمر.\",\n          \"تأكيد الثغرة وتوفير جدول زمني لتنفيذ الإصلاح.\",\n          \"تأكيد تفاصيل أي مكافأة أو مكافأة مقدمة.\",\n          \"إذا لزم الأمر، طلب من الباحث إعادة اختبار الثغرة.\",\n          \"تأكيد حل الثغرة.\",\n          \"توفير تحديثات منتظمة حول الحالة الحالية والجدول الزمني المتوقع.\"\n        ],\n        \"الباحثون_الذين_يطالبون_بالدفع\": [\n          \"قد تكون هذه الطلبات مشروعة، ولكن في كثير من الحالات تكون مجرد عمليات احتيال.\",\n          \"خيار واحد: طلب منهم تنفيذ الإفصاح عبر منصة مكافآت أخطاء وساطة.\"\n        ],\n        \"الإفصاح\": {\n          \"البرمجيات_التجارية_والمفتوحة_المصدر\": [\n            \"بمجرد حل الثغرة، يجب نشر التفاصيل في استشارة أمنية للبرنامج.\",\n            \"النشر لا يجعل البائع يبدو سيئًا.\",\n            \"الحد_الأدنى_للاستشارة_الأمنية_يجب_أن_يتضمن:\",\n            \"ملخص عالي المستوى للثغرة وتأثيرها.\",\n            \"قائمة واضحة بالإصدارات المتأثرة.\",\n            \"قائمة واضحة بإصدارات التصحيح.\",\n            \"أي تحذيرات حول متى يكون البرنامج عرضة للخطر.\",\n            \"أي حلول بديلة أو إجراءات تخفيف يمكن تنفيذها كحل مؤقت.\",\n            \"رقم CVE للثغرة.\",\n            \"يفضل_أيضًا_تضمين:\",\n            \"الجدول الزمني لعملية الإفصاح عن الثغرة.\",\n            \"الفضل للباحث الذي حدد الثغرة.\",\n            \"تفاصيل تقنية للثغرة.\",\n            \"توقيعات IDS/IPS أو مؤشرات أخرى للاختراق.\",\n            \"أماكن_نشر_الاستشارات_الأمنية:\",\n            \"صفحة 'الأمان' أو 'استشارات الأمن' مخصصة على الموقع.\",\n            \"قائمة بريدية أو منتدى أمني.\",\n            \"روابط من سجلات التغيير الرئيسية وملاحظات الإصدار.\",\n            \"قد يُطلب من الباحثين تأخير نشر التفاصيل الكاملة لفترة (مثل أسبوع) للسماح للمسؤولين بتثبيت التصحيحات.\"\n          ],\n          \"الأنظمة_الخاصة\": [\n            \"قرار بنشر التفاصيل بمجرد حل الثغرة.\",\n            \"النشر يوضح نهجًا استباقيًا وشفافًا للأمن، ولكنه قد يكشف عن سهو وإعدادات خاطئة محرجة.\",\n            \"قد تُستخدم كدليل على ثقافة أمنية ضعيفة في حالة اختراق مستقبلي.\",\n            \"قد تكشف عن تفاصيل فنية داخلية وتساعد المهاجمين في تحديد مشكلات أخرى.\",\n            \"يجب تقييم هذا القرار بعناية وقد يكون من الحكمة طلب مشورة قانونية.\"\n          ]\n        },\n        \"مكافأة_الباحثين\": [\n          \"عندما يحدد الباحثون الثغرات ويبلغون عنها خارج برنامج مكافآت الأخطاء (ويعملون باحترافية)، من الجيد تقديم نوع من المكافأة.\",\n          \"الخيارات_غير_النقدية:\",\n          \"خصومات أو رصيد للخدمات أو المنتجات.\",\n          \"مكافآت افتراضية (مثل عناصر داخل اللعبة، صور رمزية مخصصة).\",\n          \"قمصان، ملصقات، وغيرها من العناصر ذات العلامات التجارية.\",\n          \"التقدير في 'قاعة المشاهير' أو اعتراف مماثل.\"\n        ]\n      }\n    },\n    \"pricing\": {},\n    \"features\": [\n      \"إرشادات للباحثين والمنظمات بشأن الكشف عن الثغرات.\",\n      \"نماذج مختلفة للإفصاح: خاص، كامل، ومسؤول/منسق.\",\n      \"نصائح حول كيفية الإبلاغ عن الثغرات بشكل فعال.\",\n      \"إرشادات للمنظمات حول كيفية تلقي وإدارة تقارير الثغرات.\",\n      \"نقاش حول برامج مكافآت الأخطاء وكيفية تنفيذها.\",\n      \"أهمية التواصل الفعال بين الباحثين والمنظمات.\",\n      \"توصيات لنشر الاستشارات الأمنية بعد حل الثغرات.\"\n    ],\n    \"statistics\": {},\n    \"temporal_info\": {\n      \"الجدول_الزمني_للاستجابة\": \"يجب على المنظمات الاستجابة للتقارير في جدول زمني معقول.\",\n      \"نشر_التفاصيل_في_الافصاح_المسؤول\": \"بعد توفر التصحيح (أو بعد تأخير للسماح بتثبيت التصحيحات).\",\n      \"مهلة_الباحث_في_الافصاح_المسؤول\": \"قد يحدد الباحثون مهلة للمنظمة للاستجابة أو توفير تصحيح.\",\n      \"مثال_Project_Zero_من_جوجل\": \"ينشر التفاصيل الكاملة للثغرة بعد 90 يومًا بغض النظر عما إذا كانت المنظمة قد نشرت تصحيحًا أم لا.\",\n      \"النشر_بعد_التصحيح\": \"يوصى بنشر الاستشارة الأمنية بمجرد حل الثغرة وإعادة اختبارها.\"\n    },\n    \"geographical_data\": {\n      \"قوانين_الولاية_القضائية\": \"يجب على الباحثين فهم القوانين في ولايتهم القضائية قبل إجراء أي بحث أمني أو الإبلاغ عن الثغرات.\",\n      \"CERT_الوطني_أو_القطاعي\": \"يمكن أن يساعد في الاتصال بالمنظمة إذا تعذر الاتصال المباشر.\"\n    },\n    \"references\": [\n      \"The CERT Guide to Coordinated Vulnerability Disclosure (https://vuls.cert.org/confluence/display/CVD/The+CERT+Guide+to+Coordinated+Vulnerability+Disclosure)\",\n      \"HackerOne's Vulnerability Disclosure Guidelines (https://www.hackerone.com/disclosure-guidelines)\",\n      \"Disclose.io's Vulnerability Disclosure Terms (https://github.com/disclose/disclose/tree/master/terms)\",\n      \"Google's Project Zero (https://googleprojectzero.blogspot.com/2020/01/policy-and-disclosure-2020-edition.html)\",\n      \"disclose.io (https://disclose.io)\",\n      \"BugCrowd (https://bugcrowd.com/programs)\",\n      \"HackerOne (https://hackerone.com/directory/programs)\",\n      \"huntr.dev (https://huntr.dev/bounties)\",\n      \"Open Bug Bounty (https://www.openbugbounty.org)\",\n      \"Standoff (https://bugbounty.standoff365.com)\",\n      \"security.txt (https://securitytxt.org)\",\n      \"RFC 9116 (https://www.rfc-editor.org/rfc/rfc9116.html#name-location-of-the-securitytxt)\",\n      \"Computer Emergency Response Team (CERT) (https://en.wikipedia.org/wiki/Computer_emergency_response_team)\",\n      \"Common Vulnerabilities and Exposures (CVE) (https://cve.mitre.org/cve/request_id.html)\"\n    ]\n  }\n}"}