{"origin_pdf_path": "https://americaspg.com/public/article/pdf/3850", "text_in_pdf": "Metaheuristic Optimization Review (MOR)                                                                         Vol. 04, No. 01, PP. 41-49, 2025  \n41 \nDOI: https://doi.org/10.54216/MOR.04010 5  \nReceived: February  05, 2025 Revised: March 03, 2025 Accepted: May 0 9, 2025   \n \nMetaheuristic Optimization for Enhancing Cybersecurity \nFrameworks: An Overview of Methods and Impacts  \n \nShahid Mahmood1, \n1School of Finance and Economics, Jiangsu University, Zhenjiang, People's Republic of China  \nEmail : shahidnajam786@live.com  \n \n \nAbstract  \nThe increasing number of cyber security threats, notably ransomware and malware, make traditional methods ineffective, \nhence the need for intelligent methods. This literature r eview delves into the latest advancements in cyber security \ntechnologies that leverage artificial intelligence (AI), machine learning (ML), and deep learning (DL) to enhance system \ndefenses. Key focus areas include improving ransomware detection, developin g more effective intrusion detection \nsystems (IDS), securing Internet of Things (IoT) networks, and strengthening cryptographic methods. The reviewed \nstudies highlight how AI -driven techniques —such as convolutional neural networks (CNNs), long short -term m emory \n(LSTM) networks, and adversarial training —automate the detection of threats, optimize cyber security measures, and \noffer real -time responses to evolving risks. Innovative frameworks like Zero Trust Architecture (ZTA) and AI further \nbolster security b y offering automated threat mitigation and anomaly detection. Furthermore, new metaheuristic \nalgorithms are integrated into IDS systems to enhance the detection rate and minimize false positives. The advanced \napproaches show how AI could solve the constant ly emerging challenges in cyber security and focus on a continuous \ndevelopment approach to make cyber security scalable, robust, and transparent when considering complex attacks.  \nKeywords: Cybersecurity ; Artificial intelligence ; Machine learning ; Ransomwar e detection ; Intrusion detection systems ; \nInternet of Things ; Cryptographic systems  \n1. Introduction  \nMetaheuristic optimization has become one of the essential techniques in solving subsequent computational problems and \nimproving cybersecurity. This problem i s especially noticeable as the digital world expands; new threats require the \nevolution of security measures: more effective, versatile, and, at the same time, less resource consuming . Some common \napproaches to managing cybersecurity threats can be slow an d ineffective because the threats are constantly changing. \nTherefore, metaheuristic algorithms capable of searching large solution spaces and avoiding being trapped within local \noptima are enticing solutions. Researchers have shown that they have a lot of promise in enhancing the capabilities of \ncybersecurity systems, particularly in terms of the detection of threats, response mechanisms, and prognostic properties \n[1]. \nTherefore, metaheuristic optimization algorithms can be divided into population -based and  single -solution -based, each \ntype addressing the strengths and weaknesses of the other regarding specific problem types. These algorithms are designed \nto intelligently explore the search space and balance between exploration (searching new areas) and explo itation (refining \ncurrent solutions). For instance, the Dipper Throated Algorithm (DTO), a recently developed metaheuristic, has shown \nexcellent performance in feature selection and classification tasks, particularly in the medical field, such as \nElectroca rdiogram (ECG) classification, where accurate detection is critical for patient outcomes . Similarly, the \nintegration of metaheuristic models that hybridize different combinations has also been proven useful in difficult \nclassification problems such as bre ast cancer diagnosis, showing that they can accurately classify complex, non -linear, \nhigh-dimensional datasets [2].  \n\n \nMetaheuristic Optimization Review (MOR)                                                                         Vol. 04, No. 01, PP. 41-49, 2025  \n42 \nDOI: https://doi.org/10.54216/MOR.04010 5  \nReceived: February  05, 2025 Revised: March 03, 2025 Accepted: May 0 9, 2025  I like this aspect of metaheuristics because of the flexibility these algorithms possess, with an example being used in \nantennae design. For  instance, recent innovations in artificial intelligence have been employed to enhance the design of \nT-shaped monopole antennas to achieve higher performance in contemporary communication systems [3]. In addition, \nmetaheuristics were used to predict and mo del metamaterial antenna bandwidth, giving better models for such \napplications as wireless communication and radar Metaheuristic  solutions have the scope of solving a vast number of \nengineering problems, as presented in the following applications.  \nMetaheu ristic algorithms are widely discussed in cybersecurity; they are mainly used to improve the efficiency of machine \nlearning in the systems of threat detection and response. Real -life situations such as risk detection in the supply chain \nusing dynamic votin g classifiers show that the algorithms are useful in high -risk category environments . In a similar \ncontext, the application of metaheuristics in agricultural image analysis has enhanced the efficiency of weed detection in \nthose images captured by drones an d, at the same time, has enhanced the rate of detection in large datasets also [ 5]. \nMaking precise predictions is also vital in other fields, such as energy, where hybrid Long Short -Term Memory (LSTM) \nmodels optimized by metaheuristics have been used to fo recast direct normal irradiation for solar power projects in hyper -\narid regions such predictive ability is very important for energy resource management and demonstrates the versatility of \nthese techniques.  \nMoreover, metaheuristic algorithms like the Chao tic Harris Hawks Optimization (HHO) algorithm have proven effective \nin solving unconstrained function optimization problems, further solidifying their relevance in cybersecurity and broader \noptimization challenges [8]. Recently, new methods such as the Wat erwheel Plant Algorithm (WWPA)  and the Al -Biruni \nEarth Radius (BER) algorithm [10] have been introduced, expanding the arsenal of optimization techniques available for \nsolving complex problems. These algorithms have been tested within practical contexts, and examples include disease \nclassification where Monkeypox disease has been classified using deep convolutional neural networks, showing promise \nof the algorithms in pandemic responses [ 6]. \nIn addition to the medical and engineering fields, metaheuristics  assist with environmental issues. For instance, in \nagricultural research, metaheuristic -operated models have been employed to estimate the daily evapotranspiration rates \nunder semi -arid weather circumstances. These are useful for efficient water supply ma nagement in regions with high \ndrought rates hence , metaheuristic approaches have helped to enhance the design and optimization of metamaterial \nantennas, which is one of the essential components of modern wireless communication [13]. Such approaches have a lso \nbeen used in smart city governance since traffic congestion can be avoided using soft GRU -based recurrent neural \nnetworks for efficient traffic flow patterns, providing better and real -time planning solutions for smart cities [ 7]. \nMetaheuristics have a lso been applied in environmental control because models developed with metaheuristics have been \nused to predict water quality. For instance, machine -learning  models alongside the grid search method and metaheuristic \noptimization have been used to improve water quality prediction. At the same time, the algorithms explicitly show their \ncapability to handle large and complex environmental data From  the article, experience has also shown that metaheuristic \ntechniques have been effectively applied to multi -objective optimization problems of even greater difficulty in industrial \nengineering The  recent development of the Puma Optimizer  \nIn the field of network security, metaheuristic -based optimization has been essential, for example, in feature selection for \nintrusion detection systems. These systems have been designed to monitor and prevent possibly fraudulent activities and \nhave been enhanced significantly by hybrid metaheuristic algorithms to improve the detection of possible threats At  the \nsame time, change s based on optimized solutions of the proposed Dipper Throated Algorithm have been proposed to \nimprove metamaterial antenna design  which proves the constant development of such methods to address practical tasks \nin engineering. In the same way, metaheuris tic algorithms are applied to deep learning models for the prediction of \ncustomer churn in the telecommunication industry, and they significantly enhance these predictions, where customer \nloyalty seems to be a critical factor [ 8]. \nWireless sensor networks are another area where these algorithms have made a huge difference, specifically in using \nmetaheuristic algorithms. For instance, Stochastic Fractal Search (SFS) combined with Particle Swarm Optimization \n(PSO) has been used to enhance the performance of K -Nearest Neighbors algorithms in such networks, improving both \nefficiency and accuracy Also, metaheuristics utilized for solving the energy efficiency problem in buildings, based on the \nhyperparameter optimization of multilayer perceptron models, show grea t prospects in energy saving and increasing \nresource -saving indicators  \nWireless sensor networks have also experienced an improvement in their efficiency through the use of the Al -Biruni Earth \nRadius Optimization algorithm, which optimizes how such network s oversee resource and data utilization  In education, \nmetaheuristics have been used in selecting the best prediction models to estimate students' performance and enhance the \npredictiveness of these models; more light is shed on the aspects that influence students' performances in academic \npursuits  In addition, metaheuristic methods have also been applied in enhancing the predictive features for molding \nstudent performance across environments and computational studies that compare different learning algori thms for the \nperformance of school data [ 9]. \n\n \nMetaheuristic Optimization Review (MOR)                                                                         Vol. 04, No. 01, PP. 41-49, 2025  \n43 \nDOI: https://doi.org/10.54216/MOR.04010 5  \nReceived: February  05, 2025 Revised: March 03, 2025 Accepted: May 0 9, 2025   \nMetaheuristic optimization has also worked for cases protecting environments, such as satellite image classification for \noil spills using machine learning. This application shows that these techniques could hel p towards environmental \nsustainability because event detection of pollution can be achieved more efficiently and effectively . Finally , in \ninfrastructural maintenance, metaheuristics have been used in pothole detection in asphalt roads using deep learning \nmodels, which enhanced road safety and maintenance by providing an accurate real -time detection system [ 10]. \nMetaheuristic optimization methodologies are gaining more significant importance in numerous fields and application \nareas, including computer securit y, environmental monitoring, and infrastructure systems. Due to their ability to fine -tune \nsophisticated systems and learn from environmental changes, these algorithms are becoming critical tools for approaching \nsome of the current global issues. The futur e contribution of metaheuristic algorithms to technology and innovation is \nexpected to be higher and continue with steady improvements.  \n2. Literature Review  \nThe nature and frequency of cyber threats have evolved with higher levels of sophistication and are constantly growing, \nespecially ransomware and malware, making traditional solutions and approaches to security insufficient. This literature \nreview explores recent advances in cybersecurity technologies, particularly those leveraging artificial intelligenc e (AI), \nmachine learning (ML), and deep learning (DL). Various studies focus on enhancing ransomware detection, improving \nintrusion detection systems (IDS), securing Internet of Things (IoT) networks, and strengthening cryptographic systems. \nSuch advanced techniques prove how AI can work in terms of threat identification, enhancing security measures of \nsystems and eradicating new -age cyber threats. Combining these insights, this review underscores the need for the present \nand future constant creation of nov el cybersecurity approaches.  \nThe diversified types and strains of ransomware threats have posed new challenges to earlier microbiological safety \nsolutions that required more of a biological approach.  Discusses  a multi -modal AI -based solution to improve ra nsomware \nattacks' detection, analysis, and prevention. By integrating machine learning (ML), deep learning (DL), and natural \nlanguage processing (NLP), the approach provides a comprehensive defense against sophisticated ransomware tactics. \nSupervised and u nsupervised ML algorithms identify ransomware signatures and anomalous behaviors, with \nconvolutional neural networks (CNNs) detecting patterns in file structures and network traffic. In contrast, long short -\nterm memory (LSTM) networks analyze system activi ties to identify potential attacks over time. NLP extracts indicators \nof compromise (IOCs) from unstructured data, such as phishing emails and dark web forums. Among the other features, \nsentiment analysis and topic modeling help improve prediction accuracy . Adversarial training as well as defensive \ndistillation solve adversarial robustness . Using accuracy, precision, recall, F1 -score, and ROC -AUC metrics, the proposed \napproach reveals the possibility of minimizing the consequences of ransomware attac ks and the time required to solve \nthem.  \nGlobal cyber threats have been reported to be rising in both frequency and severity and, therefore, require more strategic \ncybersecurity solutions. According to the work done in [ 11], intelligence for cybersecurity r isk management is conducted \nusing frameworks that form a basis for management solutions that contradict risk by evaluating existing cybersecurity \ndata. Other structures, including the MITRE ATT&CK, provide up -to-date countermeasures in response to the atta cker's \ncapacity; however, they do not utilize hackers in constructing cyber threat intelligence. To partially fill this gap, the \nresearchers created ATT&CK -Link, a new information technology artifact enriched with a transformer and multi -teacher \nknowledge distillation architecture. This framework extends hacker threats to the MITRE, a regularly applied framework. \nThe paper illustrates how these hospital systems can use ATT&CK -Link to prevent hacker threats to their cyber \ninfrastructure. This framework makes  it possible for effective cybersecurity professionals to develop strategic, operational \nand tactical cyber threat intelligence. Similarly, ATT&CK -Link helps reinforce the knowledge base of information \nsystems by providing structures with mechanisms for fo cused cybersecurity measurement, analysis,  and broader text \nanalysis investigation as part of real parallel multi -vector distillation and classification.  \nAs the threat actors' process evolves, so does the threat environment, making it necessary to shift the cybersecurity \nstrategies. Zero Trust Architecture (ZTA) has become a robust model based on the principle of \"Never Trust, Always \nVerify,\" demanding intelligent access control and threat mitigation. Artificial Intelligence (AI), particularly Machine \nLearning (ML), offers significant potential to augment ZTA by automating threat detection and enabling real -time \nresponses. This work examines the solution of AI -embedded threat detection under ZTA architectures, where ML \nalgorithms are employed to recognize anomalies and provide responsive countermeasures. It highlights the limitations of \ntraditional security models in combating sophisticated attacks like social engineering and advanced persistent threats \n(APTs). ML is best used for segmenting and analyzing b ig data security sets to identify anomalous or deviant user \nbehavior. In addition , AI responds to incidents automatically and moves for threatening hunting in ZTA. The study also \nacknowledges the challenges of integrating AI, emphasizing the need for high -quality  training data and explainable AI \n(XAI) to ensure transparency  [12]. \n\n \nMetaheuristic Optimization Review (MOR)                                                                         Vol. 04, No. 01, PP. 41-49, 2025  \n44 \nDOI: https://doi.org/10.54216/MOR.04010 5  \nReceived: February  05, 2025 Revised: March 03, 2025 Accepted: May 0 9, 2025  The Internet of Things (IoT) interconnects physical and virtual objects embedded with sensors, software, and technologies \nthat exchange data over the Internet.  Despite IoT's benefits by establishing connections and personalizing billions of \ndevices and people, it presents severe threats to security. Due to the exponential growth in the use of IoT devices, they \nare a favorite of hackers who aim at spying on users and intruding on their pri vacy. Because of such features and \nconstraints of IoT, one can see some of the threats unique to this domain,, including confidentiality, authentication, access  \ncontrol and privacy. This paper measures and discusses the threats in IoT and categorizes them based on the layers of the \nIoT model. They include countermeasures, mitigation measures, and other related topics: An examination of selected \ncommon application layer protocols commonly applied on IoT networks, their security threats/vulnerabilities,, and some \nof their main constraints [13]. \nThe increasing prevalence of Internet of Things (IoT) systems has raised significant security concerns, with cyber -attacks \nsuch as denial -of-service attacks, malware infections, and phishing posing serious risks.  Using security mechanisms \nbased on machine learning is suggested for overcoming the mentioned challenges, underlining the need for the models' \nhigh stability and several defensive actions. The study employs the Ridge Classifier as a strong weapon for finding \narrangers in IoT systems. It provides the ability to detect and prevent cyber -attacks in real -time with the help of a \ncomprehensible array of secure network data. Experimental findings reveal that the system's effectiveness for threat \nidentification and preve ntion is very high, with a rate of accuracy recorded at 97 percent. This effectiveness strengthens \nthe governmental and business networks and makes important data safe from malicious threats. The study emphasizes \nthat it is impossible to ensure the so -called 'secure -by-design' IoT networks without the use of Machine Learning -based \nsecurity instruments and that the proposed technique of the 'Ridge Classifier' model comprehensively insulates IoT \nnetworks against cyber threats in terms of data and network inte grity, confidentiality, and availability [14]. \nNetwork cyber threats have targeted many intrinsic system vulnerabilities; thus, network intrusion detection is a critical \ncomponent of the cybersecurity field.  Intrusion  detection systems (IDSs) using machine  learning (ML) have been \ndeveloped to make decisions with minimal human intervention. While ML -based IDS advancements have surpassed \ntraditional methods, they still face challenges in achieving high detection rates (DR) and low false alarm rates (FAR) [15]. \nThis paper proposes a meta -heuristic optimization algorithm -based hierarchical IDS to enhance the identification of \ndifferent attacks and safe computing spaces. The approach consists of three stages: data pre -processing, feature extraction, \nand data divis ion; choosing the best hyperparameters of the ELM using two new meta -heuristic algorithms; and sorting \nof binary models using a hierarchical anomaly detection system. The proposed IDS effectively and efficiently does multi -\nclassification, and the average a ccuracy, DR, and FAR were estimated to be 98.93%, 99.63% and 99.19%, with a FAR \nof 0.01 on the UNSW -NB15 and CICIDS2017 dataset  [16]. \nThe increasing use of the Internet, with its inherent vulnerabilities, has necessitated the adoption of Intrusion Detectio n \nSystems (IDS) to ensure network security. Presents  IDSs as important systems that recognize intrusions, invasions, and \nnetwork failures [ 17]. The intrusion detection problem is posed as classification, and selecting the features is important \nfor classific ation techniques [ 18]. Several conventional approaches exist, including Neural Networks, Fuzzy Logic, Data \nMining, and Metaheuristic techniques. A novel approach is introduced using the Horse Herd Optimization Algorithm \n(HOA) for feature selection in networ k intrusion detection. The Adjustment Hopping Oscillator is currently incorporated \ninto a discrete quantum, inspired, and multi -objective optimizer. MQBHOA, this algorithm incorporates quantum -\ncomputing  components to optimize the exploration -exploitation t rade-off. The K -Nearest Neighbour (KNN) classifier is \nused, and the method is tested on NSL -KDD and CSE -CIC-IDS2018 datasets [19]. The results compare favorably to \npreviously evaluated algorithms and show a 6% increase in feature selection and classificatio n accuracy – 99.8% for \nintrusion detection.  \nInternet services and applications have become more popular, potentially escalating cyber crusades, unauthorized \napplication utilization, and threatening service accessibility and consumer privacy.  A network Int rusion Detection System \n(IDS) is designed to detect abnormal traffic behaviors that firewalls might miss. Some measures include feature selection,, \nwhich is a process of narrowing narrowing  down data dimensions to eliminate irrelevant data that adds value t o IDS. This \npaper presents a modified Grey Wolf Optimization (GWO) algorithm to improve IDS efficacy in detecting normal and \nanomalous network traffic. The enhancements include the intelligent filter and wrapper integrated smart initialization \nphase to pro mote informative features initially. Additionally, the Extreme Learning Machine (ELM) is used for high -\nspeed classification, with GWO employed to optimize ELM's parameters. In general attacks detection tested on the \nUNSWNB -15 dataset, the proposed model pr oduced accuracy, F1 -score and G -mean of 81%,78% and 84%, respectively, \nand crossover and false positives of less than 30%.  \nRapid developments in Internet of Things (IoT) systems have led to widespread integration into daily life, particularly in \nareas like  healthcare, where real -time monitoring can significantly affect  outcomes. According to [ 20], concerning the \nissues that hinder IoT interoperability on a larger scale, one of the challenges is sustainability, especially in healthcare \nservices, which has to  provide accurate organization of services without negatively influencing the environment. Security \nremains fundamental to the survival of IoT systems, and early detection and tackling challenges remain compulsory  [21]. \nThe present research explores the Io T security concern using machine learning optimized with a modified Firefly \n\n \nMetaheuristic Optimization Review (MOR)                                                                         Vol. 04, No. 01, PP. 41-49, 2025  \n45 \nDOI: https://doi.org/10.54216/MOR.04010 5  \nReceived: February  05, 2025 Revised: March 03, 2025 Accepted: May 0 9, 2025  algorithm applied to the context of Healthcare 4.0 IoT devices. Metaheuristic solutions are found to be optimal and \npowerful in solving NP -hard problems with acceptable speed and p recision to support sustainable systems. Machine \nlearning models used in experiments included a range of models trained on IoT structure's synthetic datasets, enhanced \nby improved Firefly metaheuristics. Shapley's Additive explanations (SHAP) analysis was used to identify key factors \ncontributing to security issues. Testing and comparison experiments reveal meaningful enhancements to solve the issues \nmentioned above [ 22]. \nIn recent years, rapid advancements in smart devices have led to an exponential increas e in the data generated, known as \nBig Data (BD), which traditional analytics techniques struggle to handle.  The increase in these data also leads to new \nopportunities for attack methods such as SQL injection attacks, Operating Systems fingerprinting attac ks, and malicious \ncode execution during data analysis [ 23]. This paper explores Machine Learning (ML) and Deep Learning (DL) models \ncapable of identifying and mitigating known and unknown attacks. These techniques use traffic data sets for training and \ntesting to make wise decisions for an attack in a large network environment. The paper also proposes a DL and ML -based \nSecure Data Analytics (SDA) architecture to classify input data as normal or attack -related. Threat modeling is used to \nidentify challenges t o expand a detailed taxonomy of the SDA and encompasses surface area, efficiency, latency, \naccuracy, and reliability. Lastly, comparing existing SDA proposals enables users to select the most appropriate solution \naccording to its benefits [ 24]. \nCybersecurit y has gained significant attention due to the widespread adoption of the Internet of Things (IoT), the rapid \ngrowth of computer networks, and the increasing number of related applications. As highlighted in [ 25], detecting cyber -\nattacks or anomalies in net works and developing effective intrusion detection systems (IDS) is becoming increasingly \ncrucial. This paper introduces \"IntruDTree,\" a machine learning -based security model designed to build an intelligent \nIDS. The model categorizes the security features  based on the priority level and builds a generalized detection tree model \nfrom the most relevant features. This approach facilitates the increase of pass rates of other unseen cases and reduces \ncomputational costs regarding feature dimensions. The impact of the IntruDTree model was also investigated through \nexperiments on cybersecurity datasets, where several performance measures such as precision, recall, F1 -score, accuracy, \nand ROC values were used in the evaluations. Further, IntruDTree was evaluated ag ainst conventional machine learning \ntechniques such as naive Bayesian, logistic regression, support vector machine, and k -neighbor and exhibited the best \nresult.  \nAn intrusion detection system (IDS) is crucial for identifying complex network attacks.  Anomaly -based  IDS (AIDS) \nsystems have increasingly utilized machine learning (ML) and deep learning (DL) algorithms  [26]. Nevertheless, the \nliterature presents some shortcomings, including random choice of sequences, utilization of outdated data sets and \nsuperf icial method validation. This paper also compares and contrasts various algorithms, parameters, and testing criteria \nin currently available AIDS studies using different datasets and attack types. Ten well -known supervised and \nunsupervised ML algorithms are  used to estimate successful AIDS solutions. These include supervised methods like \nartificial neural networks (ANN), decision trees (DT), k -nearest neighbor (k -NN), and unsupervised methods like k -means \nand self -organizing maps (SOM). The analysis also dis cusses algorithm tuning and training parameters about classifier \nassessment. [27] In contrast to previous works, this work assesses 31 ML -AIDS models using true positive/negative rates, \naccuracy, precision, recall, the F1 -score, and training/testing time. D espite being a highly imbalanced multiclass \nCICIDS2017 dataset, k -NN-AIDS, DT -AIDS, and NB -AIDS models were more effective in detecting web attacks than \nothers.  \nThe rise in computer networks and internet attacks has become a significant concern for service  providers, leading to the \nincreased need for effective intrusion detection systems (IDSs) to mitigate network intrusions.  while IDSs have been \ncrucial in identifying network attacks, many existing models struggle with high false alarm rates and difficult y in detecting \ncertain attack types, particularly User -to-Root (U2R) and Remote -to-Local (R2L) attacks. These attacks sometimes pose \nlower detection algorithm accuracy in the current IDS model. To address these challenges, this paper proposes a \nbidirection al Long -Short -Term -Memory (BiDLSTM) based IDS designed to improve detection accuracy and reduce false \nalarms. The proposed model was trained and tested NSL -KDD, a standard IDS development dataset. Experimental results \nconfirm the usefulness of the BiDLSTM model, which, besidesbesides having higher accuracy, precision, recall, and F1 -\nscore compared with traditional LSTM or some other state -of-art models, has also significantly lowered the number of \nfalse alarms. Furthermore, using the proposed BiDLSTM model,  it was possible to detect the U2R and R2L attacks with \nimproved detection accuracy relative to models based only on LSTM.  \nWireless sensor networks (WSNs) are widely used across industries for monitoring, data transmission, and gathering \ntasks, especially within the Industrial Internet of Things (IIoT). However, due to the small sensor nodes (SN) involved, \nresource management aimed at energy efficiency is a key challenge.  Power consumption for the interpretation, \ntransmission and storage of data between th e sensors should be minimal to enhance the operation of the network. In \naddition to energy efficiency, the aspects of network security, namely intrusion detection and prevention, constitute a \nsignificant issue. This work introduces the Meta -Heuristic -Based  Secure and Energy -Efficient Routing (MHSEER) \nprotocol for WSN -IIoT, which optimizes forwarding decisions based on hops, connection integrity, and remaining energy. \n\n \nMetaheuristic Optimization Review (MOR)                                                                         Vol. 04, No. 01, PP. 41-49, 2025  \n46 \nDOI: https://doi.org/10.54216/MOR.04010 5  \nReceived: February  05, 2025 Revised: March 03, 2025 Accepted: May 0 9, 2025  To enhance security, the protocol incorporates counter -encryption mode (CEM) for data encry ption. The protocol operates \nin two stages: the first is applicable for secure data routing using heuristics, and the second is CEM for security \nenhancement. When compared MHSEER with other protocols such as Sectrust -RPL and HBEER, the performance is \nenhan ced greatly by boosting throughput to 95.81%, reducing packet drop ratio,h, packet delay and energy consumption \nand faulty pathways to 5.12%, 0.10ms, 0.0102mJ and 6.51%, respectively.  \nThe Internet of Medical Things (IoMT) security is crucial, as it connect s various medical devices to enhance patient care \nand real -time monitoring.  Proposed high -security frameworks that include attribute -based access control, encryption and \nprivacy. However, many of these models are either too complex or not flexible enough for real -time processing, for their \nsecurity performance relies heavily on internal parameters that cannot be changed in response to a new threat. These \ndrawbacks are the main reason for developing an improved hybrid metaheuristic model for better security  of IoT in \nhealthcare. The model first employs blockchain technology but can dynamically change internal hashing and encryption \nas required. By combining Elephant Herding Optimization (EHO) and Grey Wolf Optimization (GWO), the model \noptimizes security and  quality of service in blockchain -based IoMT systems [ 28]. The forward fitness functions are \nsecure, and the service quality is good against threats like DDoS, man -in-the-middle, masquerading, and Sybil attacks. \nThe other is the dual fitness functions. In t his proposed model, the average results of state -of-the-art models have been \ncompared, and the results obtained from the proposed model are increases in network consistency by 8.7%, throughput \nby 6.4% and packet delivery by 8.2%. In contrast, attack detect ion and mitigation are 9.4% higher. The potential of the \nmodel to be used in real -time healthcare use cases can be inferred from these results.  \nThe Internet of Things (IoT) refers to a network of physical objects communicating with other devices through th e \nInternet.  Which  states that security plays a significant role in IoT -based communication since it is hard to standardize the \ndevices in the network. These systems have been described as interconnects; it remains difficult to guarantee security, \nidentity , permission, and privacy. This paper proposes a novel Chaotic Bumble Bees Mating Optimization (CBBMO) \nalgorithm for secure data transmission integrated with a trust -sensing model (CBBMOR -TSM) to address these issues. \nThe use of the concepts of chaos in en hancing the rate of convergence of the CBBMO model increases the rate of \nconvergence of the classical Bumble Bees Mating Optimization. The model's primary objective is to design a trust -sensing \nsystem for capturing malicious nodes and guarantee secure rout ing. The trust values of IoT nodes will be computed using \ndirect and indirect trust to identify threats. Security routing is then done using the CBBMO algorithm to determine the \nbest path for transmitting data. The model's performance was tested extensivel y, showing superior results with a higher \naverage Packet Delivery Ratio (PDR) of 0.931 and a lower average Packet Loss Ratio (PLR) of 0.069, outperforming \nother methods such as TRM_IOT, OSEAP_IOT, and MCTAR -IOT, which had higher PLRs of 0.219, 0.161, and 0 .110, \nrespectively.  \nEven in today's advanced digital security systems using passwords or PIN codes developed, cryptographic keys are \nusually the output of stochastic or probabilistic random processes or are derived using complex mathematical \ntransformation s. As for these methods, despite their considerable strength, their storage and distribution need proper and \ncostly means. According to   to apply biometric data for generating cryptographic keys to avoid difficulties in storing and \ndistributing them. The research focuses on biometric key generation technologies utilizing deep learning models, \nspecifically convolutional neural networks (CNNs), to extract biometric features from facial images. A set of features is \nthen extracted from the audio signals subjec ted to code -based cryptographic extractors. The performance of different deep \nlearning models and the cryptographic extractor was assessed regarding detection accuracy and false positive rate, and \nthe optimized parameters yielded less than 10% error rate. The low error rate of the generated key makes the generated \nkeys suitable for biometric authentication. Furthermore, the use of code -based cryptographic extractors is secure from \nquantum attacks and makes the biometric key generation technique more viable in today's IT security systems. The present \nstudy contributes to designing safe, effective, and robust authentication techniques due to biometrics and deep learning  \n[29]. \nThis study focuses on side -channel attacks targeting cryptographic devices protected by the Advanced Encryption \nStandard (AES).  The research introduces the assessment of guessing entropy (GE) and the associated uncertainty in \nmachine -learning -based attacks that rely on power measurements. For the first time, GE was evaluated for the entir e key, \nand uncertainty was applied to the side -channel attack, making the device more decisive in terms of vulnerability. The \nattack employs a multilayer perceptron (MLP) to classify power traces leaked from physically accessible devices, with a \npublic dat abase used to ensure reproducibility. Critical values for resilient state estimation can be used to quantify \nuncertainty in key byte retrieval and then projected to the total key using Monte Carlo analysis. The findings reveal that \nthe former holds a proba bility of 10% based on roughly 4000 attack traces, whereas the latter holds for fewer than ten \nattempts. This means that the side -channel attack could reveal a complete cryptographic key near one in every ten tries \nacross one hundred similar gadgets, underscoring a huge safety vulnerability, especially in IoT settings. The study reflects \nthat the field requires better vulnerability testing and enhanced countermeasures.  \nWith the rise of the Internet of Things (IoT), vast amounts of data that re quire processing are generated. Although cloud \ncomputing usually solves such tasks, they have disadvantages, such as latency and security fields.  Fog computing has \n\n \nMetaheuristic Optimization Review (MOR)                                                                         Vol. 04, No. 01, PP. 41-49, 2025  \n47 \nDOI: https://doi.org/10.54216/MOR.04010 5  \nReceived: February  05, 2025 Revised: March 03, 2025 Accepted: May 0 9, 2025  emerged to complement cloud computing, enhancing the Quality of Service (QoS) by addressing  these limitations. \nHowever, it is challenging to decide which node to choose because of cloud and fog node heterogeneity; fog nodes are \nresource -constrained and have limited processing capability. As a result, to fully exploit the fog nodes, this paper de velops \na secure two -step service placement framework. The first step involves classifying services to determine whether they \nshould be processed on the cloud or fog tier, using an improved adaptive neuro -fuzzy inference system (ANFIS) for \nprediction. The s econd step applies a novel metaheuristic -based hybrid algorithm combining a chaotic -based grasshopper \noptimization algorithm (CGOA) with a genetic algorithm (GA) to schedule services at the fog tier. The proposed CGOA \nadapts the shortcomings of the basic G OA, such as slow convergence and being a victim of local minima, by using ideas \nfrom chaos theory and Opposition -based learning. The cumulative makespan, total functions executed and energy used \nby the proposed model, upon testing with Google trace dataset , were found to yield better percentage improvements by \nan average of 9.2% on makespan, 4.25 % on the total functions executed and 2.75 % on the energy dissipation as compared \nto the existing literature.  \nCloud computing is a rapidly emerging distributed computing model that offers utility computing services over the \nInternet context suitable for large -scale, workflow -based, large -application solutions for business and science. More \nspecifically,  the issue of scheduling the multiple workflows that compris e a processing pipeline is critical since it \ndetermines execution time and associated costs. This paper presents an enhanced workflow scheduling approach by \nhybridizing the recent Ant -Lion Optimization (ALO) algorithm with Particle Swarm Optimization (PSO) , specifically \ndesigned for cloud environments. A security mechanism using the Data Encryption Standard (DES) is also incorporated \nto secure cloud data during the scheduling process. The proposed hybrid optimization is expected to enhance the \nscheduling ou tcome and security compared to other frameworks. The proposed method is validated with the help of the \nCloudSim tool, which analyzes cost, load balancing, and makespan. The results show that the proposed method \noutperforms existing approaches such as round robin  (RR), ALO, PSO, and GA -PSO, reducing costs by up to 30% \ncompared to RR, with similar load balancing and makespan improvements. The proposed system also shows energy \nefficiency and system reliability advantages.  \nThe problem that internet users face t oday is the emergence of various types of viral software, particularly polymorphic \nviruses that are more flexible than traditional viruses. This is because polymorphic malware modifies some features aimed \nat escaping detection by traditional models of pick ing out incidents based on signatures, To address this, the study \nexamines the following machine learning algorithms to distinguish the most accurate algorithm detecting malware. A \nhigh detection ratio was used to decide which algorithm was the most effect ive, and the confusion matrix was used to \ndetermine the number of false positives and false negatives to measure the system's efficacy. The work showed that \nspectrum symmetry could  be used to identify malicious traffic and enhance the cyber protection of com puter networks \nbased on the comparison of various models such as Naive Bayes, SVM, J48, and RF. The findings revealed that Decision \nTrees (DT) achieved the highest detection accuracy (99%), followed by Convolutional Neural Networks (CNN) at 98.76% \nand Supp ort Vector Machines (SVM) at 96.41%. Additionally, DT, CNN, and SVM achieved low false positive rates \n(FPR) of 2.01%, 3.97%, and 4.63%, respectively, underscoring the importance of advanced detection methods as malware \nbecomes increasingly sophisticated.  \nMalware is constantly changing,; therefore improvised ways of detecting it are required. Dynamic malware detection is \nproposed to combat the ever -emerging and even more complex internet. As for the problem discussed in the paper, \ntraditional manual heurist ic approaches to addressing the enormous volume of malicious programs are no longer \nsufficient. Based on this, the study demonstrates an automatic behavior -based malware detection and evaluation of threats \nin an emulation environment using machine -learning  algorithms. Such behaviors are logged down, encoded, and \nquantized into vectors in sparse model forms for further use. Classifiers such as k -Nearest Neighbors (kNN), Decision \nTrees (DT), Random Forest (RF), AdaBoost, Stochastic Gradient Descent (SGD), Ext ra Trees, and Gaussian Naive Bayes \n(NB) were applied to synthesize the results. RF, SGD, Extra Trees, and Gaussian NB classifiers achieved 100% accuracy, \nwith perfect precision (1.00), recall (1.00), and F1 -scores (1.00) in the testing phase. The implicati ons explain automatic \nbehavior -based malware analysis when augmented with machine learning for the rapid identification of emerging \nmalware threats to be efficient.  \nThe analyzed publications show the centrality of AI, ML, and DL in present -day cyber securi ty strategies in response to \nproblems such as ransomware or attacks on IoT devices. These technologies enhance stronger, flexible and timely \ncountermeasures to new risks. In addition, they offer solutions that allow various types of protection, such as hea lthcare, \ncloud, and industrial networks for businesses at scale. Since the threat moves dynamically, there is a need for the constant \ndevelopment of these fields to help protect structures that are connected to digital technology. More specifically, the ne xt \nstudies need to devote their efforts to enhancing these systems' scalability, soundness, and interpretability to build a step  \nahead of cyber adversaries [ 30]. \n3. Conclusion  \nThis literature review focuses on the current trends in enhancing cyber security tec hnologies through AI, ML, and DL for \ncurrent cyber threats. From ransomware detection and intrusion detection systems (IDS) to IoT and cloud computing \n\n \nMetaheuristic Optimization Review (MOR)                                                                         Vol. 04, No. 01, PP. 41-49, 2025  \n48 \nDOI: https://doi.org/10.54216/MOR.04010 5  \nReceived: February  05, 2025 Revised: March 03, 2025 Accepted: May 0 9, 2025  security, these approaches have proven essential in combating increasingly sophisticated and adaptive cyb er-attacks. Such \nintegration proves that the application of machine learning models alongside traditional ones increases the overall \ndetection rate, minimizes false positives, and improves system overall system durability. Furthermore, deploying \nmetaheuris tic algorithms, adversarial training, and explainable AI (XAI) shows promise in creating more adaptive and \nrobust security solutions. However, due to the ever -changing nature of cyber threats, further research could help maintain \ntheir relevance, efficienc y and ability to neutralize new threats on a large scale. It is therefore advisable that future \nendeavors be directed towards enhancing visibility, increasing potential response rates in rinl -time, and continuing to \nexplore other arenas where similar inven tions may be applied in otoahead of the causes of cyber security threats.  \nReferences  \n[1] R. Alkanhel, E. -S. El -Kenawy, A. Abdelhamid, A. Ibrahim, M. Alohali, et al., “Network intrusion detection \nbased on feature selection and hybrid metaheuristic optimization,”  Computers, Materials and Continua , vol. 74, \npp. 2677 –2693, 2022, doi: 10.32604/cmc.2023.033273.  \n[2] L. Saha, H. K. Tripathy, T. Gaber, H. El -Gohary, and E. -S. M. El -Kenawy, “Deep churn prediction method for \ntelecommunication industry,”  Sustainability , vol. 15,  no. 5, Art. no. 5, 2023, doi: 10.3390/su15054543.  \n[3] A. H. Salem, S. M. Azzam, O. E. Emam, and A. A. Abohany, “Advancing cybersecurity: a comprehensive \nreview of AI -driven detection techniques,”  Journal of Big Data , vol. 11, no. 1, p. 105, 2024.  \n[4] B. R. Maddir eddy and B. R. Maddireddy, “Evolutionary algorithms in AI -driven cybersecurity solutions for \nadaptive threat mitigation,”  International Journal of Advanced Engineering Technologies and Innovations , vol. \n1, no. 2, Art. no. 2, 2021.  \n[5] B. M. Ampel, S. Samtani, H. Zhu, H. Chen, and J. F. Nunamaker Jr., “Improving threat mitigation through a \ncybersecurity risk management framework: a computational design science approach,”  Journal of Management \nInformation Systems , vol. 41, no. 1, pp. 236 –265, 2024, doi: 10.1080/0 7421222.2023.2301178.  \n[6] L. Gudala, M. Shaik, and S. Venkataramanan, “Leveraging machine learning for enhanced threat detection and \nresponse in zero trust security frameworks: an exploration of real -time anomaly identification and adaptive \nmitigation strategi es,” 2021. Accessed: Oct. 11, 2024. [Online]. Available:  \nhttps://thesciencebrigade.com/JAIR/article/view/222 . \n[7] E. Altulaihan, M. A. Almaiah, and A. Aljughaiman, “Cybersecurity t hreats, countermeasures and mitigation \ntechniques on the IoT: future research directions,”  Electronics , vol. 11, no. 20, Art. no. 20, 2022, doi: \n10.3390/electronics11203330.  \n[8] S. Al -Sarawi, M. Anbar, B. A. Alabsi, M. A. Aladaileh, and S. D. A. Rihan, “Passiv e rule -based approach to \ndetect sinkhole attack in RPL -based Internet of Things networks,”  IEEE Access , vol. 11, pp. 94081 –94093, 2023.  \n[9] A. Alomiri, S. Mishra, and M. AlShehri, “Machine learning -based security mechanism to detect and prevent \ncyber -attack in  IoT networks,”  International Journal of Computing and Digital Systems , vol. 16, no. 1, pp. 645 –\n659, 2024, doi: 10.12785/ijcds/160148.  \n[10] K. A. ElDahshan, A. A. AlHabshy, and B. I. Hameed, “Meta -heuristic optimization algorithm -based hierarchical \nintrusion de tection system,”  Computers , vol. 11, no. 12, Art. no. 12, 2022, doi: 10.3390/computers11120170.  \n[11] R. Ghanbarzadeh, A. Hosseinalipour, and A. Ghaffari, “A novel network intrusion detection method based on \nmetaheuristic optimisation algorithms,”  Journal of Amb ient Intelligence and Humanized Computing , vol. 14, no. \n6, pp. 7575 –7592, 2023, doi: 10.1007/s12652 -023-04571 -3. \n[12] A. Alzaqebah, I. Aljarah, O. Al -Kadi, and R. Damaševičius, “A modified grey wolf optimization algorithm for \nan intrusion detection system,”  Mathematics , vol. 10, no. 6, Art. no. 6, 2022, doi: 10.3390/math10060999.  \n[13] N. Savanović, A. Toskovic, A. Petrovic, M. Zivkovic, R. Damaševičius, et al., “Intrusion detection in healthcare \n4.0 Internet of Things systems via metaheuristics optimized machine lear ning,”  Sustainability , vol. 15, no. 16, \nArt. no. 16, 2023, doi: 10.3390/su151612563.  \n[14] R. Gupta, S. Tanwar, S. Tyagi, and N. Kumar, “Machine learning models for secure data analytics: a taxonomy \nand threat model,”  Computer Communications , vol. 153, pp. 406 –440, 2020, doi: \n10.1016/j.comcom.2020.02.008.  \n[15] I. H. Sarker, Y. B. Abushark, F. Alsolami, and A. I. Khan, “IntruDTree: a machine learning based cyber security \nintrusion detection model,”  Symmetry , vol. 12, no. 5, Art. no. 5, 2020, doi: 10.3390/sym12050754.  \n\n \nMetaheuristic Optimization Review (MOR)                                                                         Vol. 04, No. 01, PP. 41-49, 2025  \n49 \nDOI: https://doi.org/10.54216/MOR.04010 5  \nReceived: February  05, 2025 Revised: March 03, 2025 Accepted: May 0 9, 2025  [16] Z. K. Maseer, R. Yusof, N. Bahaman, S. A. Mostafa, and C. F. M. Foozy, “Benchmarking of machine learning \nfor anomaly based intrusion detection systems in the CICIDS2017 dataset,”  IEEE Access , vol. 9, pp. 22351 –\n22370, 2021, doi: 10.1109/ACCESS.2021.3056614.  \n[17] Y. Imrana, Y. Xiang, L. Ali, and Z. Abdul -Rauf, “A bidirectional LSTM deep learning approach for intrusion \ndetection,”  Expert Systems with Applications , vol. 185, p. 115524, 2021, doi: 10.1016/j.eswa.2021.115524.  \n[18] A. Sharma, H. Babbar, S. Rani, D. K. Sah, S. Sehar, et al., “MHSEER: a meta -heuristic secure and energy -\nefficient routing protocol for wireless sensor network -based industrial IoT,”  Energies , vol. 16, no. 10, Art. no. \n10, 2023, doi: 10.3390/en16104198.  \n[19] A. Kanneboina and G. Sundaram, “Improving sec urity performance of Internet of Medical Things using hybrid \nmetaheuristic model,”  Multimedia Tools and Applications , 2024, doi: 10.1007/s11042 -024-19188 -7. \n[20] S. Gali and V. Nidumolu, “An intelligent trust sensing scheme with metaheuristic based secure routi ng protocol \nfor Internet of Things,”  Cluster Computing , vol. 25, no. 3, pp. 1779 –1789, 2022, doi: 10.1007/s10586 -021-\n03473 -3. \n[21] O. Kuznetsov, D. Zakharov, and E. Frontoni, “Deep learning -based biometric cryptographic key generation with \npost-quantum security ,” Multimedia Tools and Applications , vol. 83, no. 19, pp. 56909 –56938, 2024, doi: \n10.1007/s11042 -023-17714 -7. \n[22] P. Arpaia, F. Caputo, A. Cioffi, A. Esposito, and F. Isgrò, “Uncertainty analysis in cryptographic key recovery \nfor machine learning -based power measurements attacks,”  IEEE Transactions on Instrumentation and \nMeasurement , vol. 72, pp. 1 –8, 2023, doi: 10.1109/TIM.2023.3284933.  \n[23] S. Singh and D. P. Vidyarthi, “An integrated approach of ML -metaheuristics for secure service placement in \nfog-cloud ecosyst em,”  Internet of Things , vol. 22, p. 100817, 2023, doi: 10.1016/j.iot.2023.100817.  \n[24] J. Kakkottakath Valappil Thekkepuryil, D. P. Suseelan, and P. M. Keerikkattil, “An effective meta -heuristic \nbased multi -objective hybrid optimization method for workflow sch eduling in cloud computing environment,”  \nCluster Computing , vol. 24, no. 3, pp. 2367 –2384, 2021, doi: 10.1007/s10586 -021-03269 -5. \n[25] M. S. Akhtar and T. Feng, “Malware analysis and detection using machine learning algorithms,”  Symmetry , vol. \n14, no. 11, Art. no. 11, 2022, doi: 10.3390/sym14112304.  \n[26] M. S. Akhtar and T. Feng, “Evaluation of machine learning algorithms for malware detection,”  Sensors , vol. 23, \nno. 2, Art. no. 2, 2023, doi: 10.3390/s23020946.  \n[27] S. Fraihat, S. Makhadmeh, M. Awad, M. A. Al -Betar, and A. Al -Redhaei, “Intrusion detection system for large -\nscale IoT NetFlow networks using machine learning with modified Arithmetic Optimization Algorithm,”  \nInternet of Things , vol. 22, p. 100819, 2023.  \n[28] F. Alqahtani, “AI -driven improvement of monthly average rainfall forecasting in Mecca using grid search \noptimization for LSTM networks,”  Journal of Water and Climate Change , vol. 15, no. 4, pp. 1439 –1458, 2024.  \n[29] N. O. Aljehane, H. A. Mengash, M. M. Eltahir, F . A. Alotaibi, S. S. Aljameel, A. Yafoz, and M. Assiri, “Golden \njackal optimization algorithm with deep learning assisted intrusion detection system for network security,”  \nAlexandria Engineering Journal , vol. 86, pp. 415 –424, 2024.  \n[30] S. Bajpai, K. Sharma, an d B. K. Chaurasia, “A hybrid meta -heuristics algorithm: XGBoost -based approach for \nIDS in IoT,”  SN Computer Science , vol. 5, no. 5, p. 537, 2024.", "files_in_pdf": []}