{"extracted_information": "reNgine هو إطار عمل آلي للاستطلاع لتطبيقات الويب، يركز على عملية استطلاع مبسطة وقابلة للتكوين بدرجة عالية عبر المحركات، وربط بيانات الاستطلاع وتنظيمها، والمراقبة المستمرة، مدعومًا بقاعدة بيانات، وواجهة مستخدم بسيطة ولكنها بديهية. يسهل reNgine على مختبري الاختراق جمع معلومات الاستطلاع بأقل قدر من التكوين.\n\nتكامل reNgine مع HackerOne:\n- إصدار reNgine 2.2.0 يأتي مع ميزة \"BountyHub\"، وهو مركز مركزي لإدارة برامج HackerOne الخاصة بالمستخدمين.\n- يتيح \"BountyHub\" مزامنة واستيراد برامج HackerOne.\n- إحدى الميزات الرئيسية لـ reNgine هي القدرة على \"الإبلاغ التلقائي عن الثغرات الأمنية إلى HackerOne\" (Automatically report Vulnerabilities to HackerOne).", "specifications": {}, "pricing": {}, "features": ["استطلاع (Reconnaissance): اكتشاف النطاقات الفرعية، تحديد عناوين IP والمنافذ المفتوحة، اكتشاف نقاط النهاية، فحص الدلائل/الملفات، جمع لقطات الشاشة، مسح الثغرات الأمنية (Nuclei, Dalfox XSS Scanner, CRLFuzzer, Misconfigured S3 Scanner)، تحديد WHOIS، كشف WAF.", "قدرات OSINT: جمع معلومات التعريف، جمع بيانات الموظفين، جمع عناوين البريد الإلكتروني، البحث في جوجل عن معلومات وعناوين URL حساسة.", "المشاريع: إنشاء مساحات مشاريع مميزة ومنفصلة لكل غرض (مثل صيد المكافآت، تعاملات العملاء، مهام الاستطلاع المتخصصة).", "الاستعلام المتقدم: إمكانية البحث المتقدم في البيانات باستخدام لغة طبيعية وعمليات مثل 'و'، 'أو'، 'ليس'.", "محركات المسح عالية التكوين: قائمة على YAML، تتيح المرونة في إنشاء وتخصيص محركات المسح.", "دعم المسح المتوازي (Parallel Scans).", "دعم المسح الفرعي (Subscans): القدرة على الاستجابة السريعة للاكتشافات الجديدة دون انتظار انتهاء المسح الكامل.", "تصور بيانات الاستطلاع.", "توليد تقارير الثغرات الأمنية بواسطة GPT: وصف مفصل للثغرات، استراتيجيات المعالجة، وتقييمات التأثير.", "توليد سطح الهجوم بواسطة GPT: تحديد الهجمات المحتملة بناءً على بيانات الاستطلاع مع شرح منطقي.", "أدوار وصلاحيات متعددة: Sys Admin, Penetration Tester, Auditor.", "تنبيهات/إشعارات قابلة للتخصيص: على Slack, Discord, و Telegram.", "ملاحظات الاستطلاع والمهام (Recon Notes and Todos).", "مسوحات مجدولة (Clocked Scans) ومسوحات دورية (Periodic Scans).", "دعم الوكيل (Proxy Support).", "معرض لقطات الشاشة مع الفلاتر.", "تصفية قوية لبيانات الاستطلاع مع اقتراحات تلقائية.", "تحديد التغييرات في بيانات الاستطلاع (النطاقات الفرعية/نقاط النهاية الجديدة/المزالة).", "تصنيف الأهداف ضمن المؤسسة.", "إزالة نقاط النهاية المكررة الذكية بناءً على عنوان الصفحة وطول المحتوى.", "تحديد النطاقات الفرعية المثيرة للاهتمام.", "أنماط GF مخصصة وقوالب Nuclei مخصصة.", "تحرير ملفات تكوين الأدوات (Nuclei, Subfinder, Naabu, amass).", "إضافة أدوات خارجية من GitHub/Go.", "التوافق مع الأدوات الأخرى: استيراد/تصدير النطاقات الفرعية/نقاط النهاية.", "استيراد الأهداف عبر IP و/أو CIDRs.", "توليد التقارير: تقارير PDF قابلة للتخصيص (تقرير مسح كامل، تقرير ثغرة أمنية، تقارير استطلاع موجزة).", "صندوق الأدوات (Toolbox): يأتي مجمعًا مع الأدوات الأكثر استخدامًا (مثل البحث عن WHOIS، كاشف CMS، البحث عن CVE).", "تحديد النطاقات ذات الصلة وTLDs ذات الصلة للأهداف.", "إيجاد رؤى قابلة للتنفيذ مثل الثغرات الأكثر شيوعًا، معرف CVE الأكثر شيوعًا، الهدف/النطاق الفرعي الأكثر عرضة للخطر.", "يمكن استخدام LLMs المحلية لتحديد سطح الهجوم ووصف الثغرات الأمنية (جديد في reNgine 2.1.0)."], "statistics": {}, "temporal_info": {"latest_version": "2.2.0", "release_notes_link": "https://rengine.wiki/whats-new/2_2_0/"}, "geographical_data": {}, "references": []}