{"extracted_information": "يحتوي المحتوى على نصائح مفصلة وممارسات مفضلة لكتابة تقارير مكافآت الأخطاء (bug bounty reports) عالية الجودة لضمان قبولها وتحقيق دفعات أعلى.", "specifications": {}, "pricing": {}, "features": [{"title": "أهمية كتابة تقارير واضحة", "description": "تؤدي التقارير الواضحة والمكتوبة جيدًا إلى تسريع عملية الفرز، وضمان فهم الفريق لاكتشافك، ومنع سوء التعامل مع التقرير. كما أنها تُرسل إشارة احترافية للشركة، مما يزيد من فرص دعوتك لبرامج خاصة أخرى. بعض الشركات تكافئ الباحثين على التقارير المكتوبة جيدًا بمكافآت إضافية. هذه الممارسات تزيد من فرص: فرز التقارير بشكل أسرع وأكثر دقة، وترك انطباع إيجابي لدى الشركات، وتحسين معدل قبول التقرير بشكل عام."}, {"title": "1: كتابة عناوين تقارير واضحة وواصفة", "details": ["يجب أن يكون العنوان واضحًا وواصفًا قدر الإمكان.", "تجنب العناوين العامة مثل 'XSS في app.example.com' أو 'ثغرة IDOR'.", "يجب أن يساعد العنوان مراجعي التقارير على فهم طبيعة الثغرة بسرعة وتقييمها.", "أمثلة على عناوين فعالة:", "-  **عنوان رديء:** \"XSS في app.example.com\"، **عنوان فعال:** \"Stored XSS في تعليقات ملف المستخدم يسمح بالاستيلاء على الحساب\".", "-  **عنوان رديء:** \"ثغرة IDOR\"، **عنوان فعال:** \"IDOR في واجهة برمجة تطبيقات الدفع يكشف سجل معاملات المستخدمين الآخرين\".", "-  **عنوان رديء:** \"تجاوز المصادقة على app.example.com\"، **عنوان فعال:** \"تجاوز المصادقة عبر وظيفة إعادة تعيين كلمة المرور\"."]}, {"title": "2: تضمين أكبر قدر ممكن من المعلومات دائمًا", "details": ["لا تفترض أن المراجع ملم بالهدف؛ اشرح نقاط الضعف وأهميتها بعبارات بسيطة.", "وثّق النتائج بوضوح وتضمين معلومات أساسية للمساعدة في الفرز:", "-  **الموقع الدقيق:** (مثل عنوان IP، اسم المضيف، النطاق أو النطاق الفرعي للنظام المتأثر).", "-  **بيانات الطلب/الاستجابة:** (اذكر جميع رؤوس الطلبات المطلوبة لإعادة إنتاج المشكلة).", "-  **تفاصيل البيئة:** (تضمين معلومات حول إصدار المتصفح، نظام التشغيل، الجهاز المحمول، و/أو ظروف الشبكة إن أمكن).", "-  **معلومات الحساب أو التكوين الأخرى:** المطلوبة لإعادة إنتاج الثغرة.", "**إضافة نصيحة للتخفيف:**", "-  يوصى بإضافة خطوات التخفيف للمساعدة في حل المشكلة بشكل أسرع.", "-  نصيحة المعالجة مفيدة بشكل خاص للشركة عند التعامل مع الثغرات الأمنية المعقدة.", "-  تقديم اقتراحات مستنيرة يوضح خبرتك ومشاركتك ويمكن أن يسرع المعالجة.", "**نصيحة:** عند الإبلاغ عن الثغرات في برامج مكافآت الأخطاء ذات النطاقات الشاملة، قم دائمًا بتضمين دليل على أن الهدف الضعيف مملوك للشركة التي تدير برنامج مكافآت الأخطاء! يمكن أن يتكون الدليل من بيانات WHOIS، أو سجلات شهادات SSL، أو معلومات الشبكة التي ينشأ منها عنوان IP!"]}, {"title": "3: كتابة خطوات إعادة إنتاج واضحة ومفصلة", "details": ["يجب أن تكون خطوات إعادة الإنتاج واضحة ومباشرة.", "لا تفترض أن المراجع ملم بالهدف؛ اكتب الخطوات كما لو أن القارئ لم يرى الهدف من قبل.", "**تنسيق الوضوح:**", "-  استخدم سطرًا واحدًا لكل تعليمات.", "-  يجب أن تساعد كل خطوة المراجع على المتابعة وإعادة إنتاج المشكلة المبلغ عنها بسرعة.", "-  اذكر أي متطلبات مسبقة مقدمًا، مثل حسابات الاختبار ذات الحقوق المحددة.", "**تضمين المواد الداعمة:**", "-  حاول تضمين مواد داعمة تساعد في إعادة إنتاج الثغرة المبلغ عنها.", "-  يمكن أن تساعد الصور الواضحة التي توثق كل خطوة أو تسجيلات الفيديو في توفير وقت المراجع عند معالجة التقرير!"]}, {"title": "4: تقديم إثبات مفهوم (PoC) عملي", "details": ["لا ترسل تقارير بإثبات مفهوم غير عامل.", "اذكر ما إذا كانت هناك أي متطلبات خاصة ليعمل حمولتك (مثلاً XSS الذي يعمل فقط على Firefox).", "تضمين المواد اللازمة لعمل إثبات المفهوم (مثلاً، ملف DTD الضار لحقن XXE).", "هذه الخطوات الإضافية تضمن أن إثبات المفهوم يعمل باستمرار وتساعد مراجعي التقارير على التحقق من المشكلة المبلغ عنها بسرعة.", "**نصيحة:** يمكن أن يوفر إثبات المفهوم بالفيديو الكثير من الوقت والجهد اللازم لشرح ثغرة للمطورين أو غير التقنيين!"]}, {"title": "5: تحديد تأثير واضح", "details": ["يجب أن يوضح قسم التأثير دائمًا تأثيرًا واضحًا ناجمًا عن الثغرة.", "يساعد التأثير الموضح جيدًا المراجع والشركة على تقييم خطورة اكتشافك بشكل صحيح.", "العديد من التقارير التي تفشل في ذكر تأثير واضح غالبًا ما تُغلق على أنها 'معلوماتية' أو 'غير قابلة للتطبيق'.", "كن محددًا وواقعيًا قدر الإمكان؛ تجنب المبالغة في تقدير التأثير أو التقليل من شأن المخاطر الجادة.", "اذكر أيضًا ما يجب أن تكون عليه النتيجة المقصودة أو المتوقعة (خاصة لأخطاء منطق العمل أو IDOR)."]}, {"title": "6: استخدام تنسيق تقرير مناسب", "details": ["تستفيد معظم نماذج التقارير من Markdown؛ استخدمه لهيكلة تقريرك.", "استخدم العناوين لتقسيم التقرير إلى أقسام، وكتل التعليمات البرمجية لتسليط الضوء على الحمولة، وعلامات الصور لتضمين الصور المضمنة.", "التقرير المنظم جيدًا أسهل في المعالجة والقراءة، مما يؤدي غالبًا إلى وقت فرز أسرع.", "التزم بالتنسيق المحدد إذا كان برنامج مكافآت الأخطاء يتطلبه، لأنه يسرع وقت الفرز."]}, {"title": "7: مراجعة الإرسال الخاص بك", "details": ["قبل النقر على زر الإرسال، خصص وقتًا لمراجعة تقريرك لضمان تقديم تقرير صالح.", "تأكد من تضمين إثبات مفهوم عملي وجميع التفاصيل الضرورية.", "أعد قراءة خطوات إعادة الإنتاج وتأكد من عدم تفويت أي تعليمات أساسية.", "**المزالق الشائعة التي يجب الانتباه إليها:**", "-  **السياق المفقود:** هل قمت بتضمين جميع المعلومات الضرورية حول نتائجك؟ كن مباشرًا قدر الإمكان.", "-  **تأكيد النطاق:** تحقق دائمًا من أن الاكتشاف المبلغ عنه في النطاق؛ تحقق مرة أخرى من عنوان IP أو المضيف المتأثر، وتضمين سجلات SSL أو بيانات WHOIS إن أمكن.", "-  **إثبات المفهوم:** تحقق مرة أخرى من أن إثبات المفهوم المضمن يعمل ولا يحتوي على أخطاء إملائية، أو عناوين URL غير صحيحة، أو أي تفاصيل أو خطوات تعليمات متبقية.", "إن تخصيص وقت إضافي لمراجعة إرسالك يمكن أن يساعدك في اكتشاف المشكلات البسيطة قبل تقديم النسخة النهائية."]}, {"title": "8: الحفاظ على نبرة احترافية طوال عملية الفرز", "details": ["كيفية التواصل أثناء عملية الفرز أمر ضروري.", "حافظ دائمًا على نبرة احترافية.", "تحل بالصبر وحاول الرد على ملاحظات المراجع أو الشركة كلما أمكن ذلك.", "تبني نبرتك الاحترافية أيضًا علاقة إيجابية مع الشركة."]}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": []}