{"extracted_information": "تقوم Bugcrowd بقياس أداء الباحثين من خلال نهج شامل يتضمن عدة مقاييس لتقييم التأثير والنجاح. تساهم جميع عمليات الإرسال في الأهداف طويلة المدى وتساعد الباحثين على التقدم في لوحات المتصدرين والحصول على دعوات لبرامج خاصة.", "specifications": {"صيغة_الدقة": "الدقة بالنسبة المئوية = [(عمليات الإرسال الصالحة) / (عمليات الإرسال الصالحة + عمليات الإرسال غير الصالحة)] * 100", "معايير_دعوة_البرامج_الخاصة": {"إجمالي_عمليات_الإرسال": "أربعة عمليات إرسال على منصة Bugcrowd (مدى الحياة)", "عمليات_إرسال_P1-P3_المقبولة": "عملية إرسال واحدة مقبولة من P1-P3 (غير مكررة وغير محلولة أو محلولة) (مدى الحياة)", "دقة_آخر_90_يومًا": "أكثر من 50% دقة في آخر 90 يومًا", "P1-P3_صالح_آخر_90_يومًا": "عملية إرسال واحدة صالحة من P1-P3 في آخر 90 يومًا"}}, "features": [{"المقياس": "Kudos/Points (نقاط التقدير)", "الوصف": "طريقة لقياس التأثير والنجاح على منصة Bugcrowd. تُمنح هذه النقاط للباحثين بناءً على مستوى أولوية (Priority level) عمليات الإرسال الخاصة بهم."}, {"المقياس": "Duplicate (مكرر)", "الوصف": "عملية إرسال صالحة، ولكن سبق تقديمها من قبل باحث آخر/مستخدم Bugcrowd أو مشكلة معروفة. تُمنح النقاط لعملية الإرسال المكررة عندما يقبل أصحاب البرنامج الخطأ الأصلي. يُقدر العمل البحثي حتى لو لم يكن الأول في الوصول."}, {"المقياس": "Valid/Invalid Submission (عملية إرسال صالحة/غير صالحة)", "الوصف": {"صالحة": "تُعرّف عمليات الإرسال الصالحة بأنها في حالة نهاية Resolved (تم الحل)، Unresolved (قيد الحل)، أو Won’t Fix (لن يتم الإصلاح).", "غير_صالحة": "تُعرّف عمليات الإرسال غير الصالحة بأنها في حالة نهاية Out of Scope (خارج النطاق) أو Not Reproducible (غير قابلة للاستنساخ)."}}, {"المقياس": "Accuracy (الدقة)", "الوصف": "تُحسب بقسمة إجمالي عدد الثغرات الصالحة التي تم إرسالها على إجمالي عدد عمليات الإرسال الصالحة وغير الصالحة. لا تُستخدم عمليات الإرسال التي تكون 'غير قابلة للتطبيق' في حساب الدقة.", "الصيغة": "موضحة في قسم 'المواصفات'."}, {"المقياس": "Priority Percentiles (النسب المئوية للأولوية)", "الوصف": "تُحدد النسب المئوية بناءً على عدد عمليات الإرسال الصالحة وغير المكررة مقارنة ببقية الباحثين. تعتمد على عمليات الإرسال: Won’t Fix, Unresolved, و Resolved. كل نسبة مئوية هي مقارنة لحجم إرسالات الباحث بجميع الباحثين الآخرين على مدار فترة زمنية محددة؛ كلما ارتفعت النسبة المئوية، زادت عمليات الإرسال للباحث لهذا المستوى من الأولوية مقارنة بالآخرين."}, {"المقياس": "Rank (الترتيب)", "الوصف": "يُحدد ترتيبك بناءً على إجمالي عدد النقاط التي كسبتها لعمليات الإرسال الصالحة مقارنة بالباحثين الآخرين. كلما زاد عدد نقاطك، ارتفع ترتيبك!"}], "statistics": {}, "temporal_info": {"فترة_حساب_الدقة_للدعوات_الخاصة": "آخر 90 يومًا", "فترة_إرسال_P1-P3_للدعوات_الخاصة": "آخر 90 يومًا"}, "geographical_data": {}, "references": ["وثائق 'Getting Rewarded'", "وثائق 'Getting Rewarded: Earning Points for Duplicate Bugs'", "وثائق 'Assigning Submission Statuses'", "وثائق 'Performance Stats: Accuracy'", "وثائق 'Performance Stats: Priority Percentile'", "وثائق 'Researcher Dashboard'", "مدونة Bugcrowd: 'Waitlisted applications: how do they work?'", "مدونة Bugcrowd: 'Introducing Joinable Programs'"]}