{"extracted_information": "توفر ورقة الغش الخاصة بالإفصاح عن الثغرات الأمنية من OWASP إرشادات للباحثين الأمنيين والمؤسسات حول عملية الإفصاح عن الثغرات. تهدف إلى تعزيز التعاون وتقليل النزاعات بين الطرفين.", "specifications": {"ارشادات_للباحثين_الأمنيين": ["التأكد من أن أي اختبار قانوني ومصرح به.", "احترام خصوصية الآخرين.", "بذل جهود معقولة للاتصال بفريق الأمن في المنظمة.", "تقديم تفاصيل كافية للسماح بالتحقق من الثغرات الأمنية وإعادة إنتاجها.", "عدم طلب الدفع أو المكافآت مقابل الإبلاغ عن الثغرات خارج برنامج مكافآت الأخطاء (Bug Bounty Program) القائم."], "ارشادات_للمؤسسات": ["توفير طريقة واضحة للباحثين للإبلاغ عن الثغرات بشكل آمن.", "تحديد نطاق وشروط أي برامج لمكافآت الأخطاء بوضوح.", "الاستجابة للتقارير في جدول زمني معقول.", "التواصل بصراحة مع الباحثين.", "عدم التهديد باتخاذ إجراءات قانونية ضد الباحثين.", "طلب معرّفات CVEs عند الاقتضاء.", "نشر استشارات أمنية واضحة وسجلات تغيير (changelogs).", "تقديم المكافآت والتقدير."], "نماذج_الإفصاح": {"الإفصاح_الخاص": {"الوصف": "يتم الإبلاغ عن الثغرة بشكل خاص للمنظمة. قد تختار المنظمة نشر التفاصيل ولكن هذا يكون بتقديرها، مما يعني أن العديد من الثغرات قد لا تُنشر علناً أبداً. تتطلب معظم برامج مكافآت الأخطاء هذا النموذج.", "المشكلة_الرئيسية": "إذا كان البائع لا يستجيب، أو يقرر عدم إصلاح الثغرة، فقد لا تُنشر التفاصيل علناً أبداً. تاريخياً، أدى هذا إلى لجوء الباحثين إلى نهج الإفصاح الكامل."}, "الإفصاح_الكامل": {"الوصف": "يتم نشر التفاصيل الكاملة للثغرة علناً بمجرد تحديدها، بما في ذلك أحياناً رمز الاستغلال، وغالباً ما يكون ذلك قبل توفر التصحيح. يُستخدم هذا النهج بشكل أساسي رداً على تجاهل المنظمات للثغرات المبلغ عنها، للضغط عليها لتطوير ونشر إصلاح.", "الجدل": "يُعتبر هذا النهج مثيراً للجدل وغير مسؤول من قبل الكثيرين. يجب النظر إليه فقط كملاذ أخير عندما تفشل جميع الطرق الأخرى، أو عندما يكون رمز الاستغلال متاحاً للجمهور بالفعل."}, "الإفصاح_المسؤول_أو_المنسق": {"الوصف": "يسعى لإيجاد حل وسط معقول بين النهجين السابقين. يتم التقرير الأولي بشكل خاص، ولكن يتم نشر التفاصيل الكاملة بمجرد توفر التصحيح (أحياناً مع تأخير للسماح بمزيد من الوقت لتثبيت التصحيحات). في كثير من الحالات، يوفر الباحث أيضاً مهلة للمنظمة للاستجابة أو توفير تصحيح، وإذا لم يتم الالتزام بالمهلة، قد يعتمد الباحث نهج الإفصاح الكامل.", "مثال": "يعتمد مشروع Google Project Zero نهجاً مشابهاً حيث يتم نشر التفاصيل الكاملة للثغرة بعد 90 يوماً بغض النظر عما إذا كانت المنظمة قد نشرت تصحيحاً أم لا."}}, "الإبلاغ_عن_الثغرات_إرشادات_للباحثين": {"تحذيرات_وقانونية": ["معرفة وفهم القوانين في ولايتك القضائية قبل إجراء أي بحث أمني أو الإبلاغ عن الثغرات.", "إذا كنت تجري اختباراً ضمن برنامج مكافآت الأخطاء، فقد تكون هناك سياسات 'الملاذ الآمن' التي تسمح لك بإجراء الاختبار بشكل قانوني طالما بقيت ضمن النطاق والقواعد.", "لا تطلب الدفع أو مكافآت أخرى كشرط لتقديم معلومات عن الثغرات الأمنية، أو مقابل عدم نشر التفاصيل، حيث قد يشكل ذلك ابتزازاً.", "مدفوعات مكافآت الأخطاء تُعتبر دخلاً وقد تكون خاضعة للضريبة.", "إذا وجدت ثغرات كجزء من عملك أو على معدات يملكها صاحب العمل، فقد يمنعك صاحب العمل من الإبلاغ عنها أو المطالبة بمكافأة."], "إيجاد_تفاصيل_الاتصال": ["برامج مكافآت الأخطاء (مثل BugCrowd، HackerOne، huntr.dev، Open Bug Bounty، Standoff).", "ملف security.txt على الموقع الإلكتروني في `/.well-known/security.txt`.", "نظام تتبع المشاكل الحالي.", "عناوين البريد الإلكتروني العامة مثل `security@` أو `abuse@`.", "صفحة 'اتصل بنا' العامة على الموقع الإلكتروني.", "منصات التواصل الاجتماعي.", "الاتصال بالمنظمة هاتفياً.", "التواصل مع المجتمع."], "التقرير_الأولي": ["يجب أن يتضمن تفاصيل كافية للثغرة للسماح بفهمها وإعادة إنتاجها.", "طلبات واستجابات HTTP، مقتطفات HTML، لقطات شاشة أو أي أدلة داعمة (مع إخفاء البيانات الشخصية).", "رمز إثبات المفهوم (إن وجد).", "تأثير الثغرة.", "أي مراجع أو قراءات إضافية قد تكون مناسبة.", "يفضل أن يكون عبر قناة مشفرة (مثل مفاتيح PGP).", "يجب كتابة التقارير بلغة واضحة وبسيطة، وقد يكون من المفيد تقديم توصيات حول كيفية التخفيف أو الحل.", "إذا كنت تخطط لنشر التفاصيل بعد فترة، يجب إبلاغ ذلك بوضوح في البريد الإلكتروني الأولي."], "التواصل_المستمر": "ضرورة التواصل المهني والإيجابي، حتى لو تطلب حل المشكلة وقتاً طويلاً. قد تكون هناك حاجة لمتابعة المنظمة إذا أصبحت غير مستجيبة. التحلي بالصبر حيث تستغرق عملية حل الثغرات في بيئات المؤسسات وقتاً أطول بكثير مما يتوقعه معظم الباحثين.", "متى_يجب_الاستسلام": "في حال تجاهل المنظمة أو عدائيتها: يمكن الإفصاح علناً (مع المخاطرة)، أو الإفصاح المجهول، أو الإبلاغ لجهة خارجية (مثل هيئة تنظيمية)، أو المضي قدماً. لا تستحق المخاطرة بمستقبلك من أجل منظمة لا تهتم بالأمن.", "النشر": "بمجرد تصحيح الثغرة (أو عدم تصحيحها)، يتم اتخاذ قرار بشأن نشر التفاصيل، ويفضل أن يكون بالتشاور مع البائع. يجب أن يتضمن الإفصاح ملخصاً رفيع المستوى للثغرة وتأثيرها، وتفاصيل الإصدارات المتأثرة والمُصلحة، والتفاصيل الفنية، والحلول المؤقتة، وروابط إلى استشارات البائع، والجدول الزمني للاكتشاف والتواصل والإصدار. قد تطلب بعض المنظمات تأخير النشر."}, "استقبال_تقارير_الثغرات_إرشادات_للمؤسسات": {"برامج_مكافآت_الأخطاء": {"الوصف": "تحفز الباحثين على تحديد الثغرات والإبلاغ عنها عن طريق تقديم مكافآت، وعادة ما تكون مالية. غالباً ما تدار من خلال طرف ثالث (مثل BugCrowd أو HackerOne).", "التعريفات_الضرورية_عند_التنفيذ": ["الأنظمة والتطبيقات ضمن النطاق (أنظمة حية أم بيئة اختبار؟ استبعاد أنظمة الطرف الثالث).", "أنواع الثغرات المؤهلة للمكافآت (مشاكل SSL/TLS؟ رؤوس أمن HTTP مفقودة؟ كشف الإصدار؟).", "الأحكام القانونية مثل سياسات الملاذ الآمن (مثال: disclose.io).", "مقدار المكافآت وكيفية اتخاذ القرار.", "الجدول الزمني للاستجابة الأولية، التأكيد، الدفع، وحل المشكلة."], "متى_يتم_تنفيذها": "تُستخدم من قبل المنظمات الكبيرة، وتتطلب استثماراً كبيراً في الوقت والموارد. لا ينبغي أن تُستخدم إلا من قبل المنظمات التي لديها بالفعل عملية ناضجة للإفصاح عن الثغرات، مدعومة بعمليات داخلية قوية لحل الثغرات.", "التحديات": ["وقت وموارد كافية للاستجابة للتقارير.", "موظفون ذوو مهارات كافية لفرز التقارير بشكل فعال (تتضمن العديد من التقارير غير المفيدة أو الإيجابية الكاذبة).", "التعامل مع عدد كبير من الإيجابيات الكاذبة والتقارير غير المهمة.", "تأثير اختبار الأفراد للأنظمة الحية (بما في ذلك المهاجمين غير المهرة الذين يستخدمون أدوات آلية).", "عدم القدرة على التمييز بين حركة المرور المشروعة للاختبار والهجمات الضارة.", "الباحثون الذين يخرجون عن النطاق.", "التكلفة المالية لتشغيل البرنامج.", "التعامل مع الباحثين غير الراضين عن كيفية إدارة البرنامج."]}, "نشر_تفاصيل_الاتصال": ["جهة اتصال أمنية مخصصة على صفحة 'اتصل بنا'.", "تعليمات مخصصة للإبلاغ عن مشاكل الأمن على متتبع الأخطاء.", "عنوان البريد الإلكتروني الشائع `security@`.", "ملف security.txt على الموقع الإلكتروني في `/.well-known/security.txt`.", "استخدام برنامج مكافآت أخطاء طرف ثالث.", "التأكد من أن الموظفين الأماميين (مثل مراقبي عنوان الاتصال الرئيسي، الدردشة عبر الويب، خطوط الهاتف) على دراية بكيفية التعامل مع تقارير المشاكل الأمنية."], "توفير_إرشادات_الإبلاغ": ["طلب معلومات محددة للمساعدة في تأكيد وحل المشكلة.", "استخدام فئات محددة أو وضع علامة على المشكلة كسرية في متتبع الأخطاء.", "توفير مفاتيح PGP للتواصل المشفر.", "تحديد جدول زمني للاستجابة الأولية والفرز.", "تحديد أحكام الملاذ الآمن."], "التواصل_مع_الباحثين": {"العملية_المثالية": ["الاستجابة للطلب الأولي لتفاصيل الاتصال بآلية واضحة للباحث لتقديم معلومات إضافية.", "الإقرار بتفاصيل الثغرة وتوفير جدول زمني للفرز.", "طلب توضيحات أو تفاصيل إضافية إذا لزم الأمر.", "تأكيد الثغرة وتوفير جدول زمني لتطبيق الإصلاح (وتأكيد تفاصيل أي مكافأة).", "إذا لزم الأمر، اطلب من الباحث إعادة اختبار الثغرة.", "تأكيد حل الثغرة.", "توفير تحديثات منتظمة للحالة الحالية والجدول الزمني المتوقع."], "الباحثون_الذين_يطالبون_بالدفع": "يمكن طلب إجراء الإفصاح من خلال منصة مكافآت أخطاء وساطة، حيث توفر مستوى من الحماية لكلا الجانبين."}, "الإفصاح_المنظمة": {"البرامج_التجارية_والمفتوحة_المصدر": {"الهدف": "يجب نشر التفاصيل في استشارة أمنية للبرنامج بمجرد حل الثغرة. لا يجعل نشر التفاصيل المنظمة تبدو سيئة، بل يعزز الثقة في أمن البرنامج.", "المحتوى_الأساسي_للاستشارة_الأمنية": ["ملخص رفيع المستوى للثغرة، بما في ذلك التأثير.", "قائمة واضحة بالإصدارات المتأثرة.", "قائمة واضحة بإصدارات التصحيح.", "أي محاذير حول متى يكون البرنامج معرضاً للخطر (على سبيل المثال، إذا تأثرت فقط تكوينات معينة).", "أي حلول مؤقتة أو تخفيفات يمكن تطبيقها كإصلاح مؤقت.", "معرف CVE للثغرة."], "المحتوى_الإضافي_الموصى_به": ["الجدول الزمني لعملية الإفصاح عن الثغرة.", "تقدير للباحث الذي حدد الثغرة.", "تفاصيل فنية للثغرة.", "توقيعات IDS/IPS أو مؤشرات أخرى للاختراق."], "طرق_النشر": ["صفحة مخصصة 'للأمن' أو 'الاستشارات الأمنية' على الموقع الإلكتروني.", "قائمة بريدية أمنية أو منتدى.", "الربط من سجلات التغيير وملاحظات الإصدار الرئيسية."]}, "الأنظمة_الخاصة": {"القرار": "يجب اتخاذ قرار بشأن ما إذا كان ينبغي نشر التفاصيل بمجرد حل الثغرة. يساعد النشر على إظهار أن المنظمة تتخذ نهجاً استباقياً وشفافاً للأمن، ولكنه يمكن أن يؤدي أيضاً إلى كشف تفاصيل محرجة أو تكوينات خاطئة. يجب تقييم القرار بعناية، وقد يكون من الحكمة طلب المشورة القانونية."}}, "مكافأة_الباحثين": "إذا حدد الباحثون وقدموا تقارير عن الثغرات خارج برنامج مكافآت الأخطاء (ويعملون باحترافية)، فمن الجيد تقديم نوع من المكافأة لتشجيع التفاعل الإيجابي المستقبلي. يمكن أن تشمل المكافآت غير النقدية خصومات، عناصر افتراضية، هدايا (مثل القمصان)، أو تقدير في 'قاعة الشرف'."}}, "pricing": {}, "features": ["إرشادات موجهة للباحثين الأمنيين.", "إرشادات موجهة للمؤسسات.", "تحديد نماذج الإفصاح المختلفة (خاص، كامل، مسؤول/منسق).", "إرشادات تفصيلية للإبلاغ عن الثغرات من منظور الباحث (بما في ذلك الجوانب القانونية، وإيجاد جهات الاتصال، ومحتوى التقرير الأولي، والتواصل المستمر).", "إرشادات تفصيلية لاستقبال تقارير الثغرات من منظور المنظمة (بما في ذلك برامج مكافآت الأخطاء، ونشر تفاصيل الاتصال، وتوفير إرشادات الإبلاغ، والتواصل مع الباحثين، والإفصاح عن المعلومات، ومكافأة الباحثين).", "تقديم توصيات حول كيفية التعامل مع الباحثين الذين يطالبون بالدفع.", "توجيهات حول محتوى الاستشارات الأمنية وطرق نشرها."], "statistics": {}, "temporal_info": {"مهلة_الإفصاح_المسؤول": "في كثير من الحالات، يوفر الباحث مهلة للمنظمة للاستجابة أو توفير تصحيح. مشروع Google Project Zero ينشر التفاصيل بعد 90 يوماً بغض النظر عن توفر التصحيح."}, "geographical_data": {"ملاحظات_قانونية": "يجب على الباحثين معرفة وفهم القوانين في ولايتهم القضائية قبل إجراء أي بحث أمني. بعض البلدان لديها قوانين تقيد الهندسة العكسية. تعتمد شرعية أي تهديدات قانونية من قبل المنظمات على الولاية القضائية."}, "references": ["The CERT Guide to Coordinated Vulnerability Disclosure (https://vuls.cert.org/confluence/display/CVD/The+CERT+Guide+to+Coordinated+Vulnerability+Disclosure)", "HackerOne's Vulnerability Disclosure Guidelines (https://www.hackerone.com/disclosure-guidelines)", "Disclose.io's Vulnerability Disclosure Terms (https://github.com/disclose/disclose/tree/master/terms)"]}