{"extracted_information": "أداة sqlmap هي أداة مفتوحة المصدر لاختبار الاختراق تقوم بأتمتة عملية اكتشاف واستغلال ثغرات حقن SQL والتحكم في خوادم قواعد البيانات.", "specifications": {}, "pricing": {}, "features": [{"description": "دعم كامل لأنظمة إدارة قواعد البيانات التالية:", "details": ["MySQL", "Oracle", "PostgreSQL", "Microsoft SQL Server", "Microsoft Access", "IBM DB2", "SQLite", "Firebird", "Sybase", "SAP MaxDB", "Informix", "MariaDB", "MemSQL", "TiDB", "CockroachDB", "HSQLDB", "H2", "MonetDB", "Apache Derby", "Amazon Redshift", "Vertica", "Mckoi", "Presto", "Altibase", "MimerSQL", "CrateDB", "Greenplum", "Drizzle", "Apache Ignite", "Cubrid", "InterSystems Cache", "IRIS", "eXtremeDB", "FrontBase", "Raima Database Manager", "YugabyteDB", "Aurora", "OpenGauss", "ClickHouse", "Virtuoso", "DM8"]}, {"description": "دعم كامل لست تقنيات لحقن SQL:", "details": ["boolean-based blind (حقن أعمى يستند إلى المنطق البولياني)", "time-based blind (حقن أعمى يستند إلى الوقت)", "error-based (حقن يستند إلى الأخطاء)", "UNION query-based (حقن يستند إلى استعلامات UNION)", "stacked queries (استعلامات متراكبة)", "out-of-band (خارج النطاق)"]}, {"description": "دعم الاتصال المباشر بقاعدة البيانات دون المرور عبر حقن SQL، عن طريق توفير بيانات اعتماد DBMS، وعنوان IP، والمنفذ، واسم قاعدة البيانات."}, {"description": "دعم تعداد المستخدمين، وتجزئة كلمات المرور، والامتيازات، والأدوار، وقواعد البيانات، والجداول، والأعمدة."}, {"description": "التعرف التلقائي على تنسيقات تجزئة كلمات المرور ودعم كسرها باستخدام هجوم يستند إلى القاموس."}, {"description": "دعم تفريغ جداول قاعدة البيانات بالكامل، أو نطاق من الإدخالات، أو أعمدة محددة حسب اختيار المستخدم. يمكن للمستخدم أيضًا اختيار تفريغ نطاق من الأحرف فقط من كل إدخال عمود."}, {"description": "دعم البحث عن أسماء قواعد بيانات محددة، أو جداول محددة عبر جميع قواعد البيانات، أو أعمدة محددة عبر جداول جميع قواعد البيانات. هذا مفيد، على سبيل المثال، لتحديد الجداول التي تحتوي على بيانات اعتماد تطبيق مخصصة حيث تحتوي أسماء الأعمدة ذات الصلة على سلسلة مثل 'name' و 'pass'."}, {"description": "دعم تنزيل وتحميل أي ملف من نظام ملفات خادم قاعدة البيانات الأساسي عندما يكون برنامج قاعدة البيانات MySQL أو PostgreSQL أو Microsoft SQL Server."}, {"description": "دعم تنفيذ الأوامر التعسفية واسترداد مخرجاتها القياسية على نظام تشغيل خادم قاعدة البيانات الأساسي عندما يكون برنامج قاعدة البيانات MySQL أو PostgreSQL أو Microsoft SQL Server."}, {"description": "دعم إنشاء اتصال TCP خارج النطاق وحالة (stateful) بين جهاز المهاجم ونظام تشغيل خادم قاعدة البيانات الأساسي. يمكن أن تكون هذه القناة موجه أوامر تفاعلي، أو جلسة Meterpreter، أو جلسة واجهة مستخدم رسومية (VNC) حسب اختيار المستخدم."}, {"description": "دعم تصعيد امتيازات مستخدم عملية قاعدة البيانات عبر أمر 'getsystem' في Metasploit's Meterpreter."}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": []}