{"extracted_information": "يتناول المحتوى القضية الجنائية التاريخية التي تخص جوزيف سوليفان، كبير مسؤولي أمن المعلومات السابق في أوبر (CISO). تم الحكم على سوليفان بالإدانة في قضيتين جنائيتين لإخفائه المفاوضات مع المخترقين في محاولة للتستر على اختراق بيانات ضخم وقع في أوبر عام 2016، والذي أثر على 50 مليون عميل وأكثر من نصف مليون سائق. وقد تم هذا التستر تحت ستار برنامج مكافآت الأخطاء (bug bounty program). حكم قاضي المقاطعة الشمالية بكاليفورنيا على سوليفان بالخضوع للمراقبة لمدة ثلاث سنوات ودفع غرامة قدرها 50,000 دولار. يُنظر إلى هذه القضية كأول ملاحقة جنائية لمسؤول أمن معلومات كبير، مما يضع سابقة بأن العقوبات الجنائية مطروحة للتعامل مع سوء إدارة خروقات البيانات وإساءة استخدام برامج مكافآت الأخطاء. تُعد برامج مكافآت الأخطاء أداة أمن إلكتروني قيّمة توفر مكافآت مالية للمخترقين الأخلاقيين لاكتشاف الثغرات الأمنية، ولكن يجب أن يكون لديها قواعد أساسية واضحة تحدد النطاق والمشاركين وطرق الاختبار ومعالجة البيانات، بالإضافة إلى سياسة 'الملاذ الآمن' للمشاركين الملتزمين. القضية تبرز أهمية أن تحمي برامج مكافآت الأخطاء الشركة وليس سمعة رؤساء الأمن، وهي نقطة خلافية تم تسليط الضوء عليها في استئناف سوليفان المنتظر هذا الصيف. من المتوقع أن يوضح استنتاج قضية أوبر هذه المياه الغامضة في العلاقة بين برامج مكافآت الأخطاء والمسؤولية القانونية.", "specifications": {}, "pricing": {"fine_joseph_sullivan": "50,000 دولار", "apple_security_bounty_max": "ما يصل إلى 2 مليون دولار", "google_security_concerns_fixed_2022": 2900}, "features": [{"name": "أغراض برامج مكافآت الأخطاء", "description": "توفير مكافآت مالية للمخترقين الأخلاقيين لمساعدة المؤسسات في تحديد نقاط ضعف الأمن السيبراني."}, {"name": "هيكلة البرامج", "description": "بعض المؤسسات تدير برامجها الخاصة، بينما تستعين أخرى بمقدمي خدمات لإدارة البرامج."}, {"name": "قواعد البرامج الفعالة", "description": "تحديد نطاق البرنامج (الأنظمة والخدمات المسموح باختبارها والمحظورة)، وطرق الاختبار المعتمدة، وتحديد المشاركين (عامة أو خاصة)."}, {"name": "متطلبات المشاركين", "description": "الموافقة على عدم الوصول أو التعديل أو الحذف أو سرقة أو تخزين معلومات التعريف الشخصية (PII) أو أي بيانات أخرى، وفي حال القيام بذلك عن غير قصد، يجب إبلاغ المنظمة وحذف البيانات."}, {"name": "الملاذ الآمن (Safe Harbor)", "description": "اتفاق المنظمة على عدم اتخاذ إجراءات قانونية ضد المخترقين في حال الانتهاكات العرضية لقواعد البرنامج أو شروط الخدمة أو القوانين مثل قانون الاحتيال وإساءة استخدام الكمبيوتر."}, {"name": "شروط الأهلية للمكافأة", "description": "قد تتطلب عدم كون المخترق على قائمة العقوبات الحكومية الأمريكية أو في بلد خاضع للعقوبات."}, {"name": "رفض دفع المكافأة", "description": "يمكن للمؤسسات رفض الدفع إذا هدد المخترق بحجب المعلومات حول الثغرة الأمنية أو جعل البيانات المسروقة متاحة للجمهور."}, {"name": "أفضل الممارسات", "description": "نظام حوكمة يركز على: تحديد الأدوار والمسؤوليات، تحديد سلسلة الإبلاغ عن الثغرات، تسلسل هرمي للموافقة على دفع المكافآت، مراجعة قسم الشؤون القانونية للمدفوعات للتأكد من عدم انتهاك عقوبات مكتب مراقبة الأصول الأجنبية (OFAC)، إجراء لمعالجة المخترقين الضارين، وسياسة اتصالات داخلية لإبقاء الإدارة والمجلس على اطلاع."}], "statistics": {"uber_data_breach_affected_customers": "50 مليون عميل", "uber_data_breach_affected_drivers": "أكثر من نصف مليون سائق", "forbes_global_2000_no_vulnerability_disclosure_policy": "93% من شركات فوربس العالمية 2000"}, "temporal_info": {"uber_data_breach_year": "2016", "joseph_sullivan_probation_duration": "ثلاث سنوات", "joseph_sullivan_appellate_arguments_expected": "هذا الصيف", "google_bug_bounty_data_year": "2022", "meta_bug_bounty_data_year": "2022"}, "geographical_data": {"joseph_sullivan_sentencing_location": "المقاطعة الشمالية بكاليفورنيا", "meta_bounties_paid_countries": "أكثر من 45 دولة", "sanctions_reference": "قائمة العقوبات الحكومية الأمريكية / بلد خاضع للعقوبات"}, "references": ["https://www.uber.com/newsroom/2016-data-incident/", "https://www.justice.gov/usao-ndca/pr/former-chief-security-officer-uber-sentenced-three-years-probation-covering-data", "https://security.googleblog.com/2023/02/vulnerability-reward-program-2022-year.html", "https://security.apple.com/bounty/categories/", "https://about.fb.com/news/2022/12/metas-bug-bounty-program-2022/", "https://www.justice.gov/jmd/vulnerability-disclosure-policy", "https://www.justice.gov/criminal/criminal-ccips/page/file/983996/dl", "https://www.mozilla.org/en-US/security/bug-bounty/", "https://academic.oup.com/cybersecurity/article/7/1/tyab007/6168453", "https://www.law.com/corpcounsel/2023/10/11/ex-uber-security-chief-appeals-conviction-that-shook-cybersecurity-world/?slreturn=20240430130404"]}