{"extracted_information": "معلومات شاملة حول التسجيل على منصة YesWeHack، عملية التسجيل، ومتطلبات الحساب.", "features": [{"name": "إنشاء حساب Hunter", "description": "يجب إنشاء حساب والتحقق منه على المنصة لتقديم تقرير عن الثغرات الأمنية في برامج مكافآت الأخطاء (Bug Bounty)."}, {"name": "عملية إنشاء الحساب", "steps": ["ملء الحقول وقبول الشروط العامة للاستخدام (CGU) الخاصة بـ YesWeHack.", "النقر على زر \"Hack the planet\".", "فتح صندوق البريد الوارد لاستلام البريد الإلكتروني بعنوان \"Activate Your Account\" (تفعيل حسابك).", "النقر على زر \"Activate my account\" (تفعيل حسابي).", "بعد تسجيل الدخول، تصفح البرامج العامة لـ YesWeHack.", "\"قبول\" الشروط والأحكام للوصول إلى البرامج العامة لـ YesWeHack."]}, {"name": "البلدان المحظورة (Blacklisted Countries)", "description": "عند إنشاء حساب، يجب تحديد بلد الإقامة. يحتفظ مزود الدفع بقائمة من البلدان 'المحظورة' التي لا يُسمح فيها بتحويل الأموال. هذه البلدان تعتبر عالية المخاطر من قبل المنظمين ويتم تحديدها بواسطة مزود خدمة الدفع (MangoPay).", "details": {"allow_account_creation": "يمكن لأي شخص إنشاء حساب على المنصة بغض النظر عن بلد الإقامة.", "payment_restriction": "لا يمكن للمستخدمين معالجة المدفوعات إلى الحسابات المصرفية المستضافة في هذه البلدان.", "reward_withdrawal": "إذا حصل المستخدم على مكافأة وكان بلده 'مدرجًا في القائمة السوداء'، فقد لا يتمكن من سحب هذه المكافأة إلى حسابه المصرفي. في هذه الحالة، سيبقى المال في المحفظة الإلكترونية حتى يتم العثور على خيار دفع بديل أو يتم إزالة البلد من القائمة السوداء.", "check_country_status": "يمكن التحقق من قائمة البلدان المسموح بها لتحويل الأموال عبر الرابط المقدم (docs.mangopay.com/guides/users/country-restrictions) أو عن طريق اختيار البلد في نموذج التسجيل (yeswehack.com/auth/register) حيث ستظهر رسالة حمراء إذا كان البلد مدرجًا في القائمة السوداء."}}, {"name": "المصادقة (Authentication)", "description": "لتكوين خيارات المصادقة، اذهب إلى \"إعدادات المستخدم\" (User settings) في القائمة المنسدلة أو في القائمة الجانبية اليسرى.", "sub_features": [{"name": "تقييد الوصول إلى الجلسة (Session access restriction)", "description": "لزيادة أمان جلسات مستخدمي YesWeHack، يمكن للمستخدمين تقييد الوصول إلى جلساتهم على عنوان IP الذي بدأ الاتصال. إذا استخدم عنوان IP جديد نفس رمز الجلسة، فلن تعمل الجلسة. لا ينصح بهذه الميزة إذا كان الاتصال يستخدم بشكل مشروع عدة عناوين IP خروج مختلفة (مثل شبكات المحمول، موفري VPN).", "steps_to_enable": ["النقر على \"تعديل\" (أيقونة القلم).", "النقر على زر الراديو.", "اختيار \"كلمة مرور\".", "النقر على \"تحديث\"."]}, {"name": "كلمة المرور لمرة واحدة المستندة إلى الوقت (TOTP)", "description": "يمكن تأمين الوصول إلى الحساب باستخدام المصادقة الثنائية. يتم استخدام خوارزمية كلمة المرور لمرة واحدة المستندة إلى الوقت (TOTP) كعامل ثانٍ. بالإضافة إلى عنوان البريد الإلكتروني وكلمة المرور، يتطلب إدخال رمز مكون من ستة أرقام يعتمد على سر مشترك وصالح لمدة 30 ثانية فقط. تفعيل TOTP هو شرط أساسي للوصول إلى البرامج المصنفة كـ \"مؤمنة\" (Secured).", "steps_to_enable": ["النقر على \"تعديل\" (أيقونة القلم).", "النقر على مربع الاختيار.", "اختيار \"كلمة مرور\".", "النقر على \"تحديث\"."]}]}, {"name": "التحقق من العميل (KYC) والمصادقة القوية للعملاء (SCA)", "description": "يجب التحقق من حسابك لتقديم تقارير عن الثغرات الأمنية في البرامج وكسب المكافآت. أكمل عملية 'اعرف عميلك' (KYC)، بما في ذلك المصادقة القوية للعملاء (SCA)، للوصول إلى حساب الدفع الخاص بك.", "requirements": ["إكمال عملية KYC.", "الاشتراك في SCA."], "more_info_link": "https://helpcenter.yeswehack.io/en/articles/376519-kyc-verifications-strong-customer-authentication-sca"}]}