{"extracted_information": "تحتوي هذه الصفحة على معلومات مفصلة حول عملية التحقق من 'اعرف عميلك' (KYC) وإجراءات المصادقة القوية للعملاء (SCA) في YesWeHack. توضح أهمية كل عملية، الخطوات اللازمة لإكمالها، والمتطلبات المرتبطة بها.", "specifications": {}, "pricing": {}, "features": [{"name": "عملية التحقق من KYC (اعرف عميلك)", "description": "عملية أمنية إلزامية تؤكد هويتك، تستخدمها YesWeHack ومزود خدمة الدفع (MangoPay) للحماية من غسل الأموال ومحاولات الاحتيال. تهدف إلى بناء الثقة والشفافية. حالة 'KYC تم التحقق منها' إلزامية لتقديم التقارير في برامج مكافآت الأخطاء وتحويل المكافآت إلى حسابك البنكي.", "details": {"الهدف": "مطابقة المعايير التنظيمية، حماية ضد غسل الأموال والاحتيال.", "إلزامية لـ": ["تقديم تقرير في برامج مكافآت الأخطاء (Bug Bounty programs)", "تحويل المكافآت إلى حسابك البنكي"], "خطوات الإكمال (للمستخدمين المسجلين):": ["تسجيل الدخول إلى YesWeHack.", "اختيار 'MY E-WALLET' من القائمة المنسدلة في الزاوية اليمنى.", "النقر على 'KYC' في القائمة اليسرى.", "ملء جميع الحقول الإلزامية وتقديم وثيقة هوية صالحة.", "النقر على 'Submit'."], "وثائق الهوية المقبولة": "تعتمد على جنسية المستخدم (يُشار إلى وجود قائمة تفصيلية، ويُعتبر الصيادون العاديون 'أشخاص طبيعيين').", "رفض الهوية": "قد تُرفض الوثيقة لأسباب متعددة (مثال: الصورة غير مطابقة للقواعد). توجد إرشادات للمشكلات الشائعة. في حال استمرار الرفض، يُطلب الاتصال بـ support@yeswehack.com.", "تراجع حالة KYC ('downgraded KYC')": "تحدث عندما يقوم المستخدمون الذين أكملوا التحقق سابقًا بتحديث تفاصيلهم الشخصية (الاسم الأول، الاسم الأخير، تاريخ الميلاد). تعتبر الوثيقة السابقة غير صالحة، ويتطلب الأمر تقديم وثيقة جديدة مطابقة للمعلومات المحدثة لاستعادة الحالة الموثقة.", "التحقق للشركات": "الصيادون الذين يستخدمون حسابًا بنكيًا للشركة (وليس حسابًا شخصيًا) لسحب المكافآت يجب عليهم التحقق كشركة وإكمال خطوات تحقق إضافية. تختلف العملية حسب موقع الشركة. يُطلب الاتصال بـ support@yeswehack.com للحصول على إرشادات."}}, {"name": "إجراءات المصادقة القوية للعملاء (SCA)", "description": "طبقة حماية إضافية يطلبها مزود الدفع في YesWeHack لحماية أموالك ونشاط الدفع. هي شكل من أشكال المصادقة متعددة العوامل (MFA أو 2FA) تستخدم رقم هاتفك ورمز PIN للتحقق من هويتك.", "details": {"الهدف": "حماية الأموال ونشاط الدفع، إضافة طبقة أمان إضافية.", "متى تُطبق SCA؟": ["عند الوصول إلى حساب الدفع الخاص بك وبدء إجراءات معينة.", "المشاركة في أنشطة أخرى تعتبر محفوفة بالمخاطر."], "الإجراءات التي تتطلب SCA": ["تسجيل حساب بنكي.", "الوصول إلى معلومات المحفظة (إلا إذا تم إكمال SCA خلال الـ 180 يومًا الماضية)."], "خطوات التسجيل في SCA (للمستخدمين المسجلين):": ["تسجيل الدخول إلى المنصة.", "النقر على 'SCA' في القائمة اليسرى.", "النقر على 'Confirm my identity with SCA'.", "النقر على 'Continue'.", "سيتم إعادة التوجيه إلى عملية 'Mango Pay' الخارجية.", "قبول شروط وأحكام Mango Pay.", "النقر على 'Start your verification'.", "تأكيد عنوان بريدك الإلكتروني.", "النقر على 'Continue'.", "تحديد رمز PIN.", "النقر على 'Save'.", "إدخال رقم هاتفك المحمول.", "النقر على 'Continue'.", "إدخال الرمز الذي تلقيته على هاتفك.", "ستصبح حالة SCA الخاصة بك 'نشطة'."], "ملاحظات هامة": ["عملية SCA خارج نطاق برنامج YesWeHack Bug Bounty.", "إذا تغير أي من بياناتك الشخصية، ستحتاج إلى إكمال عملية SCA مرة أخرى للوصول إلى خدمات الدفع.", "إذا لم تنجح العملية، ستبقى حالة SCA 'غير مكتملة'، ويجب المحاولة مرة أخرى."]}}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": ["https://docs.mangopay.com/guide/kyc-further-information", "https://docs.mangopay.com/guide/guidelines-for-identity-documents", "support@yeswehack.com"]}