{"extracted_information": "YesWeHack هي منصة عالمية لمكافآت الأخطاء وإدارة الثغرات الأمنية، تهدف إلى مساعدة المؤسسات على توسيع نطاق اختبار الأمن الخاص بها ومكافحة مجرمي الإنترنت بفعالية من حيث التكلفة، وتمكين إدارة الثغرات القائمة على المخاطر.", "specifications": {}, "pricing": {"model": "ادفع فقط مقابل التقارير المستهدفة والقيمة والقابلة للتنفيذ (Pay-for-results)"}, "features": ["منصة عالمية لمكافآت الأخطاء (Bug Bounty)", "منصة إدارة الثغرات الأمنية (Vulnerability Management)", "نموذج قائم على التعهيد الجماعي والمنصة لاختبار الأمن", "الوصول إلى عشرات الآلاف من المتسللين الأخلاقيين المدققين بالكامل", "تبسيط سير عمل إدارة الثغرات الأمنية من خلال التكامل والأتمتة وميزات التعاون", "واجهة موحدة لإدارة الثغرات الأمنية من جميع المصادر (مثل Bug Bounty و VDPs واختبارات الاختراق والماسحات الضوئية)"], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": [{"type": "testimonial", "author": "Alan Chan", "title": "Chief Risk Officer, Lazada Group", "quote": "مع الطبيعة المتطورة لأمن البيانات، وكذلك الطبيعة العدوانية للمتسللين الذين يستغلون التكنولوجيا لسرقة البيانات، نؤمن بالعمل مع مجتمع الأمن السيبراني الأوسع لتعزيز أنظمتنا البيئية لتكنولوجيا المعلومات."}, {"type": "testimonial", "author": "Yann Desevedavy", "title": "Bug Bounty Program Manager, Orange France", "quote": "مكافآت الأخطاء أصبحت معيارًا أمنيًا لأنها الطريقة لتوسيع نطاق أبحاث الثغرات الخاصة بك. تحتاج إلى البدء صغيرًا، ولكن أن تبدأ الآن!", "link": "/customer-stories/start-small-but-start-now-inside-oranges-bug-bounty-journey-with-yeswehack"}, {"type": "testimonial", "author": "Ulf Andersson", "title": "Head Of Information Security, Telenor", "quote": "مكافآت الأخطاء مسألة ذكاء: هاجم نفسك قبل أن يفعل أي شخص آخر، لأنه في نهاية اليوم، لن يخبرك الفاعلون السيئون بالثغرات التي لديك."}, {"type": "article", "title": "فيكتورات الثغرات الأمنية: حقن SQL لصيادي مكافآت الأخطاء", "link": "/learn-bug-bounty/vulnerability-vectors-sql-injection"}, {"type": "article", "title": "لقد كان كشفًا: قصة أصل lemonoftroy ومنهجية الاختراق", "link": "/community/revelation-lemonoftroy-origin-story-hacking"}, {"type": "article", "title": "سلسلة إدارة التعرض المستمر للتهديدات (CTEM) #3: التعبئة والتصحيح", "link": "/security-best-practices/ctem-series-mobilisation-remediation"}], "company_background": "YesWeHack هي منصة عالمية لمكافآت الأخطاء وإدارة الثغرات الأمنية، توفر خبراء الأمن السيبراني عند الحاجة. تخدم المنظمة جميع أنواع المؤسسات، من الشركات الصغيرة إلى الشركات الكبيرة (المشاريع).", "advantages": ["توسيع نطاق اختبار الأمن بسهولة لتلبية متطلبات تكنولوجيا المعلومات والأمن", "فعالية التكلفة: ادفع فقط مقابل التقارير المستهدفة والقيمة والقابلة للتنفيذ", "تبسيط سير عمل إدارة الثغرات الأمنية", "تمكين إدارة الثغرات القائمة على المخاطر", "الحصول على نظرة عامة شاملة للمخاطر السيبرانية", "الاستفادة من مهارات عشرات الآلاف من المتسللين الأخلاقيين المدققين", "الحماية لمختلف المنظمات من الشركات الصغيرة إلى المشاريع"], "services": ["برامج مكافآت الأخطاء (Bug Bounty Programs)", "برامج الكشف عن الثغرات (Vulnerability Disclosure Programs - VDPs)", "اختبارات الاختراق (Pentests) - يتم إدارتها من خلال المنصة", "حلول إدارة الثغرات الأمنية المتكاملة"]}